[
    {
        "name": "Ayushi Raichoudhury",
        "role": "Assistant Professor",
        "email": "ayushi@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/ayushi-raichoudhury/",
        "bio": "She is a Ph.D and MBA (Finance) from KIIT School of Management, with more than 8 years of experience in teaching, research and administration. She has published research papers in various national and international journals which are indexed in Web of Science, Scopus and ABDC. She has authored a book chapter in “Methodological Issues in Management Research: Advances, Challenges and the Way Ahead”, published by Emerald. Besides, She has also presented papers in various national and international conferences of repute viz IMRA-IIMB International Conference 2015 at IIM Bangalore, 58thISLE conference 2016 held at IIT Guwahati, 61stAnnual Conference of Indian Society of Labour Economics at Patiala. Prior to joining KIIT, she was appointed by L&T Finance. Being a state level chess champion and a national level chess player; she acknowledges the importance of sports along-with academics. Her teaching interests include Financial management, Indian Financial System and Financial Inclusion.",
        "dynamic_sections": {
            "Research Publication": "Raichoudhury, Ayushi. (2020) “Major Determinants of Financial Inclusion: State-Level Evidences from India,” Vision – The Journal Of Business Perspective.\nRaichoudhury, Ayushi. (2020). “Socio-economic Development Disparity in India: An Inter-state Analysis,” Methodological Issues in Management Research: Advances, Challenges, and the way ahead.\nRaichoudhury, A., (2019). “Impact of education on PMJDY awareness and financial inclusion: A study of Puri district,” International Journal of Civil Engineering and Technology.\nRaichoudhury, Ayushi. (2018), “Financial inclusion & Poverty Reduction in India: State-wise analysis using Fischer’s Transformation”, International Journal of Business and Development Research (IJBDR), Vol. 7 (1), 19-30\nRaichoudhury, Ayushi. (2016), “Financial inclusion & human development: a cross country analysis”, Asian Journal of Business Research, Vol. 6 No. 1, pp. 34-48."
        }
    },
    {
        "name": "Ganesh V Radhakrishnan",
        "role": "Senior Professor",
        "email": "gv.radhakrishnan@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/ganesh-v-radhakrishnan/",
        "bio": "Dr. Ganesh V. Radhakrishnan serves as Senior Professor of Finance at KSOM School of Management, bringing a wealth of experience from his tenure as Central Dean of Faculty Affairs at MITWPU and as a faculty member at OP Jindal School of Management. His expertise in maritime economics and strategic leadership was honed through notable naval command positions and further developed as the maritime practice leader at PwC India. In this role, he led significant projects in partnership with global institutions and directed infrastructure development initiatives in countries including Egypt and Sri Lanka. In academia, Dr. Radhakrishnan has served in key positions such as Chief Instructor (Navigation), Training Coordinator, and Commanding Officer of a National Cadet Corps Unit. He has also held academic corporate roles as GM Career Launcher India, Director Shashi Consultancy, and as Associate Dean at OP Jindal Global University. Dr. Radhakrishnan’s research interests lie at the intersection of port economics, environment management and public systems management. He possesses a solid academic foundation with a BSc from the National Defence Academy, an MCA from Madurai Kamaraj University, a PGDM from IIM Kozhikode, and a doctorate from IIM Ahmedabad.",
        "dynamic_sections": {}
    },
    {
        "name": "Girish Chandra Dey",
        "role": "Assistant Professor",
        "email": "girish.dey@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/girish-chandra-dey/",
        "bio": "Dr. Girish Chandra Dey joined the KIIT School of Management as an Assistant Professor in the area of Operations Management in July 2025. He holds a PhD in Supply Chain Management from the Indian Institute of Technology Kharagpur, India. He has earned his M. Tech. in Industrial Engineering & Management from the Indian Institute of Technology Kharagpur, India and B.Tech. in Agricultural Engineering & Technology from Odisha University of Agriculture & Technology, Bhubaneswar. Dr. Dey has gained more than 6.5 years of teaching and research experience. Before joining KSOM, he worked as an Assistant Professor at GITAM School of Business, Visakhapatnam, Andhra Pradesh, and as a lecturer at Rajiv Gandhi University of Knowledge Technologies, R K Valley, Andhra Pradesh. He also worked as a Research Assistant at the Indian Institute of Management Ahmedabad, India. His current research interests include Critical Infrastructure Protection Planning, Supply Chain Design for Disruptions, and Sustainable Supply Chain Management.",
        "dynamic_sections": {
            "Research Publication": "Dey, G. C., & Jenamani, M. (2019). Optimizing fortification plan of capacitated facilities with maximum distance limits. OPSEARCH,56(1), 151-173.\nBaral, M. M., Rao, U. A., Rao, K. S., Dey, G. C., Mukherjee, S., & Kumar, M. A. (2023). Achieving sustainability of SMEs through industry 4.0-based circular economy.International Journal of Global Business and Competitiveness,18(2), 128-144."
        }
    },
    {
        "name": "Sumita Mishra",
        "role": "Associate Professor",
        "email": "sumita.mishra@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/sumita-mishra/",
        "bio": "Prof. Mishra is an alumnus of the Tata Institute of Social Sciences (TISS), Mumbai, where she earned a masters degree in social work. She is a Fellow from the Management Development Institute, Gurgaon. Besides having worked for organizations like CAPART, UNICEF and Tata Refractories Limited, she also has 7 years of teaching experience. She has published several papers in referred journals such as Asian Case Research Journal, Decision, Indian Journal of Industrial Relations, Management Review, International Journal of Indian Culture and Business Management etc. and has also presented papers in national and international conferences of repute. Her interests are in the area of organisational culture, group culture, Strategic Human Resource Management, Social Psychology and Organization Design.",
        "dynamic_sections": {
            "Book Publication": "Methodological Issues in Management Research: Advances, Challenges & the way ahead, Emerald Publishing Limited.\nThis edited book has essential chapters of ‘Research Methodology’, contributed by subject experts from leading institutes of India. It covers extensively both, qualitative as well as quantitative research aspects.",
            "Research Publication": "Mishra, Sumita; Subudhi, Rabi N., “The Methodological Domain in Management Research,” METHODOLOGICAL ISSUES IN MANAGEMENT RESEARCH: ADVANCES, CHALLENGES, AND THE WAY AHEAD.\nSahoo, Malabika; Mishra, Sumita, “Effects of trainee characteristics, training attitudes and training need analysis on motivation to transfer training,” MANAGEMENT RESEARCH REVIEW.\nPadhi, Shradha; Mishra, Sumita, “Effect of Honesty as an Ethical Value on Software Project Performance: A Grounded Theory Approach,” JOURNAL OF HUMAN VALUES.\nMishra, Sumita; Gupta, Rajen K., “Impact of national cultural diversity on knowledge sharing in Indian multicultural teams: an emic study,” INTERNATIONAL JOURNAL OF INDIAN CULTURE AND BUSINESS MANAGEMENT.\nPanda, G.; Mishra, S., “Impact of competency based training need assessment on individual performance: A study on employees of Essel Mining Industries,” International Journal of Engineering and Technology (UAE).\nPadhi, S.; Mishra, S., “Effect of Honesty as an Ethical Value on Software Project Performance: A Grounded Theory Approach,” Journal of Human Values."
        }
    },
    {
        "name": "Ritika Sharma",
        "role": "Associate  Dean, BBA",
        "email": "ritika.sharma@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/ritika-sharma/",
        "bio": "She has 4 years of corporate and entrepreneurial experience across FMCG, Telecom and education in domains of sales and distribution, key account management and business development. She has handled entire GSK Consumer Healthcare portfolio for leading modern trade accounts and with Airtel, she was an integral part in establishing Airtel Money foothold in Haryana region. She has an academic experience of more than 7 years. Her areas of interests include consumer behaviour, digital marketing, entrepreneurship and data analysis.",
        "dynamic_sections": {
            "Research Publication": "Bhuwandeep; Sharma, Ritika Rani, “Exploratory Study on Success of Mythological Serials,” Smart Innovation, Systems and Technologies.\nSharma, R. & Mishra, P. (2023). Factors for Customer Satisfaction for OTT Subscription Using Service Quality Framework: Impact of Quality of Content and Monetary Value on Customer Satisfaction and Willingness to Pay. In S. Sarma & N. Gupta (Eds.),Handbook of Research on the Interplay Between Service Quality and Customer Delight(pp. 188-212). IGI Global.https://doi.org/10.4018/978-1-6684-5853-2.ch010\nSharma, R.R., Mishra, P. (2023). Investigating OTT Subscription Intention Antecedents: A Review of Online Entertainment Motivations. In: Kaiser, M.S., Xie, J., Rathore, V.S. (eds) Information and Communication Technology for Competitive Strategies (ICTCS 2022). Lecture Notes in Networks and Systems, vol 615. Springer, Singapore. https://doi.org/10.1007/978-981-19-9304-6_35"
        }
    },
    {
        "name": "Ashok Kumar Sar",
        "role": "Senior Professor",
        "email": "aksar@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/ashok-kumar-sar/",
        "bio": "Prof. Ashok K. Sar is member of faculty in the Strategic Management area. He has a blend of working experience, 20 years in industry and 20 years in academics. For the last 18 years, he has been in full time academic positions (five years of academic experience as Adjunct Faculty Member concurrent to his industry assignment). He served as the Dean of Faculty, KIIT School of Management during 2010 – 2016. He teaches core courses in Strategic Management and Business Ethics & Corporate Social Responsibility and elective course in Pricing Management. He has conducted MDPs for working executives in the areas of Personal Effectiveness, Building Learning Organization, Strategy Execution, Time Management and Quality & Effectiveness through Systems Thinking. He has also developed an eight weeks executive education programme in general management for young working executives. He is in the panel of visiting faculty members at the Odisha Judicial Academy, and trains the state Judicial Officers on Management Skills. Prior to his present assignment, he worked with Bharat Petroleum Corporation Limited (BPCL) for twenty years in varied areas of responsibilities, such as,  Marketing Operations, Sales and Supply Network Planning & Development, Business Development in Retail, Industrial & Consumer Segments, LPG and Lubricants; Training & Development; Business Partner – Human Resource Management; Management Control and Reporting Systems; and Enterprise Resource Planning. He published two patents, and thirty-four papers in peer reviewed journals. Eighteen of these papers are in SCOPUS/ Web of Science/ ABDC index/ list. He has guided six Ph.D. scholars and is guiding six more scholars, who are in various stages of their research work. He has completed an ICSSR-IMPRESS funded major research project titled- “Impact of Dynamic Capability on Success of Entrepreneurs: A Study of Small and Medium Manufacturers in Odisha”.",
        "dynamic_sections": {
            "Research Publication": "Bhusan, B; SAR, AK, “Contribution of strategic human resource management towards the growth of the modern era organizations: A research study on the Indian retail industry,” EURASIAN CHEMICAL COMMUNICATIONS.\nBhusan, B; SAR, AK, “Critically analysing the concept of workplace flexibility and how it impacts employee and organizational performance: A case of the retail industry in India, “EURASIAN CHEMICAL COMMUNICATIONS.\nSar A.K., “Dls associates: The way ahead,” Prabandhan: Indian Journal of Management.\nBanerjee, Subhanil; SAR, Ashok Kumar; Pandey, Shilpa, “Improved yet Unsafe: An Aquatic Perspective of Indian Infant Mortality,” Journal of Health Management.\nSar, A.K., “Impact of competitive advantage and risk on market performance: A study of top 20 companies as per market capitalization,” Indian Journal of Finance.\nSar, A.K., “Raman’s ordeal: Executive motivation in a hostile work environment,”Prabandhan: Indian Journal of Management.\nSar, A.K., “Impact of corporate governance on sustainability: A study of the Indian FMCG industry,” Academy of Strategic Management Journal.\nSar, A.K., “Competitive advantage and performance: An analysis of Indian FMCG industry,” Academy of Accounting and Financial Studies Journal.\nSar, A.K., “The influence of management education on entrepreneurship success,” Journal of Entrepreneurship Education.\nSar, A.K., “Competitive advantage and performance: An analysis of Indian downstream oil and gas industry,” Academy of Accounting and Financial Studies Journal.\nSar, A.K.; Rath, S.P., “The dynamics of fiscal deficit and economic growth: A threshold analysis for the state of Odisha in India,” International Journal of Economic Research.\nSar, A.K.; Rath, S.P., “Fiscal sustainability of Odisha: Trends and perspective of financial indicators,” International Journal of Applied Business and Economic Research.\nKumari, N.; Sar, A.K., “Recent developments and review in behavioural finance, “International Journal of Applied Business and Economic Research."
        }
    },
    {
        "name": "Jitendra Mohanty",
        "role": "Adjunct Professor",
        "email": "jmohanty@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/jitendra-mohanty/",
        "bio": "A person with great zeal and enthusiasm has 24 years experience in credit and corporate banking in Andhra Bank,(India); National bank of Oman,Abudhabi, Investment Bank, Sharjah, National Bank of Umm Al Qwain(Dubai) and SREI Infrastructure Finance Ltd. (India). Additionally he has 21 years of experience teaching OB, HRM, Leadership in Organization, Organization Theory and Organisation Change and Development to MBA, BBA students and has guided Ph.D students.",
        "dynamic_sections": {
            "Research Publication": "Mishra, Sasmita; Mohanty, Jitendra Kumar, “The Predictors of Employee Engagement: A Study in a Ferro Alloys Company of India,” Global Business Review.\nSrivastava, U.; Mohanty, N.; Mohanty, J., “Internship: A realistic job preview and selection mechanism,” International Journal of Innovative Technology and Exploring Engineering.\nBhuyan, M.; Das, K.B.; Mohanty, J., “Product awareness of account holders under pradhan mantri jan dhan yojana (PMJDY),” Indian Journal of Finance.\nGarg, N.; Mohanty, N.; Mohanty, J., “Engineering employees work affect on mental health: A study of private sector employees in Bhubaneswar ,” International Journal of Mechanical Engineering and Technology.\nBhuyan, M.; Bar Das, K.; Mohanty, J., “Does gender influence banking awareness? A contextual study under Pradhan Mantri Jan Dhan Yojana (PMJDY),” International Journal of Mechanical Engineering and Technology.\nGarg, N.; Mohanty, N.; Mohanty, J., “A comparative study of mental wellbeing of it professionals in public and private sector,” International Journal of Mechanical Engineering and Technology.\nMishra, S.; Mohanty, J.K., “The Predictors of Employee Engagement: A Study in a Ferro Alloys Company of India,” Global Business Review."
        }
    },
    {
        "name": "B.C.M.Patnaik",
        "role": "Professor",
        "email": "bcmpatnaik@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/b-c-m-patnaik/",
        "bio": "More than24 yearsof rich experience in Educational Research, Content and Creative initiativeat both post graduate and undergraduate level, ability to handle core administration related activities such as infrastructure, facility, human resources, training and development of staff members and organizational behavior and organization development. Possessing valuable insights, keen analysis and team approach to implement best practices, adept at working in high pressure environments with strict deadlines and multiple deliverables. Introduce knowledge and assist the students to develop the skills necessary for success. As a faculty of Accounts & Finance, introduced students to the principles, process, tools and techniques becoming the foundation of their ability to understand and take up challenges throughout their education and into their professional careers. Expertise in planning, organizing, coordinating and monitoring all types of curricular and co-curricular activities for the overall development of personality of students. Devoted teacher striving to help students change marginal grades into good grades and supporting colleagues and administration in facilitating each child’s social and intellectual growth by creating an atmosphere of mutual respect and open communication.  Guided 26 Ph.D Scholars and guiding 6 scholars. Published more than 300 papers including 130 papers inScopusindexed journals. Awarded Best Faculty 4 times.",
        "dynamic_sections": {
            "Research Publication": "Patnaik.B.C.M, Singh Jeet & Yadav Preeti -“Price Earnings Ratio: An Investor’s Guide to Invest in the share of Company”.BVIMSR’S Journal of Management Research, Volume-2, Number-1. April 2010,pp-77-86 ( ISSN- 0976-4739\nPatnaik.B.C.M,  Singh Jeet & Mohanty Jyotirmaya- “An Introspective on employees performance with reference to Emotional Intelligence “ ( A case study of private sector corporate units in Odisha) :-publishedin Journal of Commerce and Management Thought (JCMT),Volume-II, Number-I, January-March 2011; pp-29-44 ( ISSN- 0976-478X)\nPatnaik.B.C.M,  Satpathy  Ipseeta &  Pradhan P.K- “ NPA’s in Home Loan: A Survey ( With special reference to selected districts of Odisha)-Published in   InternationalJournal of Research in Commerce and Management (IJRCM)-Online December 2010,Vol.-1,No.-8,pp-95-105 ( ISSN- 0976-2183)\nPatnaik.B.C.M,&  Satpathy  Ipseeta – Causes of NPA in Gramya Banks: A Survey,(A case study of Rushikulya Gramya Bank of Odisha) –Published in “ The Alternative” of BIT, Mesra, Ranchi ; April-Sept10,Vol.-9,No.-2,pp-41-55 (ISSN- 0973-0451)\nPatnaik.B.C.M, & Pradhan P.K-– The Background of Entrepreneurs’: A Survey (With special reference to education and occupation of male entrepreneurs of rural Orissa):Published in Asian Journal of Management Research (online), Vol.1, No2-2011 (January 2011), pp-402-414. ( ISSN- 2229-3795)\nPatnaik.B.C.M, & Pradhan P.KCorporate Environmental Social Responsibility (CESR): With special reference to Male and female employees of selected Private Sector Corporate units in Odisha)-Published  in February 2011 IJBEMR (online journal),Vol-2. No.-2,pp-71-82 ( ISSN- 2229-4848)\nPatnaik.B.C.M, & Pradhan P.K–Impact of Media on Brand Preference: A Study (A case study of electronic goods):published  in ELK Journal of Marketing & Retail Management,Vol.2,No.-1,December-2010,pp.-274-282 (ISSN- 0976-7193)\nPatnaik.B.C.M, Satpathy Ipseeta & Pradhan P.K– Demystifying NPAs on Education Loan: An Empirical Study: (With special reference to selected semi-urban, rural areas and bank officials of Odisha)published in GYANAPRATHA, ACCMAN Journal of Management, Vol.3, No.1January 2011, pp.-25-36. ( ISSN- 0975-0584)\nPatnaik.B.C.M,  Satpathy  Ipseeta &  Pradhan P.K–Demystifying NPAs on Education Loan: An empirical Analysis ( With special reference to selected Urban, Semi-urban and Bank officials of Odisha):Published in Amity International Strategic Management Review, Volume4, No 1, February 2011,pp-87-96\nPatnaik B.C.M:Portfolio of NPA: By Classification of Assets:Published in Financial Risk Management, RIMS Rourkela, Excel Books, February2011,pp-203-209 (ISBN-978-81-7946-910-6)\nPatnaik.B.C.M,  Satpathy  Ipseeta &  Pradhan P.K – An Empirical Study on customers preference towards service quality ( with special reference to selected banks in Odisha):Published in IJMMR on line Journal, Vol. 2,Issue 3 (March 2011),pp28-46 ( ISSN- 2229-6883)\nPatnaik.B.C.M,  &  Pradhan P.K: Know Your Entrepreneur (KYE): (with special reference to education and occupation of entrepreneurs in Odisha):Published in IJMMR online Journal , Vol. 2,Issue 3 (March 2011),pp117-129 ( ISSN- 2229-6883)\nPatnaik.B.C.M,  Mohanty Jyotirmaya &  Pradhan P.K – “Students’     Feedback on Training Methods and Techniques: A Report Card”(With special reference to selected B- Schools in Bhubaneswar, Odisha)-Published in Research Journal of Social and Life Science, Volume.IX,Year-05 of December 2010, pp143-150 ( ISSN- 0973-3914)\nPatnaik.B.C.M,   &  Pradhan P.K- Tobacco Consumes the Customer- A study among the Rural Population in Odisha”- Published in CAMS Journal of Business Studies and Research, Vol-2, No.1, January-March 2011, pp-83-98 ( ISSN- 0975-7953)\nPatnaik.B.C.M,   &  Pradhan P.K – “Students Perception on Training Methods: A Study”:Published in SIMER PRAGATI- Hospitality Management, Volume-III, Issue-1, July-Sept-2010, Page-53-62 ((ISSN-0974-2018)\nPatnaik.B.C.M,  Satpathy  Ipseeta &  Pradhan P.K – An Empirical Analysis on Employees Empowerment through Training System in Banking Sector in Odisha– Published in Srusti Management Review, Vol-IV, Issue-IV, April-2011, PP-19-26 (0974-4274)\nPatnaik.B.C.M,  &  Pradhan P.K–“ An Introspective on Consumer behavior   on the basis of demography : A Survey” ( With special reference to FMCGs)-Published in IJRCM ( online journal), Vol.No-1, Issue 1 , May 2011, PP-74-80 (ISSN-0976-2183)\nPatnaik.B.C.M, Satpathy Ipseeta & Das C..K–Employees Empowerment through Training System in Banking Sector: An Empirical Analysis (With special reference to selected banks in Rural Odisha)-  published in International Journal of Research in Computer Application & Management , Vol.No.1(2011), Issue No.3 (May), PP- 82-84 (ISSN- 2231-1009)\nPatnaik.B.C.M, &  Pradhan P.K – “ Students’ rating on Training Methods and Techniques : A Survey ( With special reference to selected private Engineering colleges in Bhubaneswar, Odisha– published in Indian Journal of Youth Affairs, Viswa Yuvak Kendara, New Delhi, Vol.15, No. 1, January-June 2011, pp-9-16 ( ISSN- 0970-4337)\nPatnaik.B.C.M,&  Satpathy  Ipseeta–Help at Hand: A Survey ( With special reference to Emotional Intelligence related to customer dealing of selected co-operative banks in Odisha)– Published in ECONSPEAK- A Journal of Advances in Management, IT & Social Sciences, Vol.1, issue1 (May 2011), pp-67-84 ( ISSN- 2231-4571)\nPatnaik.B.C.M,  Singh D.K &  Pradhan P.K: Self help is the best help: An Empirical Report ( With special reference to microfinance initiatives through SHGs in KBK districts of Odisha):-Published in IME Journal, Vol. V, No.1,January 2011, pp-7-18\nPatnaik.B.C.M,  Singh D.K &  Pradhan P.K:–” Behavior Influence on Detergent power in Rural Market by different age groups-Published in  ELK Journal of Marketing and Retail Management, Vol.2, Number 1, April 2011,pp-326-332( ISSN-0976-7193)\nPatnaik.B.C.M, Satpathy Ipseeta & Das C..K–Employees Empowerment through Training System in Banking Sector: An Empirical Analysis (With special reference to selected banks in Rural, Semi-urban and Urban Odisha)- Published in  IJMMR, Vol.2, Issue 6, June 2011, pp-88-102 ( ISSN- 2229-6883)\nPatnaik.B.C.M,  Satpathy  Ipseeta &  Pradhan P.K–Review of Literature on Indian Banks:Published in Research Journal of Arts, Management and Social Sciences for March 2011 issue,Vol.IV, Year-02, pp-96-107 (ISSN- 0975-4083)\nPatnaik.B.C.M &Singh D.K: Review of Literature on Indian Aluminum Industry:Published  in Research Journal of Arts, Management and Social Sciences for March 2011 issue, Vol.IV,Year-02, pp-1-13 ( ISSN- 0975-4083)\nPatnaik.B.C.M,  Satpathy  Ipseeta &  Das C.K–“NPA Management in Indian Banking Organisation: A look at the system and the mechanism”.- Published in  Research Journal of Arts, Management & Social Sciences  published in March 2011 issue, Vol.IV, Year-02, pp-61-70 (ISSN- 0975-4083)\nPatnaik.B.C.M,  Satpathy  Ipseeta &  Pradhan P.K – A Study to assess the Emotional Intelligence and Performance of managers in Co-operative and Gramya Banks in Orissa-Published in Asian Journal of Management Research Special issue No.1,2011,June 2011, pp. 10-20 ( ISSN-2229-3795)\nPatnaik.B.C.M,  Das Srikant &  Pradhan P.K – Corporate Environmental Social Responsibility (CESR): ( A case study of selected Private Sector Corporate Units in Odisha– Published in Environment Protection, Centre for Research Studies First Edition-February 2011,pp-256-262 ( ISBN-978-81-87364-44-3)\nPatnaik.B.C.M, &  Pradhan P.K – Global Environmental Issues ,Challenges and Strategies to achieve Sustainable Development: An Overview-Published in Environment Protection, Centre for Research Studies, First Edition-February 2011,pp-18-27 ( ISBN- 978-81-87364-44-3)\nPatnaik.B.C.M,  Satpathy  Ipseeta &  Panigrahi B – A comparative analysis of students perception (Boys) on training method and techniques: A survey(With special reference to selected B-schools, PECs & ITIs in Bhubaneswar,Odisha)– Published in International Journal of Economic Research ( IJER) on line , May- June 2011 issue, 2(3), pp-7-12 ( ISSN- 2229-6158)\n. Patnaik.B.C.M, Satpathy Ipseeta & Mohapatro A.K–NPAs Side effect and its’ Curative Mantra– Published in International Journal of Research, Commerce  and Management, Vol. No 2 (2011), Issue No-7 (July) , pp-77-80 (ISSN-0976-2183)\nPatnaik.B.C.M,  Satpathy  Ipseeta &  Mohapatro A.K- An Empirical Analysis on Bad Loans in Personal Loan( With special reference to Rural Banks in Odisha)-Published in International Journal of Research in Commerce, Economics and Management, Vol. No.1, (2011), Issue 3 ( July), pp-69-79 ( ISSN- 2231-4245)\n. Patnaik.B.C.M, Satpathy Ipseeta & Singh D.K–Employee’s perception toward environmental challenges: An empirical study on Vedanta Ltd-Published in International Journal of Research in Commerce, IT and Management, Vol. No1 (2011), Issue No2 ( July), pp- 79-83 ( ISSN- 2231-5756)\nPatnaik.B.C.M,  Satpathy  Ipseeta &  Mohapatra A.K – Demystifying NPAs on Education Loan: A Survey ( With special reference to urban, rural and bank officials of Odisha)-Published  in Journal of Banking and Financial Services and Insurance Research in Vol.1,Issue 4 (July 2011), pp-16-31 ( ISSN- 2231-4288)\nPatnaik.B.C.M,  Satpathy  Ipseeta &  Mohapatro A.K -An Empirical analysis on Bad loans in Agriculture loan ( With special reference to co-operative banks in Odisha)- Published in   International Journal of Research in Finance & Management (IJRFM), Volume1, Issue 3 (July 2011), pp-127-162. ( ISSN-2231-5985)\nPatnaik B.C.M,Satpathy I & Prabir Ku. Pradhan- Empowerment of Rural Odisha through Connectivity ( A case study of Khurda District of Odisha)-Published in International Journal of Research in Computer Application and Management, Vol.No.1 (2011), Issue No.6 (August), pp-103-106 ( ISSN- 2231-1009)\nPatnaik.B.C.M,  Singh Jeet &  Pradhan P.K– “An Introspective on impact of New Direct Tax Code (DTC) Bill 2010 on Middle and Lower Income group”-Published in The Management Scientist- Vol-10, No-2, Apr-June 2011, pp-1-12 (ISSN-0976-2353)\nPatnaik.B.C.M,  Satpathy  Ipseeta &  Mohapatro A.K-Demystifying NPAs on Education loan: An empirical analysis (With special reference to selected urban, semi-urban and rural areas of Odisha)-Published in International Journal of Management and Transformation(IJMT), Vol.5, Number1: Spring 2011, pp-44-54 (ISSN-0974-3502)\nPatnaik.B.C.M,  Satpathy  Ipseeta &  Pradhan P.K–“ Decoding the NPAs in Personal Loan: A Survey ( An Empirical Analysis of Rushikulya Gramya Bank in Odisha)-Published in Res Manageria, Vol.2, Issue 3, May-June 2011, pp- 17-25 ( ISSN- 2230-9462)\nPatnaik.B.C.M, Satpathy Ipseeta & Singh D.K – A Comparative Analysis of employees perception towards “ Happy employees are productive employees: A survey”( With special reference to Vedanta Ltd & Nalco Ltd),Published  in Research Journal of Social and Life Sciences, for June 2011 issue, Vol-X, Year-5, pp-163-173 ( ISSN-0973-3914)\nPatnaik.B.C.M,  Satpathy  Ipseeta &  Panigrahi B – Students perception on Training Methods and Techniques: A Study”( With special reference to selected ITIs in Bhubaneswar, Odisha),  Published  in Research Journal of Social and Life Sciences, for June 2011 issue, Vol-X, Year-05,, pp-439-447 ( ISSN-0973-3914)\nPatnaik.B.C.M, Satpathy Ipseeta & Das C.K–Employees Empowerment through Training System in Banking Sector: An Empirical Analysis (With special reference to selected banks in Rural, Semi-urban areas in Odisha)-Published in Res Manageria on line journal, Oct 2011, Vol.2, Issue-4, pg- 1-10 (ISSN-2230-9462)\nPatnaik.B.C.M, Satpathy Ipseeta- Innovation: The survival Mantra for Gramya Banks ( An Empirical analysis of innovative initiatives taken by the Gramya Banks in Odisha),Published in ACADIMICIA, Vol.1, Issue.1, (Oct 2011), pp-1-26 (ISSN- 2249-7137)\nPatnaik.B.C.M, Satpathy Ipseeta- A survey on women consumer behavior towards fast moving consumer goods ( with special reference to demography),Published in South Asian Journal of Marketing and Management Research, Vol.1, Issue.1, (Oct 2011), pp-1-18(ISSN-2249-877X)\nPatnaik. B.C.M, Satpathy Ipseeta & Dev Padma- Role of Employees State Insurance (ESI) in the district of Cuttack- A survey-Published in International Journal of Research in IT & Management (IJRIM), Vol 1, Issue 7 ( November,2011), (ISSN 2231-4334)\nPatnaik B.C.M &Satpathy I–Know Your Women Entrepreneurs (KYWE): A Survey  (With special reference to education and occupation of women entrepreneurs of Odisha)-published in South Asian Journal of Marketing and Management Research, Vol 1, Issue 2 (November 2011) ,pp-30-47, (ISSN 2249-877X)\nPatnaik B.C.M &Pradhan P.K-An Empirical Research on Corporate Environmental Social Responsibility (CESR), with special reference to employees of selected PSUs in Odisha.Published in Kushagra International Management Review, Vol. 1, No.1, December 2011, pp-12-16, (ISSN- 2250-0960)\nPatnaik. B.C.M ,Satpathy I & Padma Dev – A Comparative Analysis of Health Care Services provided by the Leading Hospitals ( With special reference to KIMS and Capital Hospital of Bhubaneswar, Odisha),– Published in  Indian Journal of Applied Research ( IJAR), Vol-1, Issue-3,   December 2011 , pp-121-123, ( ISSN- 2249-555X),—Impact factor- 0.8215\nPatnaik B.C.M& Satpathy I- Corporate Giving: A sustainable practice perspective– Published in Radix International Journal of Economics & Business Management (RIJEB), Vol.1, Issue-1(December 2011), pp-49-68\nPatnaik B.C.M,Satpathy I & Pradhan P.K- Demystifying NPAs on Agricultural Loan- (With special reference to Rushikulya Gramya Bank in Odisha)- Published in Aatmbodh- The Journal of Rajarshi School of Management & Technology, Vol.VIII, No.1, Spring 2011,PP-16-19 ( ISSN- 0972-1398)\nPatnaik.B.C.M, & Satpathy Ipseeta– Portfolio of NPA- By Classification of Banks:Published in BVIMR Management Edge, Vol.5, No.1, January-June 2012, (ISSN No.0976-0431), RNI No: DELENG/2007/25437\nPatnaik, B.C.M,Satpathy I & Dev Padma – Perception of the staff towards Employees State Insurance Hospitals:  An Empirical Study,Published in ACADEMECIA, Vol.2, Issue-3, March 2012, pp-64-83 (ISSN-2249-7137)\nPatnaik B.C.M,Satpathy I & Panigrahi B–Work life balance among support staff working in educational institutions: An inside story-Published in Journal of Social and Life Science, Vol.XI, Year -06, PP-405-413, December 2011 ( ISSN-0973-3914)\nPatnaik B.C.M, Satpathy I & Mohapatro A- Financial Inclusion- Review of Literature-Published in Journal of Social and Life Science, Vol.XI, Year -06, PP-42-51 , December 2011 ( ISSN-0973-3914)\nPatnaik B.C.M., Satpathy I & Prabir K. Pradhan-An encounter with migrants on the line of push-pull theory-Published in Zenith International Journal of Business Economics & Management Research, Vol.02, Issue -03( March 2012), pp-1-12, (ISSN -2249-8826)Impact Factor=0.503\nPatnaik B.C.M, Satpathy I- Empowering Excluded through Information Technology: An Empirical Report, Published in South Asian Journal of Marketing Research, Vol.2, Issue 3 (March 2012), pp-142-153, (ISSN-2249-877X)\nPatnaik B.C.M &Satpathy I- Mid – Career Derailment- an empirical study, Published      in Parikalpana- KIIT Journal of Management, Vol.7, (2010-11), pp-88-98, ISSN-0974-2808.\nPatnaik B.C.M & Pradhan P.K-Micro Finance as tool for poverty reduction–   Published in International Journal of Contemporary Management and Research Application, Vol.1 ,pp-275-280,  March -2012, ISSN- 2249-3514\nPatnaik B.C.M ,Satpathy I & Goyal S- Versatility Internal Transfers (VIT) are tool for Productivity and Retention: An Inside Story ( With special reference to selected banking organization in Bhubaneswar, Odisha)-Published in Asian Journal of Multidimensional Research- Vol.1, Issue 1, May 2012, pp-1-10\nPatnaik B.C.M ,Satpathy I & Patnaik N- Decoding NPA in Working Capital Loan: A Survey ( With special reference to Urban Co-operative banking organizations in selected districts of Odisha)-Published in International Journal of Research in Finance & Marketing, Vol.- 2, Issue 5 ( May 2012), pp-35-48, ISSN-2231-5985.\nPatnaik B.C.M& Das S.C- Corporate Social Responsibility in IT Industry – An Overview, Published in Academicia ,Vol-2, Issue-6, June 2012 ,pp- 142-168, ISSN-2249-7137\nPatnaik B.C.M,Satpathy I & Singh Deo Padma- Review of Literature on Social Security Scheme, Published in Research Journal of Arts, Management & Social Sciences to published in March 2012 issue, Vol. VI,pp-11-20 (ISSN- 0975-4083)\nPatnaik B.C.M,Satpathy I & Pradhan Prabir- Review of literature related to Rural Connectivity, Published in   Research Journal of Arts, Management & Social Sciences to published in March 2012 issue, Vol.VI, pp- 162-175 (ISSN- 0975-4083)\nPatnaik B.C.M,Satpathy I, Mohapatro A.K & Supkar A- Connecting Rural Odisha through Financial Inclusion: A Comparative Study, Published in SAJMMR, Vol.2 (Issue-6), June 2012, pp- 191-214 ( ISSN- 2249-877X)\nPatnaik B.C.M,Satpathy I, Patnaik N & Mohapatro A.K- Including the Excluded through Financial Inclusion– Published in International Journal of Physical and Social Sciences, Vol.2, (Issue-7), July 2012, pp-214-235 (ISSN-2249-5894)\nPatnaik B.C.M &Singh Sukhjinder-Student’s feedback towards training Techniques-An Empirical Study-Published in Radix International Journal of Economics and Business Management,Vol.1, issue 8(August 2012),pp-  ISSN-2277-1018\nPatnaik B.C.M& Satpathy I- Effective Group work is the key for the success, growth and survival of Self Help Groups: An Empirical view– Published in Management Insight, Vol.VIII, No.1: June 2012, pp-30-40,( ISSN-0973-936X)\nPatnaik B.C.M,  Mishra S.K & Racheyeta P- Corporate Governance in India: A survey of Literature,Published in Research Journal of Social and Life Sciences, Vol.12-I, Year-06, June-12, pp-88-103, ISSN- 0973-3914.\nPatnaik B.C.M&Sahoo Pradeep K–An empirical study on consumer behavior towards Cadbury’s India Ltd and Nestle India Ltd. ( A case study of male and female of Cuttack and Bhubaneswar of Odisha)– Published in Trans Asian Journal of Marketing and Management Research, Vol.1, Issue-1, September 2012, pp- 1-11, ISSN- 2279-0667.\nPatnaik B.C.M& Padhi Prabir Chandra- Compensation Management: A theoretical preview– Published in Trans Asian Journal of Marketing and Management Research, Vol.1, Issue-1, September 2012, pp- 39-48, ISSN- 2279-0667.\nPatnaik B.C.M& Satpathy I- Trainer’s Perception towards Training- The other side of the coin, Published  in SIMER Pragati-  Sivalik Institute of Management Education and Research, Vol.IV, Issue-1, July-Sept-2011, PP-4-18,ISSN-0974-2018\nPatnaik B.C.M &Behura Samir–Diversification of the world in the recent organizational changes: A Literature Review– Published in Asian Journal of Multidimensional Research (AJMR), Vol.1, Issue-4, Sept-2012, pp-121-126, ISSN-2278-4853\nPatnaik B.C.M& Swain R.N–Financial structure of Indian Companies– Published in Trans Asian Journal of Marketing and Management research, Volume-1, issue-2,pp-39-44, October 2012, ISSN-2279-0667\nPatnaik BCM &Satpathy I- JUGAADU-The Smart and Cost effective innovate Managers– Published in Journal of Business Management and Social Science , October 2012, Vol.1, Issue-1, pp-19-23, ISSN-2319-5614\nPatnaik BCM &Sahoo Pradeep Kumar–An Empirical Analysis on Consumer behavior of lower income ( A study of FMCGs in Khordha District)- Published in International Journal of Contemporary Management and Research Application, Dec-2012, Vol.IV, Issue- Year-02, pp-7-13, ISSN- 2249-3514\nPatnaik B.C.M&Satpathy I–Coterie–A small group with capability of influencing top management decisions: An empirical study– Published in Trans Asian Journal of Marketing & Management Research, Vol-2, Issue-2, Feb-2013, ISSN-2279-0667, PP-54-72\nPatnaik B.C.M. &Satpathy I–The Other side of Artificial Sympathy: An Introspection-Published in Adhyayan- The Journal of Management Sciences, Lucknow, Vol-2, No.2, ISSN- 2249-1066,pp-86-95, December -2012\nPatnaik B.C.M. &Satpathy I–Behavior pattern of higher income group consumers towards complementary goods ( With special reference to Cuttack District of Odisha)-Published in International Journal of Marketing and Management Research , Vol-4, Issue-2, Feb-2013, ISSN-2229-6883, pp-25-33\nPatnaik B.C.M& Swain R.N-Financial Structure Analysis of Indian Companies: A Review of literature– Published in Asia Pacific Journal of Research in Business Management, Vol.4, Issue-1-2, Jan-Feb 2013, ISSN- 2229-4104, pp\nPatnaik B.C.M& Satpathy I, -Reverse Migration: An Empirical Report-published in Shimla Management Journal,Vol- V, No- 1,Dec 2012 ISSN -2320-0154 ,PP 90-104\nPatnaik B.C.M & Satpathy I   -Image Managent &Soft Skills:New Mantra of Experiencing Success,published in JIS Management  Vista, VOL VII ,No-1 Jan-June 2013 ISSN;0974-0872, PP 18-28.\nPatnaik B.C.M. ,Satpathy I& Pradhan P-Odisha Gramin Bank (OGB): A Game Changer for Rural Banking Scenario in Odisha– Published in –Management Gospel– Vol.I, Year-II, March-2013, ISSN- 2277-1514. Pp-54-60\nPatnaik BCM ,Satpathy I & Goel S-Challenges of implementing E-Choupal in Odisha- Published inInternational Journal of Management Research and Review, Vol.3, Issue-4, year 2013, ISSN-2249-7196, pp-2826-2384\nPatnaik B.C.M & Satpathy I  –The Non-visual side of Invisible employee: A study- Published inAsian Journal of Multidimensional research, year 2013, Vol.2, Isssue-6, ISSN-2278-4853, pp-107-116\nPatnaik B.C.M & Satpathy I  – Selfish- A judgment readily passed by those who never tested their own power of sacrifice- A study. Published inGryanpratha- Accman Journal ofManagement, June-2013, Vol.-5, Issue-2, ISSN-0975-584,pp-60-75\nFrom July 2013 onwards\nPatnaik B.C.M, Satpathy I & Supkar A– Mainstreaming the Financially Excluded (With special reference to the Varanasi district of Uttar Pradesh) – Publishedin Indian Journal of Applied Research (IJAR),Vol:3, Issue-12,Dece2013, ISSN-2249-555X, pp-338-344—Impact factor- 0.8215\nPatnaik B.C.M Satpathy I & Gupta A  – Introspection into Priorities before Changing the Job- A survey-Published in International Journal of Academic Research in Progressive Education and Development, Oct-2013, Vol.2, No.4, ISSN-2226-6348,pp-246-262.\nPatnaik B.C.M&Satpathy I– Micro-Manager and its impact on organizational growth- An empirical study, published in Asian Journal of Research in Business Economics and Management (AJRBEM), Vol.4, Issue-1, January (2014), ISSN-2249-7307,Impact factor -0.376, pp-165-178\nPatnaik B.C.M ,Satpathy I & Jena S-“A Comparative Study on Work-Life Balance of Nursing Staff Working in Private and Government Hospitals”, Published  in International Journal of Innovative Research in Science, Engineering and Technology (IJIRSET). Vol-3, Issue-1, January 2014, ISSN- 2319-8753, pp-8254-8261,Impact Factor-1.672,\nPatnaik B.C.M, Satpathy I,  & Jena S-Portfolio of Health Care Service Organizations, Published  in Trans Asian Journal of Marketing  and Management Research (TAJMMR) for Vol.3, issue-1, January 2014., ISSN-2279-0667,pp-22-31\nPatnaik B.C.M, Satpathy I, Mandal Anirban-Determinants of Migration- A review of Literature- Published  in Online International Interdisciplinary Research Journal (OIIRJ), Vol.IV,  January 2014 special  issue, ISSN- 2249-9598. Pp- 349-357 ,Impact Factor- 2.089\nPatnaik B.C.M,Satpathy I & Bonita Mitra–Stress Management Modalities  in IT Sector- published  in International Journal of Management (IJM) for January 2014  issue, Vol.5, Issue-1, ISSN-0976-6510, pp- 71-79,Impact factor- 6.9071\nPatnaik B.C. M,Satpathy I  & Mitu Agarwal- Work-life balance of Working Couples in Organized and Un-organized Sectors- Published in International Journal of Innovative Research & Development, for January 2014 issue,  Vol.3,Issue-1, ISSN- 2278-0211, pp- 234-239, Impact factor- IC value-6.19,\nPatnaik B.C.M,Satpathy I & Bonita Mitra–Review of Literature- Stress Management in IT Sector, published in Indian Journal of Applied Research , (IJAR) for February 2014  Issue,Vol.4, Issue-2,ISSN-2249-555X,, pp-7-9Impact factor- 0.8215\nPatnaik B.C. M,Satpathy I  & Das Pradeep Kumar – Mainstreaming the Marginalized through Micro-finance- A literature review- published  in International Journal of Management (IJM), Vol.5, Issue-2, February 2014,pp-10-15, ISSN-0976-6510,Impact factor- 6.9071\nPatnaik B.C. M,Satpathy I  & Chandrabhanu Das- Effectiveness of Outsourcing of Internal Audit and Financial Reporting by the Corporate- Published in  International Journal of Advanced Research in Management ( IJARM) for January-February 2014 issue, Vol-5, Issue-1, ISSN- 0976-6332,pp-53-58,Impact factor- 4.7271\nPatnaik B.C.M,Satpathy I, Mandal Anirban–The Internal Dynamics of Migration, Published in International Journal of Marketing and Human Resource Management ( IJMHRM) for January-February 2014 issue, Vol. 5, Issue-1, ISSN-0976-643X,pp-22-32,Impact Factor- 4.6901\nPatnaik B.C. M,Satpathy I  & Chandrabhanu Das- Creative Accounting @ Window Dressing- An empirical analysis- Published in International Journal of Management, Vol.5, Issue-2, Feb-2014, ISSN-0976-6510, pp-61-68,Impact factor- 6.9071\nPatnaik B.C. M,Satpathy I  & Mitu Agarwal–Work life Balance@ Working Couple- A review of Literature-published in Asian Journal of Research in Social Sciences and Humanities, Vol.4, Issue-3 (March 2014), ISSN-2249-7315,Impact factor- 0.315\nPatnaik B.C.M ,Satpathy I, & Jena S- Work Life Balance of Nursing Staff- A Literature Review- Published  in Research Journal of Social Sciences December 2013, ISSN- 0973-3914.pp-83-90,Vol.XV-II\nPatnaik B.C.M,Satpathy I & Supkar A–Mainstreaming Financially Excluded: A Review of Literature- Published  in Research Journal of Social Sciences, December 2013,ISSN- 0973-3914.,pp-186-195,Vol.XV-II\nPatnaik B.C.M,Satpathy I & Mohanty A K- Service Quality Provided by Indian Banks- A Review of Literature, Published  in Research Journal of Social Sciences,  December 2013, ISSN- 0973-3914.,153-160, Vol.XV-II\nPatnaik B.C.M& Satpathy I- An interface between Vedanta and Management-an Empirical Analysis, Published in PURUSARTHA, Sept 2013-February 2014, ISSN-0975-024X, pp-68-75, Vol.VI, No-2, SCOPUS INDEXED.\nPatnaik B.C,M & Pradhan P– An Analysis on Role of Education in the Socio Economic Origin of an Entrepreneur, Published in The Alternative, October 13-March 2014, ISSN-0973-0451, Vol.XIII,No.1, pp-83-91\nFrom July 2014 onwards\nPatnaik B.C.M,Satpathy I, Mandal Anirban- Working and Living Conditions of Labour in Jhuggi Jhopadi (Slum), published in International Journal of Management, July 2014, ISSN-0976-6502, Vol.5, Issue-7, pp-62-72, Impact Factor-7.223\nPatnaik B.C.M,Satpathy I & Mitu Agarwal- An introspection in to awareness of maternity benefit Act 1961 in semi-urban area, published in International Journal of Management, September 2014, Vol-5, Issue-9, pp-13-17,Impact factor- 7.223.\nPatnaik B.C.M, Satpathy I and Das S- Dynamics of performance of Regional Rural Banks- a literature review- published in SAARJ Journal of Banking and Insurance Research (SJBIR), September 2014, Vol.2,Issue-5, ISSN-2319-1422, Impact factor-2.380\nPatnaik B.C.M, Satpathy I & Das P.K-Transformation from Class Banking to Mass Banking through Inclusive Finance: A Paradigm Shift, published in Asian Social Science, for Vol.10,No-19, October 2014, pp-11-16 ( Scopus Indexed) ,\nPatnaik B.C.M, Satpathy I & Kara A –  The Intellectual capital on the pharmaceutical sector- a review of literature- published in SAJMMR for October 2014 issue, vol-4, issue-10, pp-47-54, SJIF-4.748\nPatnaik B.C.M, Satpathy I & Anamika.S- Outbound Training and its effects on employee performance- A review of literature- published in International Journal of Management & Social Science (IJMSS), Vol.2, issue-11, ISSN-2321-1784, November 2014, impact factor-3.259\nPatnaik B.C.M, Satpathy I & Gupta A & Patel N- “Health Care Infrastructure Amenities- An Empirical Examination of Indian Perspective”- Published  in Journal of Technology Management in China, Vol.9, Issue-3, pp-245-262 in December 2014 – enlisted in Emerald\nPatnaik B.C.M,Satpathy I & Supkar A- Revamping Regional Rural Bank through Odisha Gramin Bank- a study, published in   International Journal of Economic Policy in Emerging Economics, Vol.7, issue no. 4/2014, ISSN- 1752-0460, pp- 327-334, Enlisted in Scopus (Elsevier)\nPatnaik B.C.M,Satpathy I& Mandal Anirban- Employment Related Skill Development and its Positive Impact in the Place of Origin – An Empirical Study to Understand Migrant and Non Migrant’s Perception- published in International Journal of Applied Research, Vol-5, issue-1, January 2015, ISSN-2249-555X, pp-249-297\nPatnaik B.C.M,Satpathy I, Mandal Anirban- Circular Migration and Human Mobility- An Observation, published in Mediterranean Journal of Social Sciences, for the volume 6, No-1S1 (2015),January  2015, ISSN-2039-2117, pp-133-137 ( Scopus indexed)\nPatnaik B.C.M, Satpathy I, Mohanty J, &Mandal A- Determinants of Migration from Rural to Urban India by the labourer- An overview, published in Journal of Business Management & Social Science, Vol.4 , issue 1, January 2015 issue, ISSN- 2319-5614, pp-33-38, impact factor-3.828\nPatnaik B.C.M,Satpathy I, Tripathy S, &Mandal Anirban- Labour migration and its effect on urban area- an overview, published in International Journal of Physical and Social Sciences (IJPSS), Vol.No-5, Issue-2, ISSN-2249-5894, pp-178-185\nPatnaik B.C.M, Satpathy I & Das Sulagna- Portfolio of Gramin Banks in West Bengal- published in SAARJ Journal on Banking and Insurance Research ( SJBIR), in Vol.4, Issue-1, January 2015, ISSN-2319-1422, Impact Factor- SJIF-2.380, pp-66-80\nPatnaik B.C.M, Satpathy I, & Supkar A- Pradhan Mantri Jan Dhan Yojna (PMJDY)- A New Direction for Mainstreaming the Financially excluded, published in International Journal of Management (IJM), Vol-6, issue-02, February 2015, pp-31-42. Impact Factor- 7.972,\nPatnaik B.C.M, Satpathy I & Das P.K- Banishing Financial untouchability of the poor through Prime Minsiter’s Jan-Dhan Yojana (PMJDY)- A tryst with New Destiny, published   in Mediterranean Journal of Social Sciences, Vol.6, No-2 March 2015 issue, ISSN-2039-2117, pp  , indexed in Scopus.\nPatnaik B.C.M, Swain R.N & Das Srikant– Impact Analysis of KIIT and KISS, published in International Journal in Management and Social Sciences, Vol.3, issue-3 (March 2015), ISSN-2321-1784,pp- 665-672, Impact Factor-3.84\nPatnaik B.C.M,Satpathy I, & Anirban Mandal- Gender wise Return Migration Decision and Migrants Perception towards Developmental Impact in place of origin- An Empirical Study, published in Review of European Studies, Volume-7, No-7,for June 2015 issue, ISSN-1918-7173 pp-158-163, SCOPUS indexed.\nPatnaik B.C.M, Satpathy I- Decoding Psychological Abuse @Innocent Minds- Published  in Trans Asian  Journal of Marketing and Management Research (TAJMMR) for May –June 2015 issue, Vol.4, Issue-5-6, Impact Factor- SJIF 2013- 4.289, pp-25-33, ISSN-2279-0667\nPatnaik B.C.M,Satpathy I, Gupta Atul–Challenges of Make in India Movement-published in Assam University Journal of Management, Vol.1, Issue-2, December 2014-February 2015, ISSN-2394-8345, pp-61-65\nFrom July 2015 onwards\nPatnaik B.C.M, Satpathy I and Das C- Srimad Bhagvad Gita guidelines for ethical wealth maximization- an empirical study on its impact on business stake holders – Published in  Purusartha- A journal of Management, Ethics and Spirituality- Vol-8, Issue-1, pp27-42- March 2015-August 2015Scopus indexed ISSN- 0975-024X\nPatnaik B.C.M, Satpathy I and Das C- The Dynamics of Disengagement to Departure- An experience, published in  for  Journal of Sustainable Development in Volume-8, No-6, August 2015 – pp- 127-132, Scopus Indexed , ISSN-1913-9071\nPatnaik B.C.M, Satpathy I and Das C- Challenges in Finance and Accounting Outsourcing of Indian Manufacturing Industry- An Overview, Published in Online International  Interdisciplinary Journal, Impact Factor-3.113, ISSN-2249-9528 , Vol-5, Issue-5, PP-142-146 ( Sept-Oct 2015)\nPatnaik B.C.M, Satpathy I and Das C- Skill Development Benefits through Finance and Accounting Outsourcing- An Overview, published in International Journal of Management and Social Sciences, Impact Factor-4.358, ISSN-2321-1784, Vol-3, Issue-8 August 2015, PP-184-194\nPatnaik B.C.M, Satpathy I and Rachayeeta P- Skill Development in MSME- An Observation, published in International Journal in Management and Social Science (IJMSS), Vol-3, Issue-12, December 2015, Impact factor- 4.358, ISSN-2321-1784, pp-413-419.\nPatnaik B.C.M, Satpathy I and Rachayeeta P- Micro, Small and Medium Enterprises (MSME)- An Indian Perspective, published in International Research Journal of Commerce and Law , Vol-2, Issue-12 (December 2015), ISSN-2349-705X, Impact factor- 2.917, pp-15-24\nPatnaik B.C.M, Satpathy I and Das C- Skill Gap Analysis for the Finance and Accounting Outsourcing in Manufacturing Sector in Odisha- A Review of Literature, published in Trans Asian Research Journal, ISSN-2279-0667, Vol-4, Issue-7-8, (July-August 2015), IF-4.289, PP-6-10\nPatnaik B.C.M & Das Sulagna- Microfinance in Eastern India: The Role played by Regional Rural Banks, Published in Indian Journal of Finance , Volume-9, Issue-11, November 2015, pp-45-59, ( SCOPUS) , ISSN-0973-8711\nPatnaik B.C.M, Satpathy I and Rachayeeta P- Skill Deficiency of Micro, Small & Medium Enterprises (MSME)- A Review of Literature- Published in International Journal of Research in IT & Management, ISSN-2231-4334, Vol-5, Issue-12 (December 2015), I.F- 4.961, pp- 46-55\nPatnaik B.C.M, Satpathy I and Rachayeeta P- Issues of Micro, Small and Medium Enterprises (MSME) in India, published in International Journal of Innovative Research and Development, Vol-5, Issue-6, May 2016, ISSN-2278-0211, pp-1-5, IF-6.19\nPatnaik B.C.M& Das Sulagna-Women’s Access to Rural Credit and Microfinance in West Bengal, Published in Indian Journal of Finance,  Vol.10, Issue-4, April 2016, pp-54-65(Scopus), ISSN-0973-8771\nPatnaik B.C.M,Satpathy I and Mohanty S- Decoding the other side of Psychological contract, published in International Journal of Research in Economics and Social Sciences (IJRESS), Vol.-6, Issue-5 (May 2016), ISSN-2249-7382,Impact factor- 6.225and PP-165-174\nPatnaik B.C.M,Satpathy I and Mohanty S- Dynamics of Deviant Workplace Behaviour- A Literature Review, Published in International Journal of Humanities and Social Studies, volume 4,Issue 5,May 2016,pp-01-04,ISSN- 2321:9203,Impact Factor:0.981\nPatnaik B.C.M,Satpathy I and Anamika – Outbound Training and its Influence on Behavioral Skills: An Overview, Published in International Journal Of Research in IT & Management, volume 6 issue 5,May 2016,pp- 115-124,Impact Factor:5.96\nPatnaik B.C.M,Das C  & Supkar A- Ethical selling standards as emerging skill gap in financial services- An empirical study of its effectiveness on sales personal in Odisha, published in SMS Journal of Entrepreneurship and Innovation, Vol-2, Issue-1 (December 2015),pp-76-86\nPatnaik B.C.M,Satpathy I & Pani Manas Ranjan- Major Initiatives for Including the Excluded- an observation , published in International Research Journal of Commerce and Law ( IJRCL), Vol-3, Issue-6, June 2016, ISSN-2349-705X, pp- 45-54, Impact factor- 3.767\nPatnaik B.C.M,Satpathy I & Pani Manas Ranjan- Financial Service providers in rural India- an overview, published in International Journal in Management and Social Sciences , Vol-4, Issue-5, May 2016, ISSN-2321-1784, pp-467-472, Impact factor- 5.276\nPatnaik B.C.M,Satpathy I & Pani Manas Ranjan- Transformation from class banking to mass banking- a review of literature published in International Journal of Research in Finance and Marketing ( IJRFM), Vol-6, Issue-7, July 2016 , ISSN-2231-5985, PP-64-72, Impact Factor- 5.861\nPublication from July 2016 onwards\nPatnaik B.C.M,Satpathy I and Mohanty Sourav – East Coast Railway Express- An Odyssey  , published in  International Journal of Economic Research, Vol. 13(3) 2016, PP-733-744, ISSN -0972-9380-. ( Scopus)\nPatnaik B.C.M,Satpathy I and Mohanty Sourav- Psychological Contract- A game changer for Organizational Success  in International Journal of Applied Business and Economic Research ,  Vol-14, No-6 (2016), ISSN- 0972-7302, PP-4595-4606 ( Scopus)\nPatnaik B.C.M,Satpathy I & Pani Manas Ranjan-Indian Banking Industry- An Overview,published in International Journal of Research in Economics and Social Sciences ( IJRESS) Vol.6, Issue-8, August 2016, ISSN-2249-7382, Impact factor-6.225, Thomson Reuters ID-5236-2015, pp-174-181\nPatnaik B.C.M,Satpathy I , CB Das & Sourav Mohanty- Carbon Credit Accounting- A study on finance students and professionals in Odisha, published in International Journal of Research in Finance and Marketing ( IJRFM) , Vol-6, Issue-9, September 2016, pp-35-46, ISSN-2231-5985, Impact factor- 5.861, Thomson Reuters ID- L-5236-2015.\nPatnaik B.C.M,Satpathy I and Mohanty Sourav- Workplace Romance- A challenge for Home Sapiens, published in  – Man in India for September 2016 issue , issue 96 (9) , pp-2957-2963 ( Scopus)\nPatnaik B.C.M,Satpathy I , CB Das & Sourav Mohanty- Carbon Credit Accounting – A Literature Review, published in South Asian Journal of Marketing & Management Research, Vol-6, Issue-10, October 2016, Impact factor 5.09, ISSN- 2249-7173\nPatnaik B.C.M,Satpathy I and Mohanty Sourav- Resurgence of Professional Rivalry in Organizations- An Empirical Perspective, Published in International Journal of Management and Social Science, Vol-04, Issue-10- October 2016, ISSN- 2321-1784, Impact Factor- 6.178, pp-275-290\nPatnaik B.C.M,Satpathy I and Mohanty Sourav- Management of Stress during Gestation Period- Published in International Journal of Research in Engineering and Applied Science ( IJREAS), Vol-6, Issue-10, Octorber 2016, PP-144-153, ISSN-2249-3905, IF-6.573, Thomson Reuter –ID-L-5236-2015.\nPatnaik B.C.M,Satpathy I , CB Das & Sourav Mohanty- Impact of Kyoto protocol on developing countries @ Carbon Credit Accounting, published in International Journal of IT and Engineering, Vol-4, issue-11, (Nov.2016) ISSN-2321-1776, pp-8-15, IF-6.341, publisher IJMR.\nPatnaik B.C.M,Satpathy I and Mohanty Sourav- Impact of Human Cloud on Organization and employees, published in IJABER,Vol.14, No.12 (2016) (Scopus)\nPatnaik B.C.M,Satpathy I and Mohanty Sourav- The Invisible side of Transforming Temple City to Smart City @ Bhubaneswar, published in International Journal of Management, IT & Engineering, Vol-7, Issue-1, January 2017, ISSN-2249-0558, pp-196-211, indexed in Thomson Reuter.\nPublication from July 2017 onwards\nPatnaik B.C.M,Satpathy I &  Nihar Ranjan Samal- Home Loan- An Overview – published in Journal of Advance Management Research , Vol-5,Issue-3, August 2017, ISSN-2393-9664, Page- 68-75, UGC Approved Journal ( Serial No 5757, Journal No-42888)\nPatnaik B.C.M,Satpathy I &  Anamika- Outbound Training and its effect on employees performance published in Journal of Advance Management Research , Vol-5,Issue-3, ISSN-23939664,August 2017, Page- 111-126, UGC Approved Journal. (Serial No 5757, Journal No-42888)\nPatnaik B.C.M,Satpathy I &  Nihar Ranjan Samal- Development of Indian Home loan Industry, published in Online International Interdisciplinary Research Journal, Volume-7, Special Issue-2, September 2017, page- 48-55, UGC Approved Journal ( Journal No-46,964) also Indexed in ICI.\nPatnaik B.C.M,Satpathy I & Nihar Ranjan Samal- Home loan Portfolio- A review of literature, published in International Journal of Current Advanced Research , Volume6, Issue-9, September 2017, pg.-5821-5823, UGC Approved journal No-43892.\nPatnaik B.C.M,Satpathy I & Sharad Kumar- Customer satisfaction on service qualities provided in different airports in India- A literature review, published in TRANS Asian Research Journal, ISSN-2279-0667, Vol-6, Issue-10, October 2017, IF-4.289, UGC approved journal, pp-10-18, UGC serial No-45,104\nPatnaik B.C.M,Satpathy I & Deepak Kumar Raut- Review of literature on effectiveness of inclusive training at work place, published in International Journal of Research in Economic and Social Sciences ( IJRESS), Vol-7, Issue-10, October 2017, ISSN-2249-7382, IF-6.939, PP-370-379, UGC approved journal no-48858\nPatnaik B.C.M,Satpathy I & Narayan Tripathy- Review of Literature on Working and living Conditions of workers in organized and unorganized sector, published in International Research Journal of Human Resources and Social Sciences (IJHRSS), Volume-4, Issue-9, September 2017, ISSN-2394-4218, Impact Factor-5.414, PP-463-473, UGC approved journal. Serial No-49,194\nPatnaik B.C.M, Satpathy I & Nihar Samal- Retail banking challenges and latest trends in India- published in International Journal of Economic Research, Vol-14, Issue-12, 2017, PP-403-413, Scopus Indexed .\nPatnaik B.C.M,Satpathy I, Srikanta Charana Das & Nitish Panch- Government Initiatives for rural banking- an overview, published in International Journal of Applied Business and Economic Research, Vol-15, Issue-15, 2017, PP-271-278, Scopus indexed.\nPatnaik B.C.M,Satpathy I & Anamika- Impact analysis on employees outbound training – published in Man in India, Vol-97, Issue-18, PP-61-70, November 2017 ( Scopus )\nPatnaik B.C.M,Satpathy I & Sharad Kumar- Indian Aviation Industry- An overview , published in International Journal of Academic Research and Development, Vol-2, Issue-6, Nov-2017, PP-802-805, UGC approved journal , ISSN-2455-4197, UGC serial no-48,808\nPatnaik B.C.M,Satpathy I & Sharad Kumar- Service Marketing and Service Quality- A conceptual framework, published in International Journal of Research in Management, Economics and Commerce ( IJRMEC), Vol-7, Issue-12, December 2017, PP-74-80, ISSN-2250-057X, IF-6.384, UGC approved.\nPatnaik B.C.M,Satpathy I, Nihar Samal- Satisfaction Management for Home Loan- A study on Indian Public –Sector Banks, published in BULMIM Journal of Management & Research, Volume3, No-1, January-June 2018, pp-11-16\nPatnaik B.C.M,Satpathy I,  Tripathy N-  Indian labour market and real estate sector : A conceptual framework published in International Journal of Civil Engineering and Technology, Vol- 9, Issue-5, May 2018, pp- 1023- 1030, ISSN- 0976- 6316,  ; Scopus\nPatnaik B.C.M,Satpathy I,  Tripathy N-   A study on workers in organised and unorganised sectors in automobile industry-  a review of literature, published in International Journal of Mechanical Engineering and Technology, Vol-9, Issue- 5, May 2018, pp- 481-487, ISSN- 0976- 6359, Scopus\nPatnaik B.C.M, Satpathy I, Samal Nihar Ranjan- Determinants of Infrastructure ( Home) loan in Indian Public sector banks in International Journal of Civil Engineering and Technology, Vol- 9, Issue-5, May 2018, pp- 1001-1009, ISSN- 0976- 6316; Scopus\nPatnaik B.C.M, Satpathy I, Singh Deepak Kumar- Technology- A game changer for digital transactions in India published in published in International Journal of Mechanical Engineering and Technology, Vol-9, Issue- 6, June 2018, pp-77-82 , ISSN- 0976- 6359, Scopus\nPatnaik B.C.M, Satpathy I, Palai Debjani- Intricacies of Multigenerational work force-  Review Study, in International Journal of Civil Engineering and Technology, Vol- 9, Issue-6, June  2018, pp- 1-8, ISSN- 0976- 6316; Scopus\nPatnaik B.C.M, Satpathy I, Saikat Chakraborty- Psychological Contract and its role in the infrastructure sector- A review study, published in International Journal of Civil Engineering and Technology (IJCIET), Vol-9, issue-7, July 2018, pp-844-852, ISSN-0976-6316, Scopus\nPatnaik B.C.M, Satpathy I & Snigdha Suhgin- ICT and Skill development of the work force – A review of literature ( with special reference to PMKVY)- published in IJCIET, August 2018, volume 9, Issue-8, pp-256-262\nPatnaik B.C.M, Satpathy I & Rout Deepak- Inclusive Training of Manufacturing Industry- A review, accepted for publication for Vol-9, Issue-9, September 2018 in IJMET\nPatnaik B.C.M, Satpathy I & Mohanty Abhay- Role of Information Technology in Alternative Channel Services, accepted for publication for Vol-9, Issue-9, September 2018 in IJMET\nPatnaik B.C.M, Satpathy I & Snigdha Suhgin -Role of ITeS in Pradhan Mantri Kaushal Vikash Yojana ( PMKVY)-A Conceptual Study published in Vol-9, Issue-9, September 2018 in IJMET\nPatnaik B.C.M, Satpathy I & Rout Deepak- Inclusive training at work place through Information Technology, published in IJCIET, Volume-9,Issue-12, December 2018, pp-7076\nPatnaik B.C.M, Satpathy I & Hayleslasietsegayaregawi- Determinants of Leverage and its impact on firm performance- Ethiopian Insurance  Industry- published in IJMET, Vol-9, issue-13, pp-890-905\nPatnaik B.C.M, Das Chandrabhanu-  Demystifying the Paradox of Dividend Policy : A case study on Indian Banking Sector-published in Emerging Economic Studies,Vol-4, Issue-2,  November 2018, pp-113-128\nPatnaik B.C.M, Satpahy I, and Manaya M.K- Determinants of Revenue Collection Efficiency and Administration : The case of local government authorities in Wolaita Zone, Ethopia- Published in IJEAT, August issue 2019, Volume-8, Issue-6, ISSN- 2249-8958,pp- 5249-5253\nPatnaik B.C.M, Satpathy I & Debnath N- Wisdom that Equality Tends to Offer: The case of Real earning management Practices of Female Directors in IT Friendly firms of Bangladesh, – Published in IJEAT, August issue 2019, Volume-8, Issue-6, ISSN- 2249-8958, PP- 328-334\nPatnaik B.C.M, Satpahy I, and Rath D- Augmented Reality (Ar)  & Virtual Reality (Vr)- A Channel for Digital Transformation in Industrialisation Fostering Innovation & Entrepreneurship- Published in   IJITEE, Vol-8, Issue-10, August 2019, ISSN-2278-3075, pp-3228-3226\nPatnaik B.C.M,Satpathy I & Palai D – Challenges related to Multi generational workforce in Manufacturing Sector- published in IJMET,Vol- 10, Issue-1, January 2019, ISSN- 0976-6340, pp- 719-724 ( Scopus)\nPatnaik B.C.M,Satpathy I & Das Mohapatra M-Work life Balance as a parameter of Job Satisfaction in the Manufacturing Sector- Published in IJMET, Vol-10,, Issue-2, February 2019,  ISSN- 0976-6340, pp- 97-104 ( Scopus)\nPatnaik B.C.M, Satpathy I & Debnath N- The effect of ERP system implementation on real earning management: Evidence from an Emerging Economy, published in IJCIET, Vol-10, issue-03, March 2019,, pp-588-603\nPatnaik B.C.M,Satpathy I & Rath. D- Challenges and motivational factors among womenprenuer in construction and architecture sectors- An empirical study, published in IJCIET, Vol-10, issue-4, pp-2267-2276.\nPatnaik B.C.M, Satpathy I & Manaye M.K- ADOPTION OF ELECTRONIC TAXING SYSTEM IN ETHIOPIA: REFLECTIONS OF BARRIERS AND DRIVERS- published in IJMET, Vol-10, Issue-4, pp-648-660\nPatnaik B.C.M, Satpathy I, & Mohanty A- Impact of Information Technology in Alternative Channel Services and its service quality, published in IJCIET, Vol-10, Issue-3, pp-1065-1072, March 2019.\nPatnaik B.C.M, Satpathy I, & Hayleslasie Tsegay Aregawi- IMPACT OF MICRO FINANCE INSTITUTIONS ON LIVELIHOOD OF BORROWERS POVERTY REDUCTION: EVIDENCE FROM TIGRAY, ETHIOPIA-  published in International Journal of Innovative Technology and Exploring Engineering(IJITEE) ISSN-2278-3075) Scopus\nPatnaik B.C.M, Satpathy I & Debnath N- Female Directorship and Real Earning Management in Bangla Desh: Towards an Analytical Assessment- Published in Management Science Letters (9) 2019, 1723-1740, Published in June 2019, Scopus\nPatnaik B.C.M, Satpathy I & Debnath N- By Appearance and/or by Amount- The impact of Presence and Size of Audit Committees on Real Earnings Management in Bangladesh, published in    International Journal of Innovative Technology and Exploring Engineering(IJITEE) ISSN-2278-3075) , Vol-8, Issue-8S3, June 2019, Scopus.\nPatnaik BCM,Satpathy I,Mohapatra M,Das S, Role of Information Technology in education and skill based learning for employability – published in International Journal of Innovative Technology and Exploring Engineering (IJITEE), Vol-9, issue-1, November 2019.\nPatnaik BCM, Satpathy I,- Mohapatra M, Das S, Patnaik BCM, Das S-Impact of information and Communication Technology (ICT) on employability – published in IJITEE, December 2019 , vol-9, issue-2\nPatnaik BCM,Satpathy I, and Rath D- Industry 4.0 – A New Futuristic Technological Revolution a Catalyst of Innovation & Entrepreneurship in Creation of Enterprises, published in IJITEE, 9(1), pp-4384-4390\nPatnaik BCM,Satpathy I and Chakravarty C- Psychological contract and attrition in Information Technology  sector published in IJITEE, 8(12),pp-3951-3956\nPatnaik BCM,Satpathy I, and Mohapatra M.D- Impact of Dimension of Organisational Citizenship Behavior on job satisfaction in Information Technology Sector, published in IJTEE, 8(12), pp-2503-2508\nPatnaik BCM,Satpathy I and Mishra D-Role conflict among women entrepreneurs in Information Technology Sector, published in IJITEE, 8(12),pp-2169-2174\nPatnaik BCM, Satpathy I, Mohapatra M. D, – Organizational Commitment and Job Satisfaction in IT sector – Published in IJITEE Volume 08, Issue-09 July 2019,\nPatnaik B C.M,Satpathy I, and Sodarshana . S- Impact of Age, Gender and Job Satisfaction on Employee engagement in IT Sector- published in IJITEE, Vol-9, Issue-2, December 2019.\nPatnaik BCM, Satpathy I and Mesle-  The effect of electronic taxing system in creating taxpayers insight about the equity and justice of tax system, Published in IJEAT, Vol-9, Issue-2, December 2019.\nPatnaik B.C.M,Satpathy I Mohapatra M.D and Das S.C- Value Creation through Knowledge Sharing and\nInnovation in IT Industry- published in IJITEE, Vol-9 Issue-3, January 2020 pp 1023-1027\nPatnaik B.C.M,Satpathy I,and Chakrabarti S- Psychological Contract: It’s Influence onAttrition in Manufacturing Sector- published in IJITEE, Vol-9 Issue-3, January 2020 pp 213-220\nPatnaik B.C.M,Satpathy I  & Rath. D- Women Entrepreneurs in Odisha- Challenges and Motivational Factors – Published in International Journal of Scientific and Technological Research – Volume-9, Issue-3, Page 829-832.\nPatnaik B.C.M,Satpathy I & Singh JJA- Digital Division across Generation in IT Sector- Published in Test Engineering and Management, Vol-83,ISSN-0193-4120, May –June2020, Page-17540-17545\nPatnaik B.C.M,Satpathy I & Akriti K- Retaining Employee in IT Sector during Covid 19 Pandemic- Published in Test Engineering and Management, Vol-83,ISSN-0193-4120, May –June2020, Page- 17636-17643\nPatnaik B.C.M,Satpathy I & Sudershana.S- Impact of Motivation and Job Satisfaction on Employee Engagement in the IT Industry- Published in Test Engineering and Management, Vol-83,ISSN-0193-4120, May –June2020, Page- 6744-6749\nPatnaik B.C.M,Satpathy I  & Samanta DPS- Analysis of Value and Volume of Real Time Gross Settlement & Card based Transactions in India – Published in Test Engineering and Management, Vol-83,ISSN-0193-4120, May –June2020, Page- 2090-2095\nPatnaik B.C.M,Satpathy I & Roy. A- A Comparative Study on Pre and Post Goods and Service Tax Scenario in MSME Sectors of West Bengal- Published in Test Engineering and Management, Vol-83,ISSN-0193-4120, May –June2020, Page- 7211-7220\nPatnaik B.C.M,Satpathy I & Roy. A- Goods and services Tax and impact on MSME and other sectors , published in Journal of Critical Review 2020; 7(10): 2643-2649.\nPatnaik B.C.M,Satpathy I & Deepti Mishra- Role conflict as an inhabitor for job satisfaction for female information technology (IT) employees, published inJCR.2020; 7(10): 2684-2688.\nPatnaik B.C.M,Satpathy I & Lakshmi Prasad Padhy- The Role of Knowledge Management in IT sector in India, published inJCR.2020; 7(11): 4366-4370.\nPatnaik B.C.M,Satpathy I ,Monalisa Mohapatra & Das Srikant- Exploring employability of management students through Information and Communication Technology, published inJCR.2020; 7(11): 4401-4409.\nPatnaik B.C.M,Satpathy I Mesele K Manaye & Singh D.K- Determinants of Tax evasion in Ethopia, published in JCR.2020; 7(11): 4391-4400.\nPatnaik B.C.M,Satpathy I, Deepti Mishra &Patnaik Atmika- Challenges faced by female employees of software industry during covid-19 pandemic,JCR.2020; 7(15): 4000-4006 published in\nParnaik, B.C.M, Satpathy I & A. Roy- Impact of Covid-19 crisis on Indian MSME sector: A study on remedial measures – published in Eurasian Chemical Communication in September 2020 – WoS Journal.\nParnaik, B.C.M, Satpathy I & A. Roy- Consolidate recommendation to change in GST pattern for managing the impact of Covid-19- A case of India- published in Eurasian Chemical Communication in September 2020 – WoS Journal.\nSatpathy I,Patnaik B.C.M & Nayak S- The convergence of IFRS and its impact on stock market performance of the jewelry industry –published in Euroasian Chemical Communications, Volume-3, Issue-1, page 6-13, 2021\nSatpathy I,Patnaik B.C.M & Nayak S- Reflection on Implementation of International Financial Reporting Standards (IFRS) in Indian Banking Industry published  in Universal Journal of Accounting and Finance , accepted for publication in volume-8 ,number-4.\nSatpathy I, Patnaik B.C.M, Mishra D, Patnaik A–Impact of Organizational Citizenship in Augmenting the Performance of Working Women : A Research Study in the IT Sector, published in volume-2, issue-12, December 2020, page-1188-1194\nSatpathy I, Patnaik B.C.M & Mohanty S- A study on Indian and Global Financial Markets during the Covid-19 pandemic, published in PENSEE International journal, volume-50, Issue-12-2020, serial no-58\nSatpathy I, Patnaik B.C.M & Singh A-Analysis of Digital Division among Gen X and Gen Y employees: A Tribal District Perspective, published in PENSEE International journal, volume-50, Issue-12-2020,\nSatpathy I, Patnaik B.C.M & Sahu Aditya – Impact of microeconomic variables on stock market- A study between India and America, published in European Journal of Molecular & Critical Medicine, Vol-7, Issue-11, 2020, page-4469-4486\nSatpathy I, Patnaik B.C.M & Mesle Kabade Manaye- Determinants of Tax Audit effectiveness: Empirical evidence from Wolaita Zone Tax Revenue Authority, published in PENSEE, Vol-51, Issue-2, 2021, ISSN-0031-4773, pp-377-392\nSatpathy I, Patnaik B.C.M & Padhi LP- Technology aspect of knowledge management in the Indian Banking sector-An exploratory study, published in PENSEE,Vol-50, Issue-12,2020 , pp-1077-1086, ISSN-0031-4773\nSatpathy I, Patnaik B.C.M & Mesle Kabade Manaye- Analysis of factors for failure to achieve full potentiality in tax administration and collection in Ethiopia- Empirical evidence from Wolaita zone revenue authority, published in Wutan Huatan Jishuan Jishu,Vol-XVI, Issue-12, December 2020, PP-1767-1781, ISSN-1001-1749"
        }
    },
    {
        "name": "Sudeshna Rath",
        "role": "Assistant Professor",
        "email": "Sudeshna.rath@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/sudeshna-rath/",
        "bio": "Dr. Sudeshna Rathis a dedicated academician and researcher in the field ofOperations Management. She earned herPh.D. from IIT Roorkee. With 2.5 years of teaching experience and an equal duration of industrial exposure, she brings a well-rounded perspective to her academic role. Sudeshna’s notable academic achievements include 4 years of research experience, where she has successfully published research papers in peer-reviewed journals indexed in Scopus. Additionally, she has actively contributed to the academic community by presenting her work at international conferences and serving as a reviewer for Scopus-indexed peer-reviewed journals. Her specialization encompasses a diverse array of areas, including Manufacturing Strategy, Production Operations Management, Multivariate Analysis, Service Operations Management, Supply Chain Management, and Quality Management, reflecting her wide-ranging expertise in management and operations.",
        "dynamic_sections": {
            "Research Publication": "Sudeshna Rath & Rajat Agrawal (2023) Prediction of novel operating parameters using Six Sigma: A study in the steel making process, Quality Management Journal, 30:3, 187 201, DOI:1080/10686967.2023.2211284\nSudeshna Rath & Rajat Agrawal (2023). Achieving Manufacturing Competitiveness Through Six Sigma: A Study on Steel Firms. InAdvances in Modelling and Optimization of Manufacturing and Industrial Systems(pp. 363-374). Singapore: Springer Nature Singapore.\nSudeshna Rath, P R Mallick, R K Das, Sushanta Tripathy (2018) Study of Service Quality of Hotel Industry in Bhubaneswar, Journal of Communication Engineering & Systems, 8:2, 15-19."
        }
    },
    {
        "name": "Shanta Sagar Mohapatra",
        "role": "Adjunct Asst. Professor",
        "email": "shanta.mohapatra@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/santa-sagar-mohapatra/",
        "bio": "Degree in accounting (Hon.) with Chartered Accountant from The Institute of Chartered Accountants of India. A highly skilled and experienced Chartered Accountant with 15+ years of work experience in financial management which includes accounting, budgeting, costing, variance analysis, reporting and auditing. For the past 15 years, he has worked for multiple companies in India including Big4s like PwC and KPMG as a Chartered Accountant and have much success and experience to offer from this position. He is fully capable in all aspects of the role and can handle internal and external auditing, systems design, basic accounting, and statuary audits. He is absolutely accurate, quick, and offer quality work in every part of his job. He holds a degree from north Orissa University in Accounting, and have taken several courses to accelerate his career expertise. He has great financial, math, and analytical skills and also, work well with people.",
        "dynamic_sections": {}
    },
    {
        "name": "Biswajeet Patnaik",
        "role": "Assistant Professor",
        "email": "biswajeet.patnaik@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/biswajeet-patnaik/",
        "bio": "",
        "dynamic_sections": {}
    },
    {
        "name": "Avinash Ashok Jawade",
        "role": "Assistant Professor",
        "email": "avinash.jawade@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/avinash-ashok-jawade/",
        "bio": "Having 10 years of industry experience in consumer goods and financial services sectors  with companies such  as Godrej & Boyce Mfg. Co. And IIFL Securities. Domain knowledge in the field of retail equity broking for equity and derivatives market .Subjects of interest : Financial Derivatives , Financial Risk Management , Fixed Income Securities and Debt Markets , Alternative investment Markets ,Corporate Finance Research areas  of Interest : Dividend Payout Policy , Options pricing Publications : 1)Paper titled “Do firm characteristics of concentrated ownership firms affect dividend payout beyond traditional motivations?” accepted for publication in Journal of Indian Business Research 2)Paper titled “Does Promoter Holding Affect Financed Payout of Dividends?” published(currently available online) in Borsa   Istanbul Reviewhttps://doi.org/10.1016/j.bir.2020.11.005 3)Paper titled “Debt financing and investment opportunities and dividend payout” presented at 3rdICDE and 14thISDSI Annual Conference 2020 held at IIM Raipur.",
        "dynamic_sections": {}
    },
    {
        "name": "Isa Mishra",
        "role": "Associate Professor",
        "email": "isa.mishra@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/dr-isa-mishra/",
        "bio": "She has 26 years of working experience including six years as Faculty-HR at IBAT and KSOM and over 18 years of experience in all gamuts of HR in varied sectors –Power, Telecom – both services & infrastructure & Port, both at corporate and site. This includes experience in Strategic and Operational HR & Administration in reputed companies like Orissa Hydro Power Corporation Ltd., a state Govt. PSU; AIRCEL; Adani Dhamra Port Company Ltd. and Tata Refractories Ltd. During these work stints, she has played a lead role while designing, revamping & implementing customized HR processes, assisting management in wage rationalization, merger & acquisition and being a change agent during transitions. Corporate experience includes 12 years in lead HR & Admin role. She has been conducting MDPs in the areas of communication and etiquette, emotional intelligence, labor laws and compliances, time management, stress management, diversity and inclusion, POSH, etc. for corporate houses and has worked in HR consulting in the following areas: Competency Mapping, Job Analysis and Evaluation, Performance Management, HR policies and processes. Her professional associations include being part of NHRDN, BBSR Chapter as Secretary from May, 2009 till March, 2014 & as Treasurer since April, 2014 till date. She has been Sub-Editor, NIPM, Utkal Chapter from Apr’00 till March’05. Since Dec’97, she has been conducting several personality development workshops & rendered classes at institutes including KSOM, IMIS, OEC, ASM, Silicon Engineering College, MSM for students prior to placement. Her academic credentials include MA in PMIR (gold medalist of 93-95) batch; M. Phil. in PMIR; LLB & Ph.D. She is a certified Thomas International’s PPA Practitioner since June, 2016",
        "dynamic_sections": {
            "Research Publication": "Das, Saptorshi; Mishra, Isa; “The role of nature in creating mystery and terror in the short stories of Ruskin Bond, with special reference to listen to the wind and the wind on haunted hill”; International Journal of English & Literature\nPadhi, Shradha; Mishra, Isa; “Impact of trust in building a high performing team, specifically in project based IT companies”; Journal of Emerging Technologies and Innovative Research\nSatpathy, Jyoti; Mishra, Isa; “Clinical Observations on Neuro Decision Capability”; European Journal of Business & Social Sciences\nDas, Saptorshi; Mishra, Isa; “Women and Marriage, in Diaspora, on both sides of the Border”; TEST Engineering and Management\nMultiple authors; Satpathy, Jyoti; Mishra, Isa; Padhi, Shradha; Das, Debi P.; “Noetic Alleyways: Choosing to Choose or Deciding to Decide”; Strad Research Journal\nSatpathy, Jyoti; Mishra, Isa; Padhi, Shradha; Das, Debi P.; “Insightful Entrepreneurial Behavior Deportment”; PalArch’s Journal of Archaeology of Egypt / Egyptology\nSatpathy, Jyoti; Mishra, Isa; Laza, Sebastian; Padhi, Shradha; Das, Debi P.; “Perceptive- Entrepreneurial Decision Comportment”; Journal of Social Sciences\nProf. Isa Mishra & Prof. Shradha Padha co-authored a Chapter on “Mental health and role of HR Managers”, for the book titled “Human Resource Management and Mental Health – A Psychosocial Aspect”, which was published on 25th June, 2021 by Lincoln Research and Publishing Limited, Australia – LRPL. Book has been edited byProf. Sasmita Samanta, Pro-VC, KIIT-DU; Dr. Biswabandita Kar, Dean, KIIT School of Applied Sciences and Dean, Research & Development Cell; Dr. Sandeep Poddar, Deputy Vice Chancellor (Research & Innovation), Lincoln University College, Malaysia; and Dr. Amiya Bhaumik, President, Lincoln University College.\nEnhancement in the education systems through effective management”; Turkish Online Journal of Qualitative Inquiry; Scopus; Volume 12, Issue 6, June 2021: 874-881\nPsychological Factors Affecting The Quality Of Online Learning”; Turkish Journal of Computer and Mathematics Education, Vol.12 No.10(2021), 812-817; Scopus Q4, ISSN: 1309-4653.",
            "Book Publication": "Prof. Isa Mishra & Prof. Shradha Padhi co-authored a book chapter titled Emotional Independence, published in Partridge Publications for the book titled “Self Management”; book released on 5th March, 2021; Published on Feb, 2021."
        }
    },
    {
        "name": "Suchi Smita Swain",
        "role": "Assistant Professor",
        "email": "suchi.swain@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/suchi-smita-swain/",
        "bio": "Prof. Suchi Smita Swainholds a B.A. (Hons) in Economics from BJB Autonomous College, Utkal University, and earned her M.A. in Analytical and Applied Economics from Utkal University. She was a full-time Ph.D scholar at the National Institute of Technology Silchar, Assam, and has extensive experience as a Teaching Assistant at NIT Silchar, teaching managerial economics to undergraduate students. Her research interests include migration and remittances, labor economics, development studies, and rural economics. She possesses strong technical skills in econometric analysis and is proficient in software tools such as STATA, R, and SPSS. She has published papers in reputable SCOPUS and Web of Science-indexed journals and presented at international conferences. Committed to interdisciplinary research and effective teaching, she aims to contribute to rural economic development and inclusive growth through her academic pursuits.",
        "dynamic_sections": {
            "Research Publication": "01. Swain, S. S., Paul, U. K., Kumar, S., & Das, G. (2024). Investigating the Role of Migration on Household Wellbeing: A Study in an Emerging Market. Global Business and Organizational Excellence, Wiley. [SCOPUS, Q1]. DOI: 10.1002/joe.22276.\n02. Swain, S. S., Das, G., & Paul, U. K. (2024). Does Flow of Remittances Matter for Enhancing Labor Market Behavior of Left-Behind Members? A Micro-Level Analysis in Rural Jharkhand, India. Journal of Public Affairs. [SCOPUS, Q1 and ESCI]. DOI: 10.1002/pa.70003.\n03. Swain, S. S., Das, G., & Paul, U. K. (Accepted). Internal Migration and Labor Market Behavior in Rural India: Do Left-Behind Members Prefer Work over Leisure? Millennial Asia. [SCOPUS, Q1 and ESCI].\n04.  Swain, S. S. (2024). Labor Migration from Rural Jharkhand: Analyzing Trends and Patterns. International Journal of Multidisciplinary Research, 2(6). ISSN: 2583-973X."
        }
    },
    {
        "name": "Abhishek Kumar",
        "role": "Associate Professor",
        "email": "abhishekkr5@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/abhishek-kumar/",
        "bio": "With over 7 years of industry experience he has served companies like Standard Charted Bank, ICICI Prudential and Tata AIG Life and has been in roles ranging from Manager to Branch Head. Prof. Kumar has got the highest award and acclamation during his tenure in said organisations. For example, Winner of “Superstar of the Company” in ICICI Prudential, recipient of “Hercules Award” in Tata AIG Life for the financial year 2008-2009. He was sent to Dubai for the best performance where he achieved No. 1 position PAN INDIA. Promoted as Branch Head in 2009 Prof. Kumar became the best Branch Head and received the most prestigious award “Hour of Power” thrice during his stint which depicts his dedication towards work. His area of research includes Marketing Management and Monetary Policy. More than a dozen research papers in regional and national seminars are to his credit. Prof. Kumar was awarded with ‘ Dr. Asha Sablok Memorial Gold Medal’ for the best conference research paper. He has authored books like “Central Loans to States and Finance Commission”,”Impact of Global Financial Crisis on Indian Economy”, “Micro Finance and Rural Development” and “Market Reforms and Inclusive Growth”. His edited book “Central Loans to States and Finance Commission” has been released by Dr. Montek Singh Ahuwalia, Deputy Chairman, Planning Commission of India in the 93rd Annual Conference of the Indian Economic Association.",
        "dynamic_sections": {
            "Book Publication": "Economic Growth in India, Shandilya Publications.\nThis book examines the problem of economic growth in India relating to global and domestic challenges, comprises scattered articles of eminent scholars of India related to economic growth in India and they have done much to enrich the subject matter of economic development.\nMarket Reforms & Inclusive Growth, Regal Publications\nIndian Banking System Conundrums and Opportunities, SHANDILYA PUBLICATIONS.\nThis book “Indian Banking System: Conundrums and Opportunities” gives an idea of revolution in the banking business. Being deviated from the old and archaic system of banking, a new trend has been developed by introducing information technology.",
            "Research Publication": "Pattnaik, A.K.; Misra, S.N.; Kumar, A.; Ghadai, S.K., “Customer satisfaction in health insurance: Evidence from India,” International Journal of Innovative Technology and Exploring Engineering.\nKumar, A.; Singh, G.; Swain, B.; Devdutta, K., “From supply chains to global value chains–The enabler of sustainable trades,” International Journal of Mechanical Engineering and Technology.\nKumar, A.; Debnath, N., “Factors affecting mobile banking adoption behaviour in north eastern states of India,” International Journal of Mechanical Engineering and Technology.\nKumar, A.; Debnath, N.; Devadutta, K.; Singh, G., “Dynamics of mobile banking adoption behaviour in North Eastern states of India,” International Journal of Mechanical Engineering and Technology.\nChaudhuri, S.; Kumar, A.; Biswal, B.K., “New normal predicament of farmers in the FDI retail dominion,” International Journal of Mechanical Engineering and Technology.\nKumar, A.; Chaudhuri, S.; Biswal, B.K., “Service quality scales – A review,” International Journal of Mechanical Engineering and Technology."
        }
    },
    {
        "name": "Ashutosh Kar",
        "role": "Associate Professor",
        "email": "ashutoshkar@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/ashutosh-kar/",
        "bio": "",
        "dynamic_sections": {}
    },
    {
        "name": "Satyajit Kamila",
        "role": "Assistant Professor",
        "email": "satyajit.kamila@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/satyajit-kamila/",
        "bio": "Satyajit joined as Assistant Professor in the area of Operations Management at KIIT School Of Management in July 2023. Industrial Experience Satyajit gained a significant amount of industry experience over a period of 11 years, holding several managerial capabilities in diverse sectors such as Production, Supply Chain, Contract & Procurement, Inventory Management, Project Management etc. This experiential learning was gained at Rashtriya Chemicals & Fertilisers (RCF), a NAVRATNA PSU under Ministry of Chemicals & Fertilisers, GOI. Research Interests His current areas of research interest include Supply Chain Modelling incorporating sustainability; Perishable Inventory Systems; Revenue Sharing Models in coordinated supply chains and Case Research method in Operations Management.",
        "dynamic_sections": {}
    },
    {
        "name": "Poornima Mahapatra",
        "role": "Assistant Professor",
        "email": "poornima.mahapatra@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/poornima-mahapatra/",
        "bio": "Poornima Mahapatra completed her Ph.D in Management from Xavier Institute of Management, Xavier University, Bhubaneswar in the year 2018. Her research interests include Sensemaking, Organizational Change and Qualitative Research. She has been teaching post-graduate and undergraduate students for the last 8 years. Her teaching interests include Organizational Behaviour, Organizational Theory and Design and Organizational Change. She has also worked as a freelance consultant and her consulting work includes developing cases and evaluation at virtual assessment centres.",
        "dynamic_sections": {}
    },
    {
        "name": "Sambit Kumar Dash",
        "role": "Assistant Professor",
        "email": "sambitk.dash@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/sambit-kumar-dash/",
        "bio": "Prof. Sambit Kumar Dash is an academic and researcher in management with a focused interest in energy systems, operations, and strategy. He holds an MBA from XIM Bhubaneswar and is UGC-NET qualified in Management. With over 5 years of experience in teaching and consulting, he has contributed to projects involving project management, monitoring & evaluation, and stakeholder engagement. Currently pursuing his PhD at the Indian Institute of Management Sambalpur (since 2022), his research interests span sustainable energy transitions, digital transformation in the energy sector, business strategy, and applied economics. Passionate about quantitative analysis, Prof. Dash enjoys working with data and numbers to derive actionable insights in business horizons. He has actively participated in several national and international conferences, including forums such as POMS and PAN IIM Conference, further strengthening his academic exposure.",
        "dynamic_sections": {}
    },
    {
        "name": "Saroj K. Routray",
        "role": "Associate Professor",
        "email": "saroj@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/saroj-k-routray/",
        "bio": "Prof. Saroj is a qualified Cost Accountant and is an alumnus of IIM Ahmedabad. He holds post-graduation degrees both in Management and in Commerce and has done Ph.D. from Utkal University. He has worked in Finance and Management Accounting functions in the industry for 3 years and has an academic experience of 20 years. He teaches Corporate Accounting, Cost & Management Accounting, Security Analysis & Portfolio Management at BBA and MBA programmes. He has conducted MDPs for UNICEF, Hindalco, OPTCL, Vedanta Aluminium, Visa Steel, PPL, OHPC, IMFA, CESU, Stone India Limited and Crompton & Greaves. He has also worked as a consultant to CAPART, Ministry of Rural Development, Govt. of India, for monitoring and evaluating the projects sponsored by the organisation in Odisha, West Bengal, and Chhattisgarh, His doctoral research is in corporate governance and has a couple of research papers identifying the relationship between Firm Performance and Corporate Governance. Currently, he has completed an ICSSR funded project on Ageing Population and Government Interventions. Apart from research papers, he has also written a couple of cases in accounting and finance domain.",
        "dynamic_sections": {
            "Research Publication": "Revenue from Contract: Cash vs Accrual, Ind AS115, Emerald Emerging Markets Case Studies, ISSN:2015-0621, volume 10, (4), November 2020\nNoamundi Steel Plant, Parikalpana, ISSN: 0974-2808, volume-10(1), Jan-Jun,2014.\nAudit Committee Independence, Board Composition, CEO Duality and Firm Value,  The Indian Management Researcher(UGC approved), ISSN: 2349-2090,  Volume 4(1), January-June 2017, UGC approved journal.\nAn Empirical Analysis of the Impact of Multiple Directorship and Chief Executive Officer (CEO) Duality on Firm’s Performance, Volume 17(1), January- March 2017, Siddhant, ISSN: 2231-0649, UGC approved journal.\nBoard Composition, Board Gender Diversity and Firm Performance: Evidence from India, Parikalpana, ISSN: 0974-2808, Volume 12(II), July-December 2016, UGC approved journal.\nUS Subprime crisis, a global financial shock and it’s impact on Indian economy, Banking Sector in particular, Siddhant, ISSN: 2231-0649, Volume-11, No-1, January-March 2011, pp 89-96, UGC approved journal.\n“Special Economic Zone: A Comparative Study of Three Developing Countries, India, Ukraine and China, Siddhant, ISSN: 0091/2002-TC, volume 8, January-March 2008 UGC approved journal."
        }
    },
    {
        "name": "Anubhav Mishra",
        "role": "Professor",
        "email": "anubhav.mishra@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/anubhav-mishra/",
        "bio": "Dr. Anubhav Mishra is a Professor of Marketing at the KIIT School of Management. Previously, he has taught at the Goa Institute of Management (GIM; AMBA Accredited), T. A. Pai Management Institute (TAPMI; AACSB and AMBA Accredited), ICFAI Business School (IBS; AACSB Accredited), and Amrita School of Business (ASB; AACSB Accredited). He was also associated with Reliance Telecom Ltd. He has qualified for the UGC NET (2012) and completed the Management Teacher’s Program. His research focuses on the role of consumer psychology with strategic marketing implications in the field of branding, retailing, spatial and numerical processing, and consumption experiences. His work has been published/forthcoming in the Journal of Consumer Behavior, Journal of Brand Management, International Journal of Market Research, Journal of Strategic Marketing, Journal of Consumer Marketing, International Review of Retail, Distribution and Consumer Research, Journal of Global Marketing, and International Journal of Politics, Culture, and Society amongst others. Till date, his research has been cited in class leading journals like the Journal of Marketing (ABDC Journal Ranking ‘A*’; FT50), Journal of the Academy of Marketing Science (ABDC Journal Ranking ‘A*’; FT50), and Journal of Business Ethics (FT50). He teaches Marketing Research, Product and Brand Management, Retailing Management, Customer Relationship Management, Marketing Management, and Advanced Marketing Management. He has written a book and presented papers at many international and national conferences. He has conducted several MDP/FDPs. Google Scholar citations – 506 (Click Here)",
        "dynamic_sections": {
            "Research Publication": "Mishra, A. A. (2025). Decoding Celebrity-owned Brand Coolness: Exploring its Impact on Brand Experience through Tight and Loose Cultural Contexts,Journal of Brand Management,forthcoming.(ABDC ‘A’; Impact Factor– 4.1) (With Radhika, K.R.)\nMishra, A. A. (2025). From Efficiency to Immersion: Understanding Generational Differences in Avatar Interactions,Computers in Human Behavior, 172. (ABDC ‘A’; Impact Factor – 9.00) (With Pawar, S.S.)\nMishra, A. A. (2024). Low-literate Customer Experience: An Empirical Exploration,Marketing Intelligence & Planning, 42(1). (ABDC ‘A’) (With M. Verma, Ph.D. Student)\nMishra, A. A. (2023). Socio-demographic, Shopping Self-Concept, and Shopping-Context Related Moderators of Customer Experience,International Review of Retail, Distribution and Consumer Research, 33(2). (ABDC ‘B’) (With M. Verma, Ph.D. Student)\nMishra, A. A. (2022), Low-literate Versus Literate Customer Experience: Dimensions, Consequences and Moderators,International Journal of Market Research, 64(1). (ABDC ‘A’; Impact Factor – 3.3) (With M. Verma, Ph.D. Student)\nMishra, A. A. (2020), When should We not expect Attraction Effect? The Moderating Influence of Analytic versus Holistic Thinking,Journal of Strategic Marketing, 28(5). (ABDC ‘A’) (With P. Banerjee, IIM Kozhikode; P. Chatterjee, University of Utah; S. Mishra, University of Kansas)\nMishra, A. A., S. C. Sharma, V. Gautam and R. Manna (2019), Gandhian Values and Consumption Behaviour: Scale Development and Validation,Journal of Strategic Marketing, 27(6). (ABDC ‘A’)\nMishra, A. A. (2019), Loss is a Loss, Why Categorize it? Mental Accounting across Cultures,Journal of Consumer Behaviour, 18(2). (ABDC ‘A’; Impact Factor – 4.4) (With P. Banerjee, IIM Kozhikode; P. Chatterjee, University of Utah; S. Mishra, University of Kansas)\nMishra, A. A. (2018), Consumer Responses to Brand Deletion,Journal of Brand Management, 25(2). (ABDC ‘A’; Impact Factor– 4.1)\nMishra, A. A. (2016), The Role of Customer Gratitude in Relationship Marketing: Moderation and Model Validation,Journal of Strategic Marketing, 24(6). (ABDC ‘A’)\nMishra, A. A. (2015), Consumer Innovativeness and Consumer Decision Styles: A Confirmatory and Segmentation Analysis,International Review of Retail, Distribution and Consumer Research, 25(1). (ABDC ‘B’)\nMishra, A. A. and A. Mishra (2014), National vs. Local Celebrity Endorsement and Politics,International Journal of Politics, Culture and Society, 27(4). (Scopus Q2)\nMishra, A. A. (2014), Shopping Value, Satisfaction and Behavioural Intentions: A Socio-Demographic and Inter-Product Category Study on Private Label Brands,Journal of Global Marketing, 27(4). (ABDC ‘B’)\nMishra, A. A. (2013), Psychoanalytic Accounts of Consuming Desire: Hearts of Darkness,Journal of Consumer Marketing, 30(7). (ABDC ‘A’)\nMishra, A. A. (2012), Not for Free: Revenue Strategies for a New World,Journal of Consumer Marketing, 29(4). (ABDC ‘A’)\nMishra, A. A. (2012), About Face: The Secrets of Emotionally Effective Advertising,Journal of Consumer Marketing, 29(2). (ABDC ‘A’)\nMishra, A. A. and M. K. Srivastava (2012), Shopping Value, Satisfaction and its Behavioral Outcomes in the Purchase of Private Label Branded Products: A Theoretical framework,Journal of Marketing and Operations Management Research, 1(3).\nMishra, A. A. (2012), Consumer Decision-Making Styles and Young-Adult Consumers: An Indian Exploration,Management and Marketing Journal, 8(2).\nMishra, A. A. (2010), In Search of the Obvious: The Antidote for Today’s Marketing Mess,Asia Pacific Business Review, 6(4).\nMishra, A. A. (2010), Factors Affecting Customer Satisfaction and their Relative Importance in the Retail Banking Sector: An Empirical Study,Icfaian Journal of Management Research, 9(3).\nMishra, A. A. (2009), A Study on Customer Satisfaction in the Indian Retail Banking,Icfaian Journal of Management Research, 8(11).",
            "Book Publication": "Mishra, A. A. (2011), Customer Satisfaction and Retail Banking: An Indian Experience. LAP Academic Publishing GmbH & Co. KG, Germany. ISBN: 978-3-8443-9423-8\nBook Chapter:\nMishra, A. A. and M. K. Srivastava (2013), Shopping Value, Satisfaction and its Behavioral Outcomes in the Purchase of Private Label Branded Products: A Theoretical framework. In P. Kyriazopoulos (Ed.).HRM and Marketing Orientation in the New Era, p. 235-54, Nova Science Publishers: New York. ISBN: 978-1-62808-959-2"
        }
    },
    {
        "name": "Ipsita Nayak",
        "role": "Assistant Professor",
        "email": "ipsita.nayak@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/ipsita-nayak/",
        "bio": "Dr. Ipsita Nayak has completed her PhD from Utkal University and a Certificate course in Communication and Management Essentials from IIT, Kharagpur. Her doctoral research on the theme of “Social Exclusion” is in the area of Indian English fiction. She has 20 years of teaching experience in the area of Communicative English, Business Communication and Managerial Communication. She conducts training programmes for employees at various capacities in different organizations. She has designed and facilitated training at NINL, NTPC, Tata Power, SIDBI and ESSPL. Dr. Nayak has delivered several talks in academic forums as a resource person and invited speaker. She has an expertise in designing ABL (activity-based learning) sessions. She offers personalized solutions to the problems concerning the communication competency of students/ trainees. She believes in upgrading herself with perpetual research. Her research orientation is reflected in her numerous presentations in seminars and conferences and in her publications in both print and electronic media. She is also associated with reputed journals as a reviewer. Her research interests include World literature, Tribal literature, Postcolonial literature, Sustainability studies and Cultural Studies.",
        "dynamic_sections": {
            "Research Publication": "Satapathy, M.; Nayak, I., “The Lioness Defending her clan in the North East: A Study of Ecospiritual Elements in Mamang Dia’s Fiction,” Rupkatha Journal of Interdisciplinary Studies in Humanities."
        }
    },
    {
        "name": "Suvasis Ghosh",
        "role": "Assistant Professor",
        "email": "suvasis.ghosh@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/suvasis-ghosh/",
        "bio": "Prof.  Suvasis Ghosh is an alumnus of the Indian Institute of Foreign Trade (IIFT), New Delhi, where he earned a master’s degree in International Business. He has over 20 years of experience in Strategy and Marketing, having worked with leading MNCs like Deloitte, KPMG, Archer Daniels Midland, YES Bank, and Cargill. He has served as a Strategic Management Consultant with expertise spanning Food and Agribusiness, as well as the Consumer Sector. He has provided advisory services to both Private and Public Clients, covering a range of projects/initiatives including business plan formulation, partner search, organizational restructuring, policy planning and advocacy, financial advisory, among others. He’s been a member of advisory councils in industry bodies like FICCI and CII, and has published multiple thought leadership pieces on the consumer sector during his corporate tenure. Presently, he holds the position of Marketing Professor at KIIT School of Management, Bhubaneswar.",
        "dynamic_sections": {}
    },
    {
        "name": "Manoj Kumar Jena",
        "role": "Assistant Professor",
        "email": "manoj.jena@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/manoj-kumar-jena/",
        "bio": "Prof. Manoj has corporate experience of over 10 years spanning diverse sectors such as manufacturing, IT, Automotive, and finance. He has worked in different projects for companies like OCFL, WIPRO, Geometrics Ltd, Dana Automobile, and Institutional Investors Advisory Services (IiAS): capital markets, Mumbai. His area of interest includes Data Analytics & Machine Learning, Predictive Modelling, Dynamic Pricing, Operations management, Logistics and supply chain management and Analytics, Corporate finance and Economics.",
        "dynamic_sections": {
            "Research Publication": "Jena, Manoj Kumar; Kar, Brajaballav, “Stages and Methods for Cleaning Large Secondary Data Using R,” Methodological Issues in Management Research : Advances, Challenges, and the way ahead.\nKar, B.; Jena, M.K., “Performance and age of companies listed on the Bombay stock exchange,” Indian Journal of Finance."
        }
    },
    {
        "name": "Prasun Bhatta Mishra",
        "role": "Assistant Professor",
        "email": "prasun.mishra@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/prasun-bhatta-mishra/",
        "bio": "Prof. Prasun Bhatta Mishra has obtained his Bachelors in Mechanical Engineering from BITS Pilani-Goa and his Masters in Economics from the Gokhale Institute of Politics and Economics, Pune. He has qualified the UGC NET (Economics). Until recently he was a full-time PhD scholar at the Indira Gandhi Institute of Development Research (IGIDR), an advanced research institution set up by the Reserve Bank of India and has submitted his dissertation for evaluation. His work experience in Industry comprises stints as a Design Engineer at Hindustan Aeronautics Limited and as a Health Economist at BresMed Health Solutions. His work experience in Academia comprises stints as an Assistant Professor at Symbiosis School of Economics, Pune and at the KIIT School of Management before proceeding for his doctoral studies. He has also taught as a guest faculty in the Business Analytics Program at SCMHRD, Pune. Prof. Prasun specializes in teaching quantitative courses such as Econometrics, Operations Research and Statistics. His research interests include Applied Econometrics, Health Economics, Household Economics and a bit of Industrial Organization. He has also conducted a faculty development program in Modeling with Excel for the faculty-members of Symbiosis International University and a workshop in Data Analysis with Excel for IDBI officers, Bhubaneswar. Journal Publications: Conference Presentations:",
        "dynamic_sections": {}
    },
    {
        "name": "Siddharth Ranjan",
        "role": "Assistant Adjunct Professor",
        "email": "arth.ranjan@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/siddharth-ranjan/",
        "bio": "Siddharth Ranjan is a Chartered Accountant with over25 years of post-qualification experience, combining corporate leadership, consulting, and teaching. A fellow member of theInstitute of Chartered Accountants of Indiasince 2000, he has held senior finance roles in reputed healthcare and corporate organisations, including VBCT – Vigyan Bharati Charitable Trust, Kalinga Hospital Ltd, Tatwa Technologies Ltd, and Milk Mantra Pvt Ltd. He also has experience working with IndusInd Bank, Ernst & Young (Sri Lanka), and PwC (Maldives) early in his career. He has also represented clients as a former partner of Tej Raj & Pal – Chartered Accountants- at the ITAT- Income Tax Appellate Tribunal. He continues to practice Tax Laws. Siddharth is also a community leader, writer, and active participant in ICAI Bhubaneswar, where he has served in multiple elected roles. He holds the following qualifications: B.Com (Hons), LLB, FCA, JAIIB. He is known for mentoring young professionals and propagating constitutional and democratic values through civic engagements.",
        "dynamic_sections": {}
    },
    {
        "name": "Sweta Singh",
        "role": "Assistant Professor",
        "email": "sweta.singh@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/sweta-singh/",
        "bio": "Sweta Singhis an Assistant Professor of Human Resource Management at KIIT School of Management (KSoM). She is a Fellow Programme in Management (FPM) scholar in Organizational Behavior at XLRI – Xavier School of Management, India. Her academic trajectory includes roles at the Indian School of Business (ISB), Hyderabad, as an Academic Associate, and at ISB Mohali as a Research Analyst with the Bharti Institute of Public Policy. Sweta has prior industry experience with WNS Global Services and has also interned at SAIL and IDBI Federal Life Insurance. She has presented her research at several leading academic conferences including the British Academy of Management (BAM), Australia and New Zealand Academy of Management (ANZAM), and the ISDSI-Global Conference. An alumna of the Madras School of Economics and Symbiosis International University, her research lies at the intersection of sustainability, climate change attitudes in organizations, workplace behavior, negotiations, and gender dynamics. She has also taken guest sessions at XLRI and IIM Raipur as part of Management Development Programs (MDPs), focusing on negotiation strategies and inclusive work-life practices. Beyond academia, Sweta is an emerging author with two published creative works, including her contribution to the widely acclaimed anthologyUnsent Letters from the South Asian Diaspora, reflecting her interest in culture, emotion, and identity narratives.",
        "dynamic_sections": {
            "Book Publication": "Unsent Letters from the South Asian Diaspora\nAn Egghead’s Journal"
        }
    },
    {
        "name": "Biswajit Das",
        "role": "Professor",
        "email": "biswajit@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/biswajit-das/",
        "bio": "Dr. Das joined KIIT University since 1999 and has 30 years of experience in academia, administration and government. He has authored 12 books (national and International), 194 research papers (National and International), awarded with 21 Ph.D. research scholars (Indian and International) & 8 scholars are under guidance and implemented funded projects. His outstanding books include ‘Real Estate Market’ (Excel Books), ‘Transnational Marketing Strategy’ (New Age Publication) and ‘Business Communication and Personality Development’ (Excel Books). Prof. Das was Member-Board of Management, Member -Academic Council, Deputy Registrar (Academics), Chairperson- Doctoral Programme, Chairperson- Marketing Management Area and has been instrumental in the institution building process of KSOM since its inception. He has Board of studies member of several state and central universities and external expert for Ph.D. scholars, invited as speaker and conducts MDP. Prof. Das is a visiting external expert (opponent) to Tallinn University of Technology (TUT), Estonia-Europe for doctoral research and has presented sever research papers in national and international conferences (adjudged with best paper) in South East Asia, Europe, Middle East, particularly in NTU-Singapore, SQU-Oman, AIT-Bangkok and TUT-Estonia in the domain of value creation, servitisation, Economic inclusion, digital markets, disaster resilience, communication & advertising , real estate and eco-tourism.",
        "dynamic_sections": {
            "Book Publication": "Business Communication & Personality Development, Excel Books.\nThe book reflects on the core contents of communication needed in a business environment. It has unique chapters which are essential for broadening the horizon of thought and inculcating capabilities to read, write and speak better.\nOrganisational Communication, LAP LAMBERT Academic Publishing.\nThis book on organisational communication teaches on the aspects of organisational communication across hierarchies. It spells on the activities involved with any organisation.\nTrans-national Marketing Strategy, New Age International Publications, New Delhi.\nThis book is for understanding international market forces and their strategies. It contains the essence of strategic methods through which business can be driven in a global market.\nBiological Warfare, LAP Lambert Academic Publishing.\nBiological warfare is a book written in the times of corona; exploring the reasons of the pandemic. It details on the antiquities of the pandemic more vividly from the days of swine flu of 1918. Eventually delved deep into the periodic emergence of pandemics and their impact on human beings.\nBusiness Environment: Problems & Prospects, SSDN Publishers and Distributors, New Delhi.\nThis book explores the link between product portfolios and possibility of firms in a competitive business environment. It dealt on the holistic factors of the firm’s internal and external aspects.\nChange Management through Enterprise Resource Planning, OM Publication.\nThis is a book on change management through ERP. It captures on the change management strategies required for the companies for implementation in employee engagement in a dynamic milieu.\nReal Estate Market: New Economy New Business, Excel Books.\nIt is the first book in India on real estate management It is  a path breaking book which provides holistic knowledge of the market forces for executives and entrepreneurs to understand and practice.\nJourney of slum Dwellers: A Socio-Eco-Environmental Crusade, LAP.-LAMBERT Academic Publishing.\nThis book pertains to the slum dwellers journey in settling in cities related to Bhubaneswar, the capital city of Odisha state. A pragmatic approach to the menace of slums due to mass exodus from villages in search of incomes.\nSocio Economy Journey of an Impoverished Eastern Indian State, LAP.-LAMBERT Academic Publishing.\nThis pioneering book is regarding Odisha and its developmental actions. It is a narrative of the socio economic journey of Odisha- an impoverished state emerging with time. It also highlights the strategic endeavour desires of the governance for development of the state.\nSocial marketing and Tobacco consumption Control, LAP.-LAMBERT Academic Publishing.\nThis cutting edge book teaches on the strategies for curbing tobacco consumption in India with special reference to a research focus on Odisha as a microcosm. It deals on the trade of all types of narcotics and need for policy intervention. It is a book with a difference based on research and introspection.\nTreasured Feelings, Paperback.\nThis book has a collection of liting poems and exquisite couplets reflecting on the esoteric philosophy of love and life through its finest language. It is a must read for the poets, students of literature and all. Lines have been crafted with passion and penance in relationships between lives.\n“Impulse: A Saga of Love”, Collection of poetic stanzas, Paperback Edition.\nBooklet depicts on the 16 stanzas the mystic philosophy of love and fortitude reckoned in the purity of heart. It is in the line of rubaiyas with unbridled passion of Sufi scriptures.\nBrand Management, Avon Publication.\nThis book is a research pursuit for understanding the influence on consumer purchase behaviour in the Indian industry on brand management. It teaches on the product portfolio and multidimensional facets of branding and brand value for making performing organisations.",
            "Research Publication": "Bisoyi, Bhubaneswari; Das, Divyajit; Das, Biswajit, “Assessing Global Environmental Sustainability: Second-Order Effect of Information and Communication Technology,” Smart Innovation, Systems and Technologies.\nPurkayastha, Debapratim; Tripathy, Trilochan; Das, Biswajit, “Understanding the ecosystem of microfinance institutions in India,” Social Enterprise Journal.\nBisoyi, Bhubaneswari; Das, Biswajit, “An Approach to En Route Environmentally Sustainable Future through Green Computing,” 1st International Conference on Smart Computing and Informatics (SCI).\nBisoyi, Bhubaneswari; Das, Biswajit, “Necessitate Green Environment for Sustainable Computing,” 2nd International Conference on Computer and Communication Technologies.\nKumar, M.; Kumar, P.J.; Biswajit, D., “Co-creation with customers in product development and services: An empirical analysis for competitive advantage,” Journal of Advanced Research in Dynamical and Control Systems.\nDas, D.; Bisoyi, B.; Satpathy, I.; Das, B., “Urban Infrastructure and Special Economic Zone (SEZ): Challenges for Corporate Land Alienation,” Lecture Notes in Civil Engineering.\nFaruk, O.; Panigrahi, J.K.; Das, B.; Subudhi, R.N, “Innovation for changing needs of customers and their consumption patterns in retail for competitive advantage: An experiential case study,” Journal of Advanced Research in Dynamical and Control Systems.\nBisoyi,B.; Nayak, B.; Das B., “Secured and sustainable e-governance: hedging the risk by cyber security,” International Journal of Scientific and Technology Research.\nPurkayastha, D.; Tripathy, T.; Das, B., “Understanding the ecosystem of microfinance institutions in India,” Social Enterprise Journal.\nBisoyi, B.; Das, D.; Das, B., “Assessing Global Environmental Sustainability: Second-Order Effect of Information and Communication Technology,” Smart Innovation, Systems and Technologies.\nFaruk, O.; Das, B.; Subudhi, R.N.; Panigrahi, J.K., “Firm-level determinants to influence the target group for online business growth: An empirical analysis,” Journal of Advanced Research in Dynamical and Control Systems.\nDas, P.K.; Panigrahi, J.K.; Naik, I.C.; Das, B., “Impact of ict on career aspiration of students belonging to indigenous communities and most backward sections of India: An empirical study of tribal development board schools of Odisha,” International Journal of Scientific and Technology Research.\nBisoyi, B.; Das, D.; Pasumarti, S.S.; Das, B., “An Evaluation on Green Manufacturing: It’s Technique, Significance and Rationality,” IOP Conference Series: Materials Science and Engineering.\nMishra, V.; Das, B., “Facilitators of e-tail patronage behaviour among generation z consumers,” Indian Journal of Marketing.\nNayak, P.; Panigrahi, J.K.; Das, B.; Neurgaonkar, S., “Effectiveness of technology business incubators and functions of technology leading to the success of a start-up business: A pragmatic analysis,” Journal of Advanced Research in Dynamical and Control Systems.\nMohanty, S.; Das, B.; Panda, P.C.; Sahoo, P.R.; Panigrahi, J.K., “Study of factors that influence retailers in product assortment as per the customers preference of products, leading to improved retailer performance for customer satisfaction and retention,”Journal of Advanced Research in Dynamical and Control Systems.\nMohanty, S.; Das, B.; Panda, P.C.; Sahoo, P.R.; Panigrahi, J.K., “Technological and organisational dynamics influencing e-marketing, an empirical analysis of preference patterns of consumers acceptance for online retail (E-tailers),” Journal of Advanced Research in Dynamical and Control Systems.\nRath, B.P.; Das, B.; Panigrahi, J.K., “Sustainability impact assessment of developmental programmes undertaken by mining industries as part of the corporate social responsibility for value creation,” International Journal of Mechanical and Production Engineering Research and Development.\nPanda, R.K.; Das, B., “Technology adoption models: A critical review for smes in Odisha,”International Journal of Mechanical Engineering and Technology.\nSingh, M.; Misra, S.N.; Das, B., “Macro-economic analysis of global economic recession 2007-2009 and policy measures that enabled recovery of US Economy,” International Journal of Mechanical Engineering and Technology.\nRath, B.P.; Panigrahi, J.K.; Das, B., “Community relations by industries as a part of social responsibility and social value creation: An empirical case analysis,” International Journal of Mechanical Engineering and Technology.\nBisoyi, B.; Das, B., “An approach to en route environmentally sustainable future through green computing,” Smart Innovation, Systems and Technologies.\nSenapati, S.; Bisoyi, B.; Das, B., “Intent and synergies behind the merger and the future roadmap of E-commerce industries: A case analysis,” Journal of Advanced Research in Dynamical and Control System.\nDas, B.; Mishra, S.N.; Bisoyi, B., “Green technology for attaining environmental safety and sustainable development,” International Journal of Mechanical Engineering and Technology.\nAiyer, M.; Kumar Panigrahi, J.; Das B., “Successful customer relationship management in business process integration and development of applications for project management,” International Journal of Mechanical Engineering and Technology.\nNayak, P.; Das, B.; Kumar Panigrahi, J., “Intent of technology, innovation and value creation for start-up entrepreneurs,” International Journal of Mechanical Engineering and Technology.\nAiyer, M.; Panigrahi, J.K.; Das, B., Neurgaonkar S., “Cross-functional process framework for customer experience and customer relationship management: Reinventing a dimension mix to value co-creation,” Journal of Advanced Research in Dynamical and Control Systems.\nPanigrahi, J.K.; Tripathy, S.; Das, B., “Linkages between innovation, service & network within supply chain: A critical review,” International Journal of Mechanical Engineering and Technology.\nPanigrahi, J.K.; Tripathy, S.; Das, B., “Thematic analysis of service innovation taxonomy within supply network, creating value for the system,” International Journal of Mechanical Engineering and Technology.\nPurkayastha, D.; Tripathy, T.; Das, B., “Securitisation of microfinance institutions in India: A sustainable strategic direction,” International Journal of Applied Business and Economic Research.\nBisoyi, B.; Das, B., “Necessitate green environment for sustainable computing,” Advances in Intelligent Systems and Computing."
        }
    },
    {
        "name": "Ipseeta Satpathy",
        "role": "Senior Professor",
        "email": "ipseeta@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/ipseeta-satpathy/",
        "bio": "Prof. Ipseeta Satpathy has over 25 years of experience in teaching, research and administration at KIIT University. She has authored six textbooks such as “Environment Management”, “Business Communication & Personality Development” published by Excel Books, New Delhi, Transnational Marketing Strategy, published by New Age International Publishers, Organizational Communication published by Lap Lambert, Mauritius and Empowering Award Staff by Revamping Training System in Banks, published by Lap Lambert, Germany. Dr. Satpathy has published more than 300 research papers in various referred national & international journals including journals in ABDC category, conference proceedings and has more than 150 research papers in Scopus indexed journals. Prof. Satpathy is a former visiting professor, Lynchburg College, Virginia, USA and has attended/presented research papers in several international conferences including the International Conference on HRM &PD in the Digital Age in Singapore, Cambridge Business & Economics Conference, Cambridge University, UK, and some of her research papers have also won the Best Paper Award including one which was adjudged as the best paper by Emerald group publishing ltd. Prof Satpathy is guiding several research scholars for the Ph.D degree and 29 of her scholars have been awarded Ph.D degree by KIIT Deemed to be University and she has also conducted a number of Management Development Programmes . Dr. Satpathy has been awarded the prestigious Oxford Journal Distinguished Research Professor Award 2014 at Cambridge University, London. Dr. Satpathy was invited by the Charlton Business School University of Massachusetts, Dartmouth, USA to address the faculties & the students. Prof Satpathy was invited by the Southampton University, UK, where she also addressed the faculties, students and research scholars. Dr. Ipseeta Satpathy, was felicitated with the Times Power Women 2023, by the Times of India (TOI) group as an eminent academician in producing and upskilling quality professionals for today’s workforce.",
        "dynamic_sections": {
            "Book Publication": "Economic Growth in India, Shandilya Publications.\nThis book examines the problem of economic growth in India relating to global and domestic challenges, comprises scattered articles of eminent scholars of India related to economic growth.\nEnvironment Management, Excel Books.\nThis book deals on the holistic aspects of environment and its management.\nBusiness Communication & Personality Development, Excel Books.\nThe book reflects on the core contents of communication needed in a business environment. It has unique chapters which are essential for broadening the horizon of thought and inculcating capabilities to read, write and speak better.\nOrganisational Communication, LAP LAMBERT Academic Publishing.\nThis book on organisational communication teaches on the aspects of organisational communication across hierarchies. It spells on the activities involved with any organisation. The outline of organisational climate is dealt with the angularities of communication.\nTrans-national Marketing Strategy, New Age International Publishers.\nThis book is for understanding international market forces and their strategies. It contains the essence of strategic methods through which business can be driven in a global market.\nEmpowering Award Staff by Revamping Training System in Banks, LAP Lambert Academic Publishing.\nThis book is based on the award staff empowering and revamping in training systems in the banks. Revamping is about right sizing and engaging the employees in the rightful manner.",
            "Research Publication": "Nayak, S; Patnaik, BCM; Satpathy, I, “The Convergence of IFRS and its impact on the Stock Market Performance of the Jewellery Industry,” EURASIAN CHEMICAL COMMUNICATIONS.\nMishra, Deepti; Satpathy, Ipseeta; Patnaik, B. Chandra Mohan; Patnaik, Atmika, “Impact of organizational citizenship behavior on augmenting the performance of working women: a research study in IT sector,”EURASIAN CHEMICAL COMMUNICATIONS.\nRoy, A; Patnaik, BCM; Satpathy, I, “Impact of Covid-19 crisis on Indian MSME sector: A study on remedial measures,” EURASIAN CHEMICAL COMMUNICATIONS.\nRoy, A; Patnaik, BCM; Satpathy, I, “Consolidated recommendations to change GST patterns for managing the impact of Covid-19: A case in India,” EURASIAN CHEMICAL COMMUNICATIONS.\nDas, D.; Bisoyi, B.; Satpathy, I.; Das, B., “Urban Infrastructure and Special Economic Zone (SEZ): Challenges for Corporate Land Alienation,” Lecture Notes in Civil Engineering.\nRath, D.; Satpathy, I.; Patnaik, B.C.M., “Womenpreneurs in Odisha: Challenges & motivational factors,” International Journal of Scientific and Technology Research.\nRath, D.; Satpathy, I.; Patnaik, B.C.M., “Industry 4.0-a new futuristic technological revolution a catalyst of innovation & entrepreneurship in creation of enterprises,” International Journal of Innovative Technology and Exploring Engineering.\nMohapatra, M.; Das, S.C.; Patnaik, B.C.M.; Satpathy, I., “Role of information technology in education and skill based learning for employability,” International Journal of Innovative Technology and Exploring Engineering.\nChakrabarti, S.; Satpathy, I.; Patnaik, B.C.M., “Psychological contract and attrition in information technology sector,” International Journal of Innovative Technology and Exploring Engineering.\nMohapatra, M.D.; Satpathy, I.; Patnaik, B.C.M., “Impact of dimensions of organizational citizenship behaviour on job satisfaction in information technology sector,” International Journal of Innovative Technology and Exploring Engineering.\nMishra, D.; Satpathy, I.; Patnaik, B.C.M., “Role conflict among women entrepreneurs in information technology (IT) sector,” International Journal of Innovative Technology and Exploring Engineering.\nSatpathy, I.; Patnaik, B.C.M.; Palai D., “Role of it among multi-generational workforce in banking sector,” International Journal of Innovative Technology and Exploring Engineering.\nSatpathy, I.; Patnaik, B.C.M.; Palai, D., “Determinants of revenue collection efficiency and administration: The case of local government authorities in wolaita fzone, Ethiopia,” International Journal of Engineering and Advanced Technology.\nPatnaik, B.C.M.; Satpathy, I.; Debnath, N.C., “Wisdom that equality tends to offer: The case of real earnings management practices of female directors in IT-friendly firms of Bangladesh,” International Journal of Engineering and Advanced Technology.\nRath, D.; Satpathy, I.; Patnaik, B.C.M., “Augmented reality (Ar) & virtual reality (Vr)-a channel for digital transformation in industrialization fostering innovation & entrepreneurship,” International Journal of Innovative Technology and Exploring Engineering.\nMohapatra, M.D.; Satpathy, I.; Patnaik, B.C.M., “Organizational commitment and job satisfaction in information technology sector,” International Journal of Innovative Technology and Exploring Engineering.\nDebnath, N.C.; Patnaik, B.C.M.; Satpathy, I., “By appearance and/or by amount: The impact of presence and size of audit committees on real earnings management in Bangladesh,” International Journal of Innovative Technology and Exploring Engineering.\nAregawi, H.T.; Chandra Mohan Patnaik, B.; Satpathy, I.; Litt, D., “Impact of micro finance institutions on livelihood of borrowers poverty reduction: Evidence from Tigray, Ethiopia,” International Journal of Innovative Technology and Exploring Engineering.\nLitt, I.S.D.; Patnaik, B.C.M.; Mohapatra, M.D., “Work-life balance as a parameter of job satisfaction in the manufacturing sector,” International Journal of Mechanical Engineering and Technology.\nDebnath, N.C.; Patnaik, B.C.M.; Satpathy, I., “Female directorship and real earnings management in Bangladesh: Towards an analytical assessment,” Management Science Letters.\nSatpathy, I.; Litt, D.; Patnaik, B.C.M.; Palai, D., “Challenges related to multi-generational workforce in manufacturing sector,” International Journal of Mechanical Engineering and Technology.\nHayleslasieTsegayAregawi, Chandra Mohan Patnaik B.; IpseetaSatpathy, D.L., “Determinants of leverage and its impact on firm performance-Ethiopian insurance industry,” International Journal of Mechanical Engineering and Technology.\nSatpathy, I.; Litt, D.; Patnaik, B.C.M.; Raut, D.K., “Inclusive training at workplace through information technology,” International Journal of Civil Engineering and Technology.\nPatnaik, B.C.M.; Satpathy, I.; Suhagin, S., “Role of ites in pradhanmantri kaushal vikash yojana (PMKVY): A conceptual study,” International Journal of Mechanical Engineering and Technology.\nSatpathy, I.; Patnaik, B.C.M.; Dr. Raut, D.K., “Inclusive training in manufacturing industry: A review,” International Journal of Mechanical Engineering and Technology.\nMohanty, A.K.; Patnaik, B.C.M.; Dr. Satpathy, I., “Role of information technology in alternative channel services,” International Journal of Mechanical Engineering and Technology.\nSuhagin, S.; Patnaik, B.C.M.; Satpathy, I., “ICT and skill development of the workforce-a review of literature (With special reference to Pradhan Mantri Kaushal Vikash Yojana..PMKVY),”International Journal of Civil Engineering and Technology.\nSatpathy, I.; Litt, D., Patnaik B.C.M., Chakrabarti S., “Psychological contract and its role in the infrastructure sector: A review study,” International Journal of Civil Engineering and Technology.\nI.; Patnaik, B.C.M.; Palai, D., “Intricacies of multi generational workforce in construction sector: Review study,” International Journal of Civil Engineering and Technology.\nSingh, D.K.; Satpathy, I.; Patnaik, B.C.M., “Technology – a game changer for digital transaction in India,” International Journal of Mechanical Engineering and Technology.\nPatnaik, B.C.M.; Satpathy, I.; Samal, N.R., “Determinants of infrastructure (Home) loan in Indian public sector banks,” International Journal of Civil Engineering and Technology.\nSatpathy, I.; Patnaik, B.C.M.; Tripathy, N., “Indian labour market and real estate sector: A conceptual frame work,” International Journal of Civil Engineering and Technology.\nSatpathy, I.; Patnaik, B.C.M.; Tripathy, N., “A study on workers in organized and unorganized sectors in automobile industry: A review of literature,” International Journal of Mechanical Engineering and Technology.\nSatpathy, I.; Chandra Mohan Patnaik, B.; Das, C., “Yoga as an innovative solution for financial growth of companies,” Purushartha.\nSatpathy, I.; Patnaik, B.C.M.; Anamika, “Impact analysis on employees outbound training,” Man in India.\nPatnaik, B.C.M.; Satpathy, I.; Samal, N.R., “Retail banking challenges and latest trends in India,” International Journal of Economic Research.\nDas, S.C.; Satpathy, I.; Patnaik, B.C.M.; Panch, N., “Government initiatives for rural banking: An overview,” International Journal of Applied Business and Economic Research.\nSatpathy, I.; Patnaik, B.C.M.; Mohanty, S., “Breach of psychological contract: An overview,” International Journal of Economic Research.\nSatpathy, I.; Patnaik, B.C.M.; Mohanty, S., “Impact of human cloud on organization & employees,” International Journal of Applied Business and Economic Research.\nSatpathy, I.; Patnaik, B.C.M.; Mohanty, S., “East coast railway express – An odyssey,” International Journal of Economic Research.\nSatpathy, I.; Patnaik, B.C.M.; Mohanty, S., “Workplace romance-a challenge for homo sapiens,” Man in India.\nSatpathy, I.; Patnaik, B.C.M.; Mohanty, S., “Psychological contract – A game changer for organizational success,” International Journal of Applied Business and Economic Research.\nPatnaik, B.C.M.; Satpathy, I.; Pani, M.R.; Mohanty, S., “A comparative study on performance of Pradhan Mantri Jan – Dhan Yojana (PMJDY) in Ganjam and Nayagarh districts of Odisha,” International Journal of Economic Research.\nPatnaik, B.C.M.; Satpathy, I.; Das, C., “Srimad Bhagavad Gita guidelines for Ethical Wealth Maximization: An empirical study on its impact on Business Stakeholders,”Purushartha.\nPatnak, B.C.; Satpathy, I.; Mndal, A., “Gender wise return migration decision and migrant’s perception towards developmental impact in place of origin—an empirical study,” Review of European Studies.\nSatpathy, I.; Patnaik, B.C.M.; Das, P.K., “Banishing financial untouchability of the poor through PMJDY – A tryst with new destiny,” Mediterranean Journal of Social Sciences.\nChandra Mohan Patnaik, B.; Satpathy, I.; Mandal, A., “Circular Migration and Human Mobility – an Observation,” Mediterranean Journal of Social Sciences.\nSatpathy, I.; Patnaik, B.C.M.; Das, P.K., “Transformation from class banking to mass banking through inclusive finance: A paradigm shift,” Asian Social Science.\nPatnaik, B.C.M.; Satpathy, I.; Supkar, A., “Revamping regional rural banks through Odisha Gramin Bank: A study,” International Journal of Economic Policy in Emerging Economies.\nPatnaik, B.C.M.; Satpathy, I., “An interface between VEDANTA and management – An empirical analysis,” Purushartha."
        }
    },
    {
        "name": "Arun Kumar Biswal",
        "role": "Associate Professor",
        "email": "arun.biswal@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/arun-kumar-biswal/",
        "bio": "Arun Kumar Biswal is Associate Professor of Operations Management at the KIIT School of Management. He holds a PhD in Supply Chain Management from the prestigious Indian Institute of Technology (IIT) Kharagpur. He completed his Bachelor in Electrical Engineering from the National Institute of Technology, Rourkela and earned a Post Graduate Diploma in Industrial Engineering (PGDIE) from the National Institute of Industrial Engineering (NITIE), Mumbai, a leading institution in industrial engineering and operations management. Before transitioning to academia, Dr. Biswal gained nearly a decade of professional experience in project management and supply chain management, working across both private and government sectors. His roles included optimizing processes, managing large-scale projects, and ensuring operational efficiency. He holds several professional certifications, including Project Management Professional (PMP), Certified Supply Chain Professional (CSCP), and Lean Six Sigma Black Belt, enhancing his industry expertise. Dr. Biswal’s research focuses on integrating technology into supply chain management, with particular interests in the humanitarian supply chain, RFID applications, inventory inaccuracy, and food security. He has published research papers in leading international journals such as Transportation Research Part E, Computers and Industrial Engineering, and Socio-Economic Planning Sciences, offering insights that bridge academic theory and practical application. His research contributes to improving supply chain resilience and efficiency in both commercial and humanitarian contexts. Dr. Biswal is also passionate about industry-academia collaborations, and he integrates real-world insights into his teaching through case studies and practical examples.",
        "dynamic_sections": {
            "Research Publication": "Journal papers\nBiswal, A. K., Jenamani, M., & Kumar, S. K. (2018). Warehouse efficiency improvement using RFID in a humanitarian supply chain: Implications for Indian food security system.Transportation Research Part E: Logistics and Transportation Review, 109, 205-224.doi: https://doi.org/10.1016/j.tre.2017.11.010(SCI Indexed, Q1, ABDC-A*, Elsevier)Biswal, A. K., Jenamani, M., & Kumar, S. K. (2021). Product subsidy and expected consumption with inventory inaccuracy: Implications of RFID adoption in Indian public distribution system.Computers & Industrial Engineering,159, 107527.(SCI Indexed, Q1, ABDC-A, Elsevier)Biswal, A. K., Jenamani, M., & Kumar, S. K. (2020). The impact of RFID adoption on donor subsidy through for-profit and not-for-profit newsvendor: Implications for Indian Public Distribution System.Socio-Economic Planning Sciences,69,100687. doi: https://doi.org/10.1016/j.seps.2019.02.002(SCI Indexed, Q1, ABDC-C, Elsevier)Pant, P.,Biswal, A. K.,& Golla, S. K. (2025). Payable period and firm performance: the mediating role of relational capital. International Journal of Productivity and Quality Management, 44(3), 377-402. (Scopus Indexed)A predictive model for Cash or In-kind transfer in welfare scheme: Implications for Indian Public Distribution System. Int. J. of Services and Operations Management DOI: 10.1504/IJSOM.2023.10057020 (Accepted, In Press,Scopus indexed)\nBiswal, A. K., Jenamani, M., & Kumar, S. K. (2018). Warehouse efficiency improvement using RFID in a humanitarian supply chain: Implications for Indian food security system.Transportation Research Part E: Logistics and Transportation Review, 109, 205-224.doi: https://doi.org/10.1016/j.tre.2017.11.010(SCI Indexed, Q1, ABDC-A*, Elsevier)\nBiswal, A. K., Jenamani, M., & Kumar, S. K. (2021). Product subsidy and expected consumption with inventory inaccuracy: Implications of RFID adoption in Indian public distribution system.Computers & Industrial Engineering,159, 107527.(SCI Indexed, Q1, ABDC-A, Elsevier)\nBiswal, A. K., Jenamani, M., & Kumar, S. K. (2020). The impact of RFID adoption on donor subsidy through for-profit and not-for-profit newsvendor: Implications for Indian Public Distribution System.Socio-Economic Planning Sciences,69,100687. doi: https://doi.org/10.1016/j.seps.2019.02.002(SCI Indexed, Q1, ABDC-C, Elsevier)\nPant, P.,Biswal, A. K.,& Golla, S. K. (2025). Payable period and firm performance: the mediating role of relational capital. International Journal of Productivity and Quality Management, 44(3), 377-402. (Scopus Indexed)\nA predictive model for Cash or In-kind transfer in welfare scheme: Implications for Indian Public Distribution System. Int. J. of Services and Operations Management DOI: 10.1504/IJSOM.2023.10057020 (Accepted, In Press,Scopus indexed)\nConference papers\nBiswal, A. K.,& Jenamani, M. (2018, January). Leveraging ICT for Food Security: An Analysis in the Context of PDS in India. In Annual Convention of the Computer Society of India (pp. 376-390). Springer, Singapore.\nSingh, S. K., Biswal, A. K., Kumar, S., Singh, T., & Jenamani, M. (2018, January). Optimal Equipment Positioning and Technology Selection for RFID Enabled Warehouses. In Annual Convention of the Computer Society of India (pp. 167-182). Springer, Singapore."
        }
    },
    {
        "name": "Praveen Mohanty",
        "role": "Professor",
        "email": "praveen.mohanty@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/praveen-mohanty/",
        "bio": "",
        "dynamic_sections": {}
    },
    {
        "name": "Prof. Sarbeswar Mohanty",
        "role": "Professor of practice",
        "email": "sarbeswar.mohanty@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/prof-sarbeswar-mohanty/",
        "bio": "Prof.Sarbeswar Mohanty is an alumnus of S.P Jain Institute of Management & Research, Mumbai and was awarded his Master’s Degree in Management Studies from University of Mumbai. He is an accomplished business leader with over 35 years of rich experience in senior leadership roles, having successfully handled P & L responsibilities across diverse industry verticals, including Retail, B2B and Manufacturing. His expertise spans across key sectors such as FMCG, Petroleum & Petro Chemicals, Aviation, Cement and Infrastructure, where he has consistently driven business growth, operational excellence and strategic transformations. Prof.Mohanty has been associated with some of India’s most renowned corporations and has held top management positions at Godrej-GE, Reliance Industries and Shree Cement and his leadership has played a crucial role in shaping business strategies, optimising operations and delivering sustained profitability at these organisations. He also has been keynote speaker at various International conferences & workshops representing RIL at Argus & PACE etc. With a deep passion for mentoring & knowledge sharing, Prof.Mohanty is now leveraging his vast corporate experience to contribute to business consulting & academia at KIIT School Of Management.",
        "dynamic_sections": {}
    },
    {
        "name": "Koustubh Kanti Ray",
        "role": "Professor",
        "email": "kkray@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/koustubh-kanti-ray/",
        "bio": "He is currently a Professor of Finance at School of Management, KIIT Deemed to be University.  In a career spanning more than a decade, he has served in leading national level institutions in the country – Indian Institute of Forest Management, Bhopal; Indian Institute of Management, Raipur, and Institute for Financial Management and Research, Chennai. Dr. Ray has a passion for teaching and taught business valuation, financial engineering, merger & acquisition and corporate finance at one or more of the above institutions. He regularly conducts management training programs for corporate and government executives in finance and related subjects. His research interests are mainly in the areas of corporate finance and financial markets.",
        "dynamic_sections": {
            "Research Publication": "Ray, K.K.; Mitra, Subrat Kumar, “Firm’s Financial Performance and Sustainability Efforts: Application of Classifier Models,” Global Business Revie.\nRay, K.K., “Stability of beta over market phases: An empirical study on Indian stock market,” International Research Journal of Finance and Economics."
        }
    },
    {
        "name": "Shikta Singh",
        "role": "Associate Professor",
        "email": "shiktasingh@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/shikta-singh/",
        "bio": "Dr. Shikta Singh has a great passion for Teaching & Research. Presently she is serving as an Associate Professor in KIIT School of Management, KIIT University, an institution of eminence. She was also the Head of Finance & Economics Area (2022-24) & MBA Chairperson of Healthcare Management at the Institute. She is a successful corporate trainer, training industry people on finance & technical skills. She has been an alumnus of Utkal University, Ravenshaw University, and Pune University. She has completed her PhD in the area of Applied & Analytical Economics and has completed the advanced Program in Applied Finance from IIM Calcutta. She brings with her more than 14 years of rich teaching experience in Universities like-KIIT University, Utkal University, Abhinav Institute of Management & Research, Pune. She is also a Visiting Professor to a few reputed institutions of Odisha & Outside. Her current research interest lies in various Macro Economic issues, Behavioural Finance, International Financial Management, Industrial Economics and Development Economics. She has authored around 30 research papers of national and international repute in the area of macroeconomics, industrial economics, behavioural finance, Stock market dynamics, and management as published 7 Book chapters and Two Books. She has been guiding research scholars, of which six scholars have been awarded. She is also the Editor of Parikalpana- Imagineering Business- A UGC Care Journal. She is the recipient of multiple awards and is a gold medallist.  She has worked on two research projects for RBI Bulletin and on Health care for a Consultancy. She has been Resource Persons and Keynote Speaker to some of the reputed institutions in the country and state as well. She is a regular panellist for Budget discussions and other economic discussions on Kalinga TV, News 18, DD Odia, Ten News channel. Going by the current scenario she is well versed with blended- learning techniques and taking up sessions on online platforms. She is well versed in designing e-contents for e-learning platforms. Her MOOCs in Behavioural Finance is active in theSwayam Portalwith enrolled participants of more than 5500. She has conducted multiple webinars, ATAL FDPs, MDPs and online research workshops, international conferences crowding masses of more than 3000 participants from various universities and corporates from India and abroad and also have trained faculties on using techniques for online teaching. She also has written blogs on economic significance, news columns. She has successfully bagged various projects approved by ATAL, AICTE, ICSSR & MHRD, Swayam GOI. Presented papers in various International Conferences viz. in Singapore 2014, ERAZ Conference held at Belgrade 2017, and ICOM 2017 Conference at Abu Dhabi, ICOM 2019 MICA, and IMC 2020 held at Delhi, Singapore & Nottingham University UK in 2024. She has been a position holder in her 12th, Post graduate and M.Phil level and has received gold medal for the same. Apart from that she has got 0.1 merit certificate and Gold medal for being the All India Topper in Economics during 12th board. She believes in a society where everyone has a standard of living that enables one to realise one’s potential. Dr. Shikta stands for smartly using resources towards addressing economic & social issues. Very recently she was awarded with the APJ Abdul Kalam teachers excellence award from AICTE GOI for her contribution in the field of education by honorable education minister of State Shri Subhas Sarkar at the Constitution club of India, New Delhi IN 2021 and also was awarded with the Bharat Samman Niddhi Purushkar held in Delhi Vidhan Sabha in 2024.",
        "dynamic_sections": {
            "Book Publication": "Restructuring Industrialization in Indian Economy, SSDN Publishers & Distributors.\nThis book encompasses discussion on varied themes, classified into structural and sectoral issues of industries.”",
            "Research Publication": "Singh, Shikta, “Purpose and Process of Research,” Methodological Issues in Management Research: Advances, Challenges, and the way ahead.\nMishra, S.; Singh, S.; Tripathy, P., “Linkage Between Employee Satisfaction and Employee Performance: A Case in Banking Industry ,” Global Business Review.\nKhilar, R.P.; Singh, S., “Role of emotional bias on investment decision from behavioural finance perspective,” International Journal of Scientific and Technology Research.\nSingh, S.; Das, C., “Calendar anomalies in the banking and IT index: The Indian experience,” Asian Economic and Financial Review.\nKhilar, R.P.; Singh, S., “Influence of behavioural biases on investment decision making in Bhubaneswar region,” International Journal of Recent Technology and Engineering.\nHagos, M.M.; Singh, S., “Adoption of mobile banking technology in pastoral community: A perception based study in afar regional state, Ethiopia,” International Journal of Innovative Technology and Exploring Engineering.\nHagos, M.M.; Singh, S., “Investigating the behaviour of teachers towards saving and investment: Evidence from Mekele, Tigray, Ethiopia,” International Journal of Mechanical Engineering and Technology."
        }
    },
    {
        "name": "Arvind Tripathy",
        "role": "Dean - MBA",
        "email": "dean@ksom.ac.in, arvind@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/arvind-tripathy/",
        "bio": "MBA, Ph.D. (Management), FDP (IIM Ahmedabad) Prof. Arvind Tripathy is associated with School of Management since 2008. He has 25years of experience consisting of 7 years of corporate experience and 18 years in academics. A Ph.D. in Management in the marketing area, he is an alumnus of the Department of Business Administration, Utkal University. He is an alumnus of IIM Ahmedabad (FDP program 2013). His Ph.D. topic was “A multilevel exploration of factors influencing retail image and patronage and service quality assessment of retail centres”. He was associated with the advertising industry in Mumbai and Bangalore and media services in IT training Kolkata. Later he moved to the academic world of management education. Apart from his teaching assignments, he is actively involved in MDPs in organizations like SIDBI, IDBI Bank, Utkalika, OFSDP, Mahanadi Coal Fields and in-house training programs of All India Radio & Doordarshan. He has been a resource person/trainer in various marketing workshops of national and international fame. ‘Enhancing the capacity of middle and small scale enterprises in Orissa Regional Chapter’ was a European Union- Govt. of India project. Served as a marketing consultant for ‘Capacity enhancing’ program for the craftsman and handicrafts trading societies from Orissa organized by Trade Kraft UK and IRFT Mumbai. He is also involved in projects from Indian Council of Social Science Research, New Delhi (Ministry of MHRD, Govt. of India) in social sector as  Co-Project Investigator.",
        "dynamic_sections": {
            "Research Publication": "Das T.R.; Kumar A.; Satpathy I.; Tripathy A., Maximizing profitability and freshness: Chemical treatment techniques for live fish transportation in Odisha, 2024, Journal of Medicinal and Pharmaceutical Chemistry Research, 6, 2, 10.48309/jmpcr.2024.183815\nJha R.S.; Sahoo P.R.; Tripathy A., COVID-19 Triggers a Paradigm Shift in Technology for Insurance Industry, 2023, Smart Innovation, Systems and Technologies, 311, 10.1007/978-981-19-3571-8_74\nHota J.; Tripathy A.; Deb M., Challenges of the Fast Food Industry in India : An Integrated ISM-MICMAC Approach, 2023, Indian Journal of Marketing, 53, 9, 10.17010/ijom/2023/v53/i9/173142\nRout K.; Sahoo P.R.; Bhuyan A.; Tripathy A.; Smrutirekha, Online grocery shopping behavior during COVID-19 pandemic: An interdisciplinary explanation, 2022, Cogent Business and Management, 9, 1, 10.1080/23311975.2022.2084969\nKar B.; Tripathy A.; Pathak M.D., What Causes Product Returns in Online Purchases? A Review and Research Agenda, 2022, Prabandhan: Indian Journal of Management, 15, 4, 10.17010/pijom/2022/v15i4/162837\nBhuwandeep; Tripathy A., A Study of Online Shopping Behaviour by Consumers During COVID-19 Pandemic, 2022, Springer Proceedings in Business and Economics, 10.1007/978-981-19-0357-1_13"
        }
    },
    {
        "name": "Jyotiranjan Hota",
        "role": "Associate Professor",
        "email": "jrhota@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/jyotiranjan-hota/",
        "bio": "Dr. Hota has around 18 years of experience in teaching and research. His teaching interests include Analytics, Machine Learning, Data Mining, Visual Analytics, SAP functional Modules, R and Python. His PhD thesis is based on Adoption of Multivendor ATM technology in India. His thesis identifies the issues pertaining to the adoption of this technology from customer, supplier and banker’s perspective. In his study, he has developed and validated several qualitative and quantitative models on drivers and barriers of Multivendor ATM technology adoption. His research interest lies in linking Information Technology with all the functional areas of management. Dr. Hota is an AIMA accredited Management teacher in IT Area. His research work has been published inInternational Journal of BankMarketing(Emerald Publishing, UK),Asia Pacific Journal of InformationSystems (KMIS, South Korea), The IUP Journal ofApplied Economics, AIMS International Journal of Management, IUPJournal of Information Technology,Vision: The Journal of Business Perspective (Sage Publication),Palgrave Macmillan,Computer Society of India, Springer Natureand many leading, refereed national and international journals. He has served as program committee member, advisory board member, scientific committee member, technical committee member, academic committee member, track chair and session chair of international conferences in India and abroad. Dr. Hota is the recipient ofICBM-AMP Academic Excellence Awards 2018in the category of ‘Best Professor in IT and Operations’ held at Hyderabad, India.",
        "dynamic_sections": {
            "Research Publication": "Hota, , & Mishra, S. (2018). Development and validation of a multivendor ATM adoption model in India. International Journal of Bank Marketing, 36(5), 884-907. [ABDC A Category, Scopus and WoS, Impact Factor- 6.3, CiteScore 9.1\nHota , Nasim S. (2020). Validation and Modelling of Drivers and Barriers for Multivendor ATM Technology in India from the Perspectives of Banks. In:  Rajagopal, B eh 1 R. (Eds), and Market Ecosystems.Palgrave Macmillan, Cham[Scopus]\nHota, J. (2021). Framework of Challenges Affecting Adoption of People Analytics in India Using ISM and MICMAC Analysis. Vision, 0(0). https://doi.org/10.1177/09722629211029007[ABDC C, ABS, Scopus and WoS, Impact Factor 2.8, Cite Score 3.0]\nHota, J., Alavi, S., & Panda, D. (2023). Modelling the challenges of online education in India due to COVID-19 pandemic: an ISM-MICMAC approach.International Journal of Management in Education,17(5), 501-519. [Scopus , CiteScore 1.5]\nHota, J., Tripathy, A., & Deb, M. (2023). Challenges of the Fast Food Industry in India: An Integrated ISM-MICMAC Approach.Indian Journal of Marketing,53(9), 62-78. [Scopus , ABDC C, CiteScore 2.1]\nHota, , Das, C., & Jena, M. K. (2021). Modelling the Barriers of Algorithmic Trading in India Using ISM and MICMAC Analysis. IUP Journal of Applied Economics, 20(1), 7-28.[ABDC C]\nHota, J., & Verma, V. K. (2022, December). Challenges to Adoption of Digital Agriculture in India. In2022 International Conference on Maintenance and Intelligent Asset Management (ICMIAM)(pp. 1-6).IEEE. [Scopus]\nHota, J., & Nasim, S. (2020). Validation and Modelling of Multivendor ATMs from suppliers’ Asia Pacific Journal of Information Systems, 30(2), 374- 396.[ABDC C and Scopus, CiteScore 0.7]",
            "Book Publication": "1. Hota, J. (2025). Data Mining and Business Intelligence: Data-driven strategy for business transformation (English Edition). BPB Publications.\nAbout the Textbook:About the Textbook:  Data mining powers modern business intelligence by transforming complex datasets into actionable insights that drive smarter decisions, operational efficiency and strategic growth. This book begins with the critical step of data preprocessing, guiding readers through techniques such as data cleaning, integration, transformation and reduction to ensure high-quality inputs for analysis. It then introduces core data mining methods like regression, classification, clustering and association rules followed by foundational business intelligence concepts including data warehousing, ETL processes and dashboard creation and data modelling using Power BI. The textbook also delves into advanced topics such as text mining and big data analytics while offering a critical discussion on ethical data practices. The final chapter emphasizes the importance of data governance, ethical frameworks and responsible data management, preparing readers to lead with integrity in a world increasingly shaped by artificial intelligence and data-driven decision making."
        }
    },
    {
        "name": "Mohar Banerjee Biswas",
        "role": "Assistant Professor",
        "email": "mohar.biswas@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/mohar-banerjee-biswas/",
        "bio": "",
        "dynamic_sections": {}
    },
    {
        "name": "Deepak Kumar Sahu",
        "role": "Assistant Professor",
        "email": "deepak.sahu@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/deepak-kumar-sahu/",
        "bio": "Prof. Deepak Kumar Sahu is the alumni of IIM-Mumbai (Formerly NITIE, Mumbai) from their flagship course PGDIE in Operations & Supply Chain Management. He has also completed his Bachelor of Technology from NIT, Calicut. With more than 11 years of industry experience in conglomerates like TATA Group, RPG Group, Marico Limited & Goat Brand Labs, Prof. Sahu has handled numerous mid and senior level positions in Supply Chain, Projects & Retail vertical. Due to his deep passion for academic research, he is also pursuing PhD in Operation Management domain from IIM, Sambalpur.",
        "dynamic_sections": {}
    },
    {
        "name": "Razique Anwar",
        "role": "Assistant Professor",
        "email": "razique.anwar@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/razique-anwar/",
        "bio": "Dr. Razique Anwar is a dedicated academic with a Ph.D. in Management, with specialization in Economics from the Indian Institute of Management (IIM) Kashipur. He holds double masters with MBA from KIIT School of Management, and MA in Economics from IGNOU Delhi. Additionally, he qualified UGC NET JRF in Management in 2017, and UGC NET in Economics in 2022. Dr. Anwar has a proven track record as a lecturer, having taught postgraduate and undergraduate courses in Macroeconomics and Managerial Economics at Jamshedpur Workers’ College, Kolhan University. He has published several research papers in ABDC indexed journals, like the Indian Economic Journal and the Review of development Economics. Dr. Anwar is also an accomplished conference presenter, having participated in international events such as the Warsaw International Economic Meeting 2023 at the University of Warsaw, Poland and the Global Conference on Research in Social Sciences 2024 at the University of Liverpool, United Kingdom. He possesses strong technical skills in econometric analysis and is proficient in software tools such as STATA, and LaTeX. In addition to his academic pursuits, Dr. Anwar is committed to mentoring students and fostering a collaborative learning environment. He is passionate about contributing to the development of economic policies that address contemporary challenges in India.",
        "dynamic_sections": {
            "Research Publication": "Anwar, R. and Guha, A. (2025), Does Monetary Policy Affect Urban Food Inflation? Some Evidence From India. Rev Dev Econ. https://doi.org/10.1111/rode.13225 (ABDC B, ABS 2)\nAnwar, R. and Guha, A. (2025), Does Monetary Policy Affect Urban Food Inflation? Some Evidence From India. Rev Dev Econ. https://doi.org/10.1111/rode.13225 (ABDC B, ABS 2)\nAnwar, R., & Guha, A. (2023). A Study on Dynamics of Food Inflation in India. The Indian Economic Journal, 71(5), 783-804. https://doi.org/10.1177/00194662231186555 (ABDC-B)\nAnwar, R., & Guha, A. (2023). A Study on Dynamics of Food Inflation in India. The Indian Economic Journal, 71(5), 783-804. https://doi.org/10.1177/00194662231186555 (ABDC-B)\nAnwar, R., & Kumar, S. (2022). DETERMINANTS OF DIVIDEND POLICY: AN EMPIRICAL INVESTIGATION OF INDIAN COMPANIES USING PANEL DATA ESTIMATION TECHNIQUE. Indian Journal of Finance and Banking, 10(1),54-60. https://doi.org/10.46281/ijfb.v10i1.1777\nAnwar, R., & Kumar, S. (2022). DETERMINANTS OF DIVIDEND POLICY: AN EMPIRICAL INVESTIGATION OF INDIAN COMPANIES USING PANEL DATA ESTIMATION TECHNIQUE. Indian Journal of Finance and Banking, 10(1),54-60. https://doi.org/10.46281/ijfb.v10i1.1777\nRazique Anwar and Sandeep Kumar, Macroeconomic Challenges in India and Response of Policymakers & Alternatives in the Context of COVID-19 Crisis. 2023; 8(01), 38-53. DOI: 10.52184/isbrmj.v8i01.000\nRazique Anwar and Sandeep Kumar, Macroeconomic Challenges in India and Response of Policymakers & Alternatives in the Context of COVID-19 Crisis. 2023; 8(01), 38-53. DOI: 10.52184/isbrmj.v8i01.000"
        }
    },
    {
        "name": "Sugato Tripathy",
        "role": "Joint Director, KIIT Digital",
        "email": "sugatotripathy@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/sugato-tripathy/",
        "bio": "Awarded the best faculty of KSOM by KIIT University for 2019, he has 15 years of experience with 5 years in corporate and 11 years in academics. His corporate stint was with HDFC Bank – Credit Cards, where he was in charge of product and portfolio management. His expertise lies in new product development, branding, strategic alliance, merchant acquiring, revenue generation & cost control, channel management, team building, service delivery, catalogue marketing and statutory compliance. During his stint with HDFC Bank, he was instrumental in forging several national and key regional merchant tie-ups across the categories of electronics, telecom, travel, jewellery and personal care. He has also won the Master Card Hall of Fame Award for handling a joint Pan India program, which was judged as the best usage program by any bank in Asia. Apart from his teaching assignments, he is currently the Joint Director, KIIT Digital, KIIT DU.",
        "dynamic_sections": {
            "Research Publication": "Pati, S. S., Dhal, S., Pattnaik, R., Tripathy, S., & Kumar, S. (2025). mRNA Vaccines in Cancer Immunotherapy: Recent Advances, Clinical Translation, and Future Perspectives. Current medical science, 10.1007/s11596-025-00112-5. Advance online publication.https://doi.org/10.1007/s11596-025-00112-5\nKumar S, Pattnaik R, Mathapati B, Ghosh R, Tripathy S (2025) Global concerns on the recent resurgence of influenza A variant viral infection in humans. J Infect Dev Ctries 19:797–799. doi: 10.3855/jidc.20750\nKumar, Subrat; Pattnaik, Ritesh; Tripathy, Sugato; Mathapati, Basavaraj, (2025) – Resurgence of human mpox: Strategies to mitigate an ignored public health risk. DOI: 10.4103/apjtm.apjtm_528_24\nKar B., & Tripathy S. (2020). Aquaculture Industry in Odisha: A Review . Space and Culture, India, 8(2), 183-193. (Scopus Indexed)https://doi.org/10.20896/saci.v8i2.690\nKar B, Tripathy S, (2020), Jagruti: Suvendu Sekhar Mahapatra, Electronics and Telecommunication  to Solid Waste Management, AMC Indian Journal of Entrepreneurship,Vol.3, Issue 2-3, April – September, 2020\nKar B, Tripathy S, (2020), Gen-Next Entrepreneur : Passion, Efficacy, Intention, and the Role of Family, AMC Indian Journal of Entrepreneurship, DOI:10.17010/amcije/2020/v3i4/155755"
        }
    },
    {
        "name": "Shatabdi Mishra",
        "role": "Faculty Associate",
        "email": "shatabdi.mishrafls@kiit.ac.in",
        "profile_url": "https://ksom.ac.in/staff/shatabdi-mishra/",
        "bio": "Ms. Shatabdi Mishra is a Faculty Associate in English and is currently pursuing her doctoral research in English at the Department of Humanities, School of Liberal Studies, Kalinga Institute of Industrial Technology Deemed to be University, Bhubaneswar, Odisha. She is primarily involved in teaching Business Communication and Literature to the students of BBA program. Before joining KSOM, she worked as a Visiting Faculty in the School of Economics and Commerce, KIIT DU. Her research interests focus on film studies, literary theories, popular culture, quantum fiction, speculative fiction, and gender studies. She has presented and participated in different international and national conferences and has been a recipient of the Chancellor’s Gold Medal during her Masters in English at KIIT University.",
        "dynamic_sections": {}
    },
    {
        "name": "PIYUSA P DAS",
        "role": "Associate Professor",
        "email": "piyusa.das@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/piyusa-p-das/",
        "bio": "He has overall 10 years of experience in Global Program Management, Strategic Marketing & Research, Business Development and Project Procurement. Prior to MBA, he has worked in Hindustan Petroleum as a Purchase Officer for approximately 5 years (Sep 2006- June 2011). Afterwards he has completed his PGDM (Marketing & Operations) from Indian Institute of Management, Lucknow in March 2013. Post-MBA, he joined Ingersoll Rand (May 2013- April 2018) in Strategic Marketing & Research role where he supported various technology business development initiatives from top management. Later on, as a program manager he led cross-functional team to execute several New Product Development (NPD) projects. He has Proven skills in end-to-end project management (requirement gathering to product launch), Voice of Customer research, Business case development, New Product Development (NPD) processes Some of his research interest areas are technology adoption/impact in marketing research and consumer behaviour, VoC for new product development etc ACADEMIC RESPONSIBILITIESTeach the following courses for MBA students   ",
        "dynamic_sections": {
            "Research Publication": "Bhuwandeep, Das P.P., “A Scale to measure behavioural change regarding sanitation post implementation of sanitation programs,” Proceedings of the World Conference on Smart Trends in Systems, Security and Sustainability, WS4 2020.\nBhuwandeep; Das, P.P., “Study on Knowledge, Attitude, and Practice (KAP) of sustainable consumption behaviour among college students."
        }
    },
    {
        "name": "Pallavi Mishra",
        "role": "Faculty Associate",
        "email": "pallavi.mishra@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/pallavi-mishra/",
        "bio": "Dr. Pallavi Mishra is a seasoned banking professional with overten years of diverse experienceacross bothprivate sector and public sector banks. Her career has been marked by a deep commitment to customer satisfaction, operational excellence, and strategic marketing in the financial services sector. She earned herDoctorate in Marketing from KIIT University, where her research focused on contemporary challenges and innovations in the fields ofmarketing, banking, and the retailing industry. Her academic insights have significantly complemented her practical expertise, allowing her to bridge theoretical knowledge with real-world applications effectively. In2024, she washonored as the Best Employee in Customer RetentionbyPunjab National Bank, a testament to her outstanding contribution in strengthening client relationships and enhancing customer loyalty through innovative engagement strategies. Dr. Mishra’s areas of research and professional interest include: With her strong academic background and practical exposure, Dr. Pallavi Mishra continues to contribute meaningfully to the evolving landscape of financial services and marketing.",
        "dynamic_sections": {
            "Research Publication": "Pallavi Mishra, Abhishek Kumar (2024) Adoption of AI technologies in hospitals: Effects on consumer behaviour and health outcomes. Journal of medicinal and Pharmaceautical chemistry research[ Scopus Indexed ], DOI: 10.48309/JMPCR.2025.474077.1396,September 2024.\nPallavi Mishra & Dr. Abhishek Kumar(2024) THE INTERSECTION OF TECHNOLOGY AND SUSTAINABILITY: SMART SOLUTIONS TO INDIA’S ENVIRONMENTAL ISSUE.[UGC CARE LISTED AND ABDC LISTED]. The Indian Economic Journal Special issue pp 101-116,Dec 2024.\nDevi Prasad Dash, Abhishek Kumar, Santosh Pani, Ipseeta Satpathy, BCM Patnaik, Pallavi Mishra (2024) Role of Artificial Intelligence in Enhancing Personalized Customer Experience[Listed in ABDC]\nAbhishek kumar, Biswajit Swain, Ipsheeta Satpathy, B.C.M Pattnaik, Pallavi Mishra(2019), An Analysisof Non-Performing Assests in Banking Sector. The Indian Economic Journal [Listed in ABDC], Special issue,pp 86-94, ISSN 0019- 4662,Dec 2019.",
            "Book Publication": "Globalization and farm goods availability towards a free market trade- A perspective on select Agri-commodity. Economic Growth In India,1stEdition,pp 1-10. ISBN 978-93-88147-29-3, Jan 2020. SAGE PUBLICATIONS."
        }
    },
    {
        "name": "Arnav Pati",
        "role": "Assistant Professor",
        "email": "arnav.pati@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/arnav-pati/",
        "bio": "Prof. Arnav Pati is an Assistant Professor of Marketing at KIIT School of Management (KSoM). He is a Fellow Program in Management (PhD) specialising in the Marketing area from the Xavier School of Management, XLRI – Jamshedpur, where he researched brand logo design strategies. His academic credentials also include a Master’s degree in Analytical and Applied Economics from Utkal University and a Bachelor’s degree in Economics from BJB Autonomous College, Odisha. Prof. Pati has a strong background in brand strategy and marketing innovation. As the founder of Marcuscope, a branding agency, he has played a pivotal role in shaping over 220 brands across diverse industries, including software and aviation. His expertise spans brand identity design, digital marketing, and content management, making him a sought-after consultant in the field. At KSoM, Prof. Pati teaches Marketing Management and Business Research Methods. His research interests focus on brand design, responsible marketing, and consumer psychology, with an emphasis on how visual identity systems influence consumer decision-making. He is committed to advancing marketing scholarship while bridging the gap between research and practice. In addition to his academic and professional endeavours, he is passionate about music production, photography, and animal welfare.",
        "dynamic_sections": {}
    },
    {
        "name": "Malabika Sahoo",
        "role": "Assistant Professor",
        "email": "malabika.sahoo@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/malabika-sahoo/",
        "bio": "Malabika Sahoo belongs to HR and OB area. She has 9 years of  experience in teaching  and research, and 14 years in corporate training and consulting. She has done Ph D in Management. Dr. Sahoo has attended Executive Certification programme in HR Analytics from IIM Rohtak. Prior to joining KIIT Deemed to be University, she worked as a corporate trainer and consultant. She has conducted nearly 2,500 training programmes and motivational talks in around 100 organisations across the country such as NTPC, NALCO, Aditya Birla, Coca-Cola, TSIL, TRL, Aditya Aluminium, JSPL, Vodafone, L & T, Paradeep port Trust, PPL, ONGC, IFFCO, IOCL, BRPL, BPCL, OHPC, OPTCL, and LG Electronics Pvt. Ltd etc.  She also taught as a Visiting faculty at Birla Global University and KIIT School of Rural Management.  Dr. Sahoo has five publications in journals listed in ABDC.  She has also authored three book chapters (Scopus and Web of science) published by Emerald and Springer Publications  and a book on Research Methodology by Taxmann Publications. She has presented more than 15 research papers at various national and international conferences of repute such IIM Vizag, IIM Kozhikode, IIM Sambalpur, IIM Jammu etc. She has organised and facilitated FDP on Advanced Research Methodology and Data analysis, and Workshop on Structural Equation Modelling. She is passionate about facilitating workshops/FDPS on Research methodology, Structural Equation Modelling using AMOS, SMART PLS, Data Analysis through SPSS and  R, etc.  Her teaching interest includes Human resource management, Training and development, Business Research methodology, HR analytics and Data analysis.",
        "dynamic_sections": {
            "Research Publication": "N, Mishra, S. & Sahoo, M.(2023). Perceived Support and Employee Creativity: A Moderated Mediation Model of Intrinsic Motivation and Gender Stereotype,Management & Labour Studies,48(4) 497–513, 2023, DOI: 10.1177/0258042X231160971 (Scopus, ABS-1, ABDC-C),Sage Publications.\nSahoo, M., & Mishra, S. (2022). Organizational Influences on the Motivation to Transfer Soft Skill Training in an Indian Power organization”, (Scopus, ABS-1, ABDC-C), by Sage Publications.\nMishra, S. & Sahoo, M (2022). Motivation to transfer soft skill training: A systematic Literature review, (Web of Science,Scopus, ABS-1, ABDC-C), Emerald Publishing.\nSahoo, M., & Mishra, S. (2019). Effects of trainee characteristics, training attitudes and training need analysis on motivation to transfer training. Management Research Review. (Web of Science,Scopus, ABS-1, ABDC-C), Emerald Publishing\nSahoo, M., Mishra, S., & Mishra, S. (2018). Influence of Group Composition on Participant Reactions to Training: A Study in an Indian Power Transmission Organization. Management and Labour Studies, (Scopus, ABS-1, ABDC-C), Sage publications.\nSahoo, M., & Mishra, S. (2017). Training evaluation and motivation to transfer training-A review of literature. Parikalpana: KIIT Journal of Management.\nDas, H. P., & Sahoo, M. M. (2015). Talent search: A challenge for employers. Parikalpana.",
            "Book Publication": "Book Chapters\nSahoo, M. (2020). Structural Equation Modeling: Threshold Criteria for Assessing Model Fit. In Methodological Issues in Management Research: Advances, Challenges, and the Way Ahead. Emerald Publishing, (Web of Science and Scopus).\nM (2023). Role of Human Resource Management Practices and HR Analytics in Start-Ups. InGlobal Trends in Technology Startup Project Development and Management: From Innovation to Startup Creation(pp. 109-118). Springer International Publishing(Scopus).\nM & Mishra, S. (2023).A Bibliometric Analysis of Artificial Intelligence and Human Resource Management, International Conference on ICT for Sustainable Development, Springer International Publishing (Scopus).\nBook\nResearch Methodology, Taxmann Publications, 1stEdition, 2024"
        }
    },
    {
        "name": "Brajaballav Kar",
        "role": "Associate Professor",
        "email": "braja.kar@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/brajaballav-kar/",
        "bio": "Prof. B Kar has earned his Ph D at the school with Entrepreneurship as the area of specialization. He has over 15 years of rich experience in organizations like SAIL, Sonata Software Ltd, Oracle India, Quark India, Four-Soft and Karak technologies. He has been working on technologies such as ERP, CRM, SCM and has experience working with different ERP systems like Oracle Apps, MFG-Pro and SCALA. He also has dealt with business functions like Purchase, Sales, Warehousing & Inventory management, Supply Chain, Forecasting, Production Planning & Execution, MRP, and Accounting. His papers have been published in many different National and International journals.",
        "dynamic_sections": {
            "Book Publication": "Entrepreneurship Processes, Disha International Publishing House.\nThis book, an outcome of a major research project, documents a microscopic examination on entrepreneurship in Odisha",
            "Research Publication": "Jena, Manoj Kumar; Kar, Brajaballav, “Stages and Methods for Cleaning Large Secondary Data Using R,” METHODOLOGICAL ISSUES IN MANAGEMENT RESEARCH: ADVANCES, CHALLENGES, AND THE WAY AHEAD.\nKar, Brajaballav; Ahmed, Yimer Ayalew, “Trailblazing in Entrepreneurship: Creating New Paths for Understanding the Field,” JOURNAL OF ENTREPRENEURSHIP.\nKar, Brajaballav; Subudhi, Rabi N.; Padhy, Ramakrishna, “Impact of Self-Efficacy and Contextual Variables on Entrepreneurial Intention,” PERTANIKA JOURNAL OF SOCIAL SCIENCE AND HUMANITIES.\nKar, N.; Kar, B.; Kar, S., “Stress and coping during COVID-19 pandemic: Result of an online survey,” Psychiatry Research.\nAhmed, Y.A.; Kar, B., “Influence of demographic factors on business performance in Ethiopia,” International Journal of Innovative Technology and Exploring Engineering.\nKar, B.; Jena, M.K., “Performance and age of companies listed on the Bombay stock exchange,” Indian Journal of Finance.\nAhmed, Y.A.; Kar, B., “Gender differences of entrepreneurial challenges in Ethiopia,” Academy of Entrepreneurship Journal.\nAhmed, Y.A.; Melese, H.W.; Kar, B.; Ravi, J., “The effect of entrepreneurial orientation on perceived business success of small scale manufacturing in Ethiopia,” International Journal of Mechanical Engineering and Technology.\nSarangi, S.; Kar, B., “A comparative assessment of indicators for public sector general insurance companies: An Indian perspective,” Indian Journal of Finance.\nSahoo, A.K.; Kar, B.; Das, S., “Differentiated service is the success measure: an investigation in telecom industry Odisha, India,” Mediterranean Journal of Social Sciences.\nKar, N.; Kar, B., “Social Cognition and the Participatory Planning Process,” Systems Research and Behavioural Science."
        }
    },
    {
        "name": "Kumar Mohanty",
        "role": "Director - KSOM; Director - Industry Engagement, KIIT; Director - FDP, KIIT",
        "email": "director@ksom.ac.in, kumar@ksom.ac.in, m.kumar@kiit.ac.in",
        "profile_url": "https://ksom.ac.in/staff/kumar-mohanty/",
        "bio": "B.Tech with PGDM from Xavier Institute Of Management, Bhubhaneswar with more than 14 years of experience as a Marketing Manager with Nicco, then as Branch manager with Jenson and Nicholson and Finolex Cables as an AGM-Sales and as Business Head with IMS before joining KIIT in 2011. Prof. Kumar is also Director- Industry Engagement, KIIT. He has been getting all campuses to engage with industry in creating a value proposition through co branding existing courses ; curriculum development; research labs ; centre of excellence and joint certifications. He also serves as Director – Faculty Development, KIIT. where he designs a calendar of activities through training of faculty on niche and contemporary segments by industry.",
        "dynamic_sections": {
            "Research Publication": "1. Kumar, M.; Kumar, P.J.; Biswajit, D., “Co-creation with customers in product development and services: An empirical analysis for competitive advantage,” Journal of Advanced Research in Dynamical and Control Systems."
        }
    },
    {
        "name": "P.R. Sahoo",
        "role": "Associate Professor",
        "email": "prsahoo@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/p-r-sahoo/",
        "bio": "Area Chair – Marketing Dr. Priti Ranjan Sahoo is an Associate Professor at the KIIT School of Management, KIIT University. Prof. Sahoo has more than 30 years of experience in both industry and academics. He served in various Managerial positions with Indian Tourism Development Corporation (ITDC) from 1994 to 2003. He taught at Birla Institute of Technology, Mesra, Ranchi, from 2003 to 2009 as a Reader before joining KIIT University in 2009. He received the Ph.D. for his doctoral research on the theme “An Analytical Study on the Perception for the Application of Electronic Distribution Systems.” He holds double master’s degrees in MBA & MTA and is an FDPM alumnus of IIM Ahmedabad. He has Eight Patents to his credit (Five Indian, Two Australian, and one German). He is a Visiting Professor at Sinop University, Turkey. He has served on the editorial board of many reputed national and international journals. Currently, he is the Editor-in-Chief of “Indian Journal of Hospitality Management” having ISSN: 2582 4082, the official journal of IHM, Ahmedabad. Three of his research scholars have completed their Ph.D. under his guidance, and currently, six scholars are working on their Ph.D. degrees under his guidance. He has been a thesis examiner and external examiner of Ph.D. candidates at several Universities. He has published several research papers indexed in Scopus, ABDC, and UGC-approved journals. He acts as a reviewer of Research Journals of International repute. He is an active member of many professional and academic bodies. He has provided consultancy services to many leading Service Industries in the country. He has successfully completed three research consultancy projects independently. Presently he is working on two live research projects sponsored by IIM Ahmedabad and the Indian Council of Social Science Research. Prof. Sahoo has been invited to deliver Keynote Address and Session Chair for several Conferences. He has conducted five training programmes for Govt./Corporate Sector agencies. He has been a resource person for several Faculty Development Programmes/ MDP/ Workshops/Conferences/ Seminars. His teaching and research interests include Strategic Management, Information Technology, Business Policy, International Business, Services Marketing, Tourism & Hospitality, Entrepreneurship, and E-Commerce. ORCiD ID:https://orcid.org/0000-0001-9400-0981 Web of Science Researcher ID:M-5520-2017 Scopus ID: 57194700204 Google Scholar: TyAESA8AAAAJ",
        "dynamic_sections": {
            "Research Publication": "Mohanty, S.; Das, B.; Panda, P.C.; Sahoo, P.R.; Panigrahi, J.K., “Study of factors that influence retailers in product assortment as per the customers preference of products, leading to improved retailer performance for customer satisfaction and retention,” Journal of Advanced Research in Dynamical and Control Systems.\nMohanty, S.; Das, B.; Panda, P.C.; Sahoo, P.R.; Panigrahi, J.K., “Technological and organisational dynamics influencing e-marketing, an empirical analysis of preference patterns of consumers acceptance for online retail (E-tailers),” Journal of Advanced Research in Dynamical and Control Systems.\nSahoo, P.R.; Lenka, S.K.; Pradhan, B.B., “Transactional and psychological concerns of all parties involved in opaque hotel room distribution,” International Journal of Economic Research.\nSahoo, P.R.; Pradhan, B.B.; Lenka, S.K.; Patra, S.K., “Review research on application of information and communication technology in tourism and hospitality industry,” International Journal of Applied Business and Economic Research."
        }
    },
    {
        "name": "Debi Prasad Das",
        "role": "Associate Professor",
        "email": "debiprasad.das@ksom.ac.in",
        "profile_url": "https://ksom.ac.in/staff/debi-prasad-das/",
        "bio": "Professor Debi Das has earned his Ph D in the area of Human Resource and Organizational Behavior from KIIT School of Management.His research topic is centered around ‘Employee Turnover and its Effect on Organization’. He has eight years of experience in Tata group companies which includes International logistics, Roots Corporation Limited a 100% subsidiary of Taj Group and Tata Steel Ferro alloys mineral division. His job profile was to Facilitating and to maintain harmonious industrial relations, inculcating a culture of discipline between employee and management, union-management relationship through joint consultations and bipartite and tripartite mechanism and part of class training on personality development and business etiquettes. He has 15 years of total experience (6 YRS Corporate experience and 9 years in academics). He has established & executed location level IR/ER priorities in consultation with Site Leader & Labour Relations Technology. Ensuring effective implementation of attendance, leave management & payroll process. He has managed Contract Labour Strategy: Identification of Correct Contractors, Compliance of the provisions of the law. Ensure processing of Contract bill processing promptly. Develop & Implement Strategy to deal with Union(s). Should have fair, firm & factual relationship with Union leaders. To assist Site Leader & Labor Relation Technology w.r.t Collective Bargaining & Long Term Wage Settlement process. He has been the Custodian of Labour law statutory compliances. Identify & prioritize statutory compliance issues to be addressed & develop a plan to address and implement the plan. He has strengthened the processes & systems to ensure 100% compliance to all statutory compliances at the plants. Monitor & ensure 100% compliance to all statutory compliances at the plants He has also partnered with Site Leader & Supervisors for Implementing Labour Productivity Improvement Initiatives He has handled Disciplinary action process in the matters like unauthorized absenteeism, negligence, insubordination, idling & wasting the time, stoppage of work, by way of verbal counselling, written counselling, cautioning, warning, suspension & termination. Handle Domestic Enquiry process Also, he has attended Legal & Court Matters (Civil/Labour/Industrial/High Court) & appearance before conciliation authorities pertain to organization. Co-coordinating with company Advocate(s) in terms of any court matter(s) & document submission. Should be able to handle situations like Strike, lockout, layoffs etc Subjects Expertise:-",
        "dynamic_sections": {
            "Research Publication": "Paper title:- “Organizational Behavior and performance of employees with PTSD and its effect on employee turnover”  was published in the International Journal of Management (IJM).\nPaper Title:- Impact of values, personality and Managerial style on organizational citizenship behaviour and turnover behaviour” was published in the International Review of social science and Humanities\nMultiple authors; Satpathy, Jyoti; Mishra, Isa; Padhi, Shradha; Das, Debi P.; “Noetic Alleyways: Choosing to Choose or Deciding to Decide”; Strad Research Journal\nSatpathy, Jyoti; Mishra, Isa; Padhi, Shradha; Das, Debi P.; “Insightful Entrepreneurial Behaviour Deportment”; PalArch’s Journal of Archaeology of Egypt / Egyptology\nSatpathy, Jyoti; Mishra, Isa; Laza, Sebastian; Padhi, Shradha; Das, Debi P.; “Perceptive- Entrepreneurial Decision Comportment”; Journal of Social Sciences."
        }
    }
]