[
    {
        "profile_url": "https://faculty.kiit.ac.in/abhilas-swain/",
        "name": "Dr. Abhilas Swain",
        "role": "Assistant Professor",
        "bio": "Bachelor in Technology in Mechanical Engineering from VSSUT, Sambalpur , 2007 Ph.D. in Thermal Engineering from IIT Bhubaneswar, Year 2017 Worked as Executive-Manufacturing, Larsen and Toubro Ltd., July 2007- Aug 2010",
        "email": "abhilas.swainfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/abhilas.swain.7",
            "https://in.linkedin.com/in/dr-abhilas-swain-38350232"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55932929500",
            "Google Scholar": "https://scholar.google.com/citations?user=Nxwnef4AAAAJ&hl=en&oi=ao",
            "ORCID": "https://orcid.org/0000-0002-2615-0694"
        },
        "sidebar_details": {
            "Email": "abhilas.swainfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55932929500",
            "Google Scholar": "https://scholar.google.com/citations?user=Nxwnef4AAAAJ&hl=en&oi=ao",
            "ORCID": "https://orcid.org/0000-0002-2615-0694"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D. in Mechanical Engineering (Thermal) from IIT BHubaneswar"
            ],
            "COURSE EXPERTISE": [
                "Thermal Engineering"
            ],
            "RESEARCH INTERESTS": [
                "Heat Transfer , Boiling Heat Transfer, Refrigeration and Air-conditioning"
            ],
            "Administrative Responsibilities": [
                "FIC, RAC Lab, Coordinator-Industry Visit and Internship,"
            ],
            "Outreach Activity": [
                "ISHRAE Bhubaneswar Chapter – CWC Member, Program Chair"
            ],
            "Professional Membership": [
                "Affiliate Member-ISHRAE, Individual Member-IGBC, IET"
            ],
            "Projects & Consultancies": [
                "DST-SERB Sponsored Project “Two Phase Heat Transfer over Metal Foam ”"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/akshaya-kumar-rout/",
        "name": "Dr. Akshaya Kumar Rout",
        "role": "Associate Professor-II",
        "bio": "Dr. Akshaya Kumar Rout (F-119513-8), a graduate in Mechanical Engineer from the Institution of Engineers, India, in 1991, M. Tech in 2004, IIT-Roorkee and Ph.D, NIT-Rourkela, in 2011, Currently working as Associate Professor in the School of Mechanical Engineering from 2010 to till date, KIIT Deemed to be University, Bhubaneswar till date. Guided 15 M. Tech students and 05 Ph.D students. Also published 40 National/International journals and 60 National/International conference papers, five projects and attended 40 short term courses. Received 10 professional bodies membership viz. IE(FELLOW) and Also Chartered Engineer, (SESI-INDIA), (ASME-USA), (IAENG- LONDON), ISCA-INDIA. Visited China in 2008, Italy in 2011 and Tokyo(Japan) in 2016, to attend an International conference.",
        "email": "akroutfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/akshayakumar.rout.731"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=36245544200",
            "Google Scholar": null,
            "ORCID": "https://orcid.org/0000-0002-9227-7634"
        },
        "sidebar_details": {
            "Email": "akroutfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=36245544200",
            "Google Scholar": null,
            "ORCID": "https://orcid.org/0000-0002-9227-7634"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "B.E (Equivalent), M. Tech (IIT_Roorkee), Ph.d (NIT-RKL)"
            ],
            "COURSE EXPERTISE": [
                "Thermal Engineering"
            ],
            "RESEARCH INTERESTS": [
                "Thermal Engineering"
            ],
            "Administrative Responsibilities": [
                "FIC (B. Tech Project) & FIC (EAC)"
            ],
            "Awards and Achievements": [
                "8 Different Awards in different area of Research"
            ],
            "Outreach Activity": [
                "As a Convener to conduct 5 All India National Seminar"
            ],
            "Professional Membership": [
                "Member of 07 Professional Bodies (Viz. ASME, IE(INDIA, IAENG (LONDON), ISTE (ND)"
            ],
            "Projects & Consultancies": [
                "Completed nearly 10 small projects (VIz: IE(INDIA), DST (NIMAT), AICTE)"
            ],
            "Patents and Innovations": [
                "01 Patents"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/ambesh-kumar/",
        "name": "Dr. Ambesh Kumar",
        "role": "Assistant Professor (II)",
        "bio": "Ambesh Kumar is working as Assistant Professor in KIIT, Bhubaneswar since Dec. 2017. He graduated in Mechanical Engineering in the year 2010 from WBUT, Kolkata. Subsequently he pursued M Tech degree in 2012 from NIT, Durgapur. After that he obtained his PhD degree from IIT Guwahati in Machine Design specialization. His research area includes Structural Vibration Control, Composite materials, Finite element analysis , etc. He has several SCI international journal papers against his name.",
        "email": "ambesh.kumarfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/ambesh.kumar.56232?mibextid=ZbWKwL",
            "https://x.com/Ambesh18859689"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57189059706",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=qhgGbAEAAAAJ&view_op=list_works",
            "ORCID": "https://orcid.org/0000-0003-3502-5155"
        },
        "sidebar_details": {
            "Email": "ambesh.kumarfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57189059706",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=qhgGbAEAAAAJ&view_op=list_works",
            "ORCID": "https://orcid.org/0000-0003-3502-5155"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D. – IIT Guwahati, 2018; M.Tech- NIT Durgapur-2012, B.Tech. – WBUT- 2010"
            ],
            "COURSE EXPERTISE": [
                "Machine Design, Mechanics, Micromehanics, Composites, FEM."
            ],
            "RESEARCH INTERESTS": [
                "Structural Vibration Control, Mechanics of Composites, Finite element analysis."
            ],
            "Administrative Responsibilities": [
                "FIC- SAP activities, Co- FIC- Design Research Lab, Co-FIC- ICT cell"
            ],
            "Awards and Achievements": [
                "Recipient of Institute Gold Medal in M. Tech. degree"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/amlana-panda/",
        "name": "Dr. Amlana Panda",
        "role": "Associate Professor and Assistant Registrar (R & D)",
        "bio": "Dr. Amlana Panda, Associate Professor at the School of Mechanical Engineering, KIIT University, holds a Ph.D. in Mechanical Engineering and has over 20 years of teaching and research experience. His expertise lies in Manufacturing, Metal Cutting, and Sustainable Machining. He has published 115 research papers, book chapters, and a textbook titled “Sustainable Hard Machining: Implementation and Assessment” (CRC Press, Taylor & Francis), with over 1300 citations and an H-index of 20. Dr. Panda’s research focuses on sustainable high-speed machining, lubrication techniques, and tool wear analysis. He has guided three Ph.D. and M.Tech. students and co-authored two textbooks. A lifetime ISTE member, he has reviewed over 575 papers for top journals and developed innovative hybrid metal matrix composite fabrication techniques integrating materials and manufacturing research.",
        "email": "amlana.pandafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/dr.amlanpanda",
            "https://www.linkedin.com/in/amlana-panda-ph-d-b411813b/",
            "https://www.instagram.com/dr.amlanpanda/",
            "https://x.com/dr_amlanpanda"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57155871800",
            "Google Scholar": "https://scholar.google.co.in/citations?user=p-FXI3YAAAAJ&hl=en&oi=ao",
            "ORCID": "https://orcid.org/0000-0002-9814-1906"
        },
        "sidebar_details": {
            "Email": "amlana.pandafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57155871800",
            "Google Scholar": "https://scholar.google.co.in/citations?user=p-FXI3YAAAAJ&hl=en&oi=ao",
            "ORCID": "https://orcid.org/0000-0002-9814-1906"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D. (Mechanical Engineering)"
            ],
            "COURSE EXPERTISE": [
                "Manufacturing Processes, Metal Cutting, Industrial Engineering and Operations Research, Engineering Metrology, Scientific and Technical Writing, Universal Human Values"
            ],
            "RESEARCH INTERESTS": [
                "Environmental benign machining, in particular, dry and minimal quantity lubrication, NanoMQL Turning/Milling, machinability, tool wear analysis, surface integrity Sustainable Machining of Difficult-to-Machine Materials Synthesis and Characterization of Metal Matrix Nano Composite Mechanical Testing, Nano/Composite Materials Machining of Hybrid nanocomposite composites"
            ],
            "Administrative Responsibilities": [
                "Assistant Registrar (R & D), Faculty-in-charge, Social Media;\nCo-Faculty-in-charge, Student Affairs"
            ],
            "Awards and Achievements": [
                "1BEST RESEARCHER AWARD, International Research Awards on ‘New Science Inventions (NESIN 2020)’ ceremony organized by ScienceFather.\nTop 100 Researchers’ with India Prime Researchers Award 2021 from FOXCLUES India"
            ],
            "Outreach Activity": [
                "Delivered expert talks on the topic “Machinability Analysis of Hard Turning in Various Cutting Environments” at a two-week Faculty Development Programme on Manufacturing Technology Research & Management (MTRM) being held from 2nd to 14th August 2021. (Online) Delivered an expert talk on “Machinability improvement towards Incoloy alloy and Hardened steel: An Industrial Significance in online FDP on “A New Era on Manufacturing challenges and opportunities” organized by Dept. of Mechanical Engg., D.Y.Patil College of Engg. and Technology (An Autonomous Institute), Kolhapur in association with ISTE, New Delhi from 25th July 2022 to 30th July 2022. (Online) International Advisory Committee member for International Conference on Applied Research and Engineering, CPUT Cape Town, South Africa"
            ],
            "Professional Membership": [
                "ISTE : Lifetime member\nInstitute of Scholars (InSc) :Lifetime member\nArt of Giving: Lifetime member"
            ],
            "Projects & Consultancies": [
                "Title: Development of novel Al7075/ferrochrome slag/graphene oxide hybrid nanocomposites using ultrasonic assisted stirring and squeeze casting process and its machinability studies under various sustainable machining environments Ref. No: CRG/2022/002399 Sanction Date: 30-01-2023 Duration: 3 Years Scheme & Sponsoring agency: Core Research Grant, Department of Science & Technology, Govt. of India. Sanction amount: 26 Lakh"
            ],
            "Patents and Innovations": [
                "Rasmi Ranjan Mishra, Amlana Panda, Ashok Kumar Sahoo, Ramanuj Kumar, Fabrication and process development of Hybrid Al356 metal matrix Composite using Zirconium Oxide and Graphene Oxide Nano Reinforcement, Published (2023)\nRabinarayan Bag, Amlana Panda, Ashok Kumar Sahoo, Ramanuj Kumar, Zinc Oxide based Nano fluid assisted dual jet MQL system during high-speed turning process of AISI 4340 hardened steel Published (2023)\nRajashree Mallick, Ramanuj Kumar, Amlana panda, Ashok Kumar Sahoo, Rojalin Sahu, Jaykishon Swain, Synthesis and application of ionic liquids as an additive of dual nozzle MQL lubricant in hard turning, Published (2023)\nRamanuj Kumar, Mohamed Akeel, Ashok Kumar Sahoo, Amlana Panda, Nitrogen gas and MQL coupled hybrid cooling system and process for turning super alloys Published (2023)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/anish-pandey/",
        "name": "Dr. Anish Pandey",
        "role": "ASSISTANT PROFESSOR-II",
        "bio": "Dr. Anish Pandey earned his Ph.D. in Robotics and Control (Mechanical Engineering – Design) from NIT Rourkela in 2016. His research focuses on bio-inspired optimization, fuzzy logic, neural networks, and evolutionary algorithms for robot motion and orientation control. With over eight years of post-Ph.D. teaching and research experience, he serves as Assistant Professor II (Level-11) at the School of Mechanical Engineering, KIIT Deemed to be University. Dr. Pandey has published 36 papers (21 SCI/SCIE and 15 Scopus/WoS), holds 17 granted and 33 filed patents, and has over 2,500 Google Scholar citations. He teaches Machine Design, Mechatronics, FEM, and AI-based manufacturing. His ongoing projects include autonomous cleaning, articulated, and humanoid robots, alongside a sponsored project from TIH IIT Guwahati and various consultancy assignments.",
        "email": "anish.pandeyfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/anish.pandey.961",
            "https://www.linkedin.com/in/dr-anish-pandey-3001b67a/",
            "https://www.instagram.com/dranishp/",
            "https://x.com/home?lang=en"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55787545000",
            "Google Scholar": "https://scholar.google.co.in/citations?user=JvPC0woAAAAJ&hl=en&oi=ao",
            "ORCID": "https://orcid.org/0000-0001-9089-3727"
        },
        "sidebar_details": {
            "Email": "anish.pandeyfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55787545000",
            "Google Scholar": "https://scholar.google.co.in/citations?user=JvPC0woAAAAJ&hl=en&oi=ao",
            "ORCID": "https://orcid.org/0000-0001-9089-3727"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD in Robotics and Control, M.E., B.E."
            ],
            "COURSE EXPERTISE": [
                "Robotics, ML, Industry 4.0, Mechatronics, Machine Design"
            ],
            "RESEARCH INTERESTS": [
                "Mobile Robot Navigation, AI, ML, Soft Computing Techniques, Optimization Algorithm, Service Robots, Humanoid Robots, Aerial Robots"
            ],
            "Administrative Responsibilities": [
                "Mechatronics Lab FIC of School of Mechanical Engineering at KIIT Deemed to be University, An Institute of Eminence, Bhubaneswar-751024, Odisha, India.\nAcademic coordinator of Mechatronics Engineering Branch, at KIIT Deemed to be University, An Institute of Eminence, Bhubaneswar-751024, Odisha, India."
            ],
            "Awards and Achievements": [
                "Received Certificate of Outstanding Contribution in Reviewing from ISA Transaction Elsevier in April 2017.\nReceived “Best Paper Award” from the publisher Defence Technology Journal (Q1, IF 5.1) in year 2023."
            ],
            "Professional Membership": [
                "Associate Editor in Journal of Field Robotics, Wiley, SCI, impact factor 4.2, Q1"
            ],
            "Projects & Consultancies": [
                "Ongoing Sponsored Projects: –",
                "Name of PI and Co-PI: Dr. Prakash Kumar Sahu and Dr. Anish Pandey, Title of the Sanctioned Project “Sustainable Underwater Robotics: Autonomous Marine Surveillance Powered by Hydrodynamic Energy Generation,” Total Grant Received: Rs. 1200000, Project Sanction No. TIH/TD/0122, Funding Agency: DST Sponsored, IIT Guwahati Technology Innovation and Development Foundation (TIH IIT Guwahati), Date of Commencement: 26-December-2023.\n Name of PI and Co-PI: Dr. Ashish Das and Dr. Anish Pandey, Title of the Sanctioned Project “Innovative Buoyancy Activation System for autonomous torpedo recovery: A sustainable approach to enhancing underwater ordnance retrieval,” Total Grant Received: Rs. 900000, Project Sanction No. TIH/TD/1007, Funding Agency: DST Sponsored, IIT Guwahati Technology Innovation and Development Foundation (TIH IIT Guwahati), Date of Commencement: 18-October-2024.\nName of PI and Co-PI: Dr. Pramod Malik, Dr. Anish Pandey and Dr. S.K. Dwivedy, Title of the Sanctioned Project “Autonomous Underwater decoy confusion and torpedo guidance system for enhanced naval warfare,” Total Grant Received: Rs. 700000, Project Sanction No. TIH/TD/1014, Funding Agency: DST Sponsored, IIT Guwahati Technology Innovation and Development Foundation (TIH IIT Guwahati), Date of Commencement: 18-October-2024.",
                "Consultancy Project Completed: –",
                "Name of PI: Dr. Anish Pandey, Title of the Received Project “Tracking of ‘C’ welding seam of LPG cylinder by applying the image/video processing based autonomous senor-actuator control technique,” Total Grant Received: Rs. 1,52,520, Funding Industry: Corrosion Protective Pvt. Ltd. (CPPL) Industry, Jagatpur, Cuttack-754021, Date of Commencement: 20-February-2021, Date of Completion: 21-October-2022."
            ],
            "Patents and Innovations": [
                "Patent Granted: –",
                "Automated Four-Wheeled Intelligent Stair Climbing Mobile Robot, Patent No.: 362822, Application No.: 201631009662, Name of Applicant: National Institute of Technology, Rourkela, Inventors Name: Dr. Dayal R. Parhi, Dr. Anish Pandey, Date of Filing: 21-March-2016, Publishing Date: 22-September-2017, Patent Grant Date: 24-March-2021.\nAutonomous Seam Welding Machine, Patent No.: 479841, Application No.: 202131042048, Name of Applicant: Dr. Anish Pandey, Dr. Ruby Mishra, and Mr. Surjeet Singh Gour, Inventors Name: Dr. Anish Pandey, Dr. Ruby Mishra, Mr. Surjeet Singh Gour, Mr. Kartik Kumar, Mr. Kshitij Anand, Mr. Abhishek Bhardwaj, Ms. Shikha Singh, Mr. Rohan Pal, Mr. Debashis Deb, Date of Filing: 17-September-2021, Publishing Date: 22-October-2021, Patent Grant Date: 11-December-2023.\nAutonomous Seam Welding Machine, Patent No.: 511317, Application No.: 202131027969, Name of Applicant: Dr. Anish Pandey, Dr. Ruby Mishra, Dr. Ashwani Kumar, Mr. Tarun Dhar Diwan, and Mr. Surjeet Singh Gour, Inventors Name: Dr. Anish Pandey, Mr. Tarun Dhar Diwan, Dr. Ashwani Kumar, Dr. Ruby Mishra, Mr. Surjeet Singh Gour, Ms. Shikha Singh, and Mr. Abhishek Kumar Kashyap, Date of Filing: 22-June-2021, Publishing Date: 16-July-2021, Patent Grant Date: 15-February-2024.\nObject Having Stair Climbing and Descending System, With A Suspension Mechanism, Patent No.: 526854, Application No.: 202031020037, Name of Applicant: KIIT University, Bhubaneswar, Inventors Name: Dr. Anish Pandey, Mr. Surjeet Singh Gour, Mr. Vikas Singh Panwar, Dr. Rajiva Lochan Mohanty, Dr. Ashok Kumar Sahoo, Dr. Ramanuj Kumar, Date of Filing: 12-May-2020, Publishing Date: 19-November-2021, Patent Grant Date: 15-March-2024.\nUnmanned Aerial Vehicle with Ground Traversing Capability, Patent No.: 522842, Application No.: 201931048949, Name of Applicant: KIIT University, Bhubaneswar, Inventors Name: Mr. Shrestha, Dr. Ramanuj Kumar, Dr. Anish Pandey, Mr. Pratik Shashwat, Mr. Abhijeet Mohan, Dr. Ashok Kumar Sahoo, Date of Filing: 28-November-2019, Publishing Date: 13-August-2021, Patent Grant Date: 11-March-2024.\nCeiling Fan Cleaner Brush (Application No.: 410013-001), Name of Applicant: Dr. Anish Pandey, Mr. Dilip Kumar Bagal, Dr. Ashwani Kumar, Mr. Surjeet Singh Gour, Mr. Harsh More, Date of Filing: 10-March-2024, Registration (Grant) of Design Patent Date: 02-May-2024.\nThermo-Mechanical Leaf Straightening Machine (Application No.: 410681-001), Name of Applicant: Dr. Anish Pandey, Ms. Shikha Singh, Dr. Rajiva Lochan Mohanty, Dr. Ruby Mishra, Date of Filing: 15-March-2024, Registration (Grant) of Design Patent Date: 10-May-2024.\nRoom Cooling Through Cone Wall Structure Design (Application No.: 411500-001), Name of Applicant: Dr. Anish Pandey, Dr. Prashant Kumar, Dr. Abhishek Sharma, Mr. Surjeet Singh Gour, Mr. Liyaqat Ali, Dr. Rajiva Lochan Mohanty, Date of Filing: 25-March-2024, Registration (Grant) of Design Patent Date: 10-May-2024.\nBelt Brush-Type Wet and Dry Surface Cleaning Robot with Hot Air Drier (Application No.: 412012-001), Name of Applicant: Dr. Anish Pandey, Dr. Harsh Kumar Pandey, Mr. Dilip Kumar Bagal, Mr. Surjeet Singh Gour, Mr. Harsh More, Date of Filing: 29-March-2024, Registration (Grant) of Design Patent Date: 17-May-2024.\n Mechanized Utensil Production Design (Application No.: 411271-001), Name of Applicant: Dr. Anish Pandey, Ms. Shikha Singh, Dr. Rajiva Lochan Mohanty, Dr. Ruby Mishra, Date of Filing: 21-March-2024, Registration (Grant) of Design Patent Date: 29-May-2024.\nSolar-Powered Robotic Cleaner for Cleaning Surfaces (Application No.: 412187-001), Name of Applicant: Dr. Anish Pandey, Date of Filing: 01-April-2024, Registration (Grant) of Design Patent Date: 09-July-2024.\nAn Autonomous Floor Cleaning Robot, Patent No.: 544713, Application No.: 201831017005, Name of Applicant: KIIT University, Bhubaneswar, Inventors Name: Dr. Anish Pandey, Mr. Abhishek Kumar Kashyap, Dr. Ashok Kumar Sahoo, Dr. Isham Panigrahi, Date of Filing: 04-May-2018, Publishing Date: 08-November-2019, Patent Grant Date: 11-July-2024.\nLeg-Wheel Hybrid Robot with Integrated Manipulator (Application No.: 421859-001), Name of Applicant: Dr. Anish Pandey, Mr. Prashant Kumar, Dr. Pankaj Rai, Mr. Surjeet Singh Gour, Date of Filing: 01-July-2024, Patent Grant Date: 16-August-2024.\n3-D Square Bar Extrusion Die (Application No.: 422802-001), Name of Applicant: Dr. Sambit Kumar Mohapatra, Dr. Kalipada Maity, Dr. Rajiva Lochan Mohanty, Dr. Anish Pandey, Date of Filing: 10-July-2024, Patent Grant Date: 22-August-2024.\nFire Extinguisher Robot (Application No.: 412780-001), Name of Applicant: Dr. Anish Pandey, Dr. Prashant Kumar, Dr. Abhishek Sharma, Dr. Tarun Dhar Diwan, Mr. Surjeet Singh Gour, Mr. Akshat Tiwari, Date of Filing: 06-April-2024, Patent Grant Date: 05-September-2024.\nTwo-Wheeled Scooter (Application No.: 427235-001), Name of Applicant: Dr. Rajiva Lochan Mohanty, Dr. Anish Pandey, Dr. Sumanta Chaudhuri, Dr. Sanjib Kumar Jaypuria, Dr. Sambit Kumar Mohapatra, Er. Surjeet Singh, Gour Date of Filing: 16-August-2024, Patent Grant Date: 25-September-2024.\nMicrocatheter (Application No.: 427904-001), Name of Applicant: Mr. Suman Dey, Dr. Ruby Mishra, Dr. Manoranjan Mohapatra, Dr. Ritu Maity, Mr. Abhishek Kumar Dubey, Dr. Anish Pandey, Date of Filing: 23-August-2024, Patent Grant Date: 22-October -2024."
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/ashwani-kumar/",
        "name": "Dr. Ashwani Kumar",
        "role": "Assistant Professor II",
        "bio": "Dr. Ashwani Kumar is a researcher and academic specializing in machine condition monitoring, lubricant analysis, vibration diagnostics, and neuromorphic sensing. He focuses on improving equipment performance through innovative, practical solutions. He holds a Ph.D. from IIT (ISM) Dhanbad, an M.Tech. in Mechatronics from IIITDM Jabalpur, and a B.E. from UIT, Barkatullah University. He also completed two years of postdoctoral research at Luleå University of Technology, Sweden. A dedicated contributor to R&D and industrial consultancy, he has published widely and actively mentors future engineers.",
        "email": "ashwani.kumarfme@kiit.ac.in",
        "social_links": [
            "https://www.linkedin.com/in/ashwani-kumar-65449133/"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57198891030",
            "Google Scholar": "https://scholar.google.com/citations?user=TwxfX0EAAAAJ&hl=en&authuser=1",
            "ORCID": "https://orcid.org/0000-0001-9919-0737"
        },
        "sidebar_details": {
            "Email": "ashwani.kumarfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57198891030",
            "Google Scholar": "https://scholar.google.com/citations?user=TwxfX0EAAAAJ&hl=en&authuser=1",
            "ORCID": "https://orcid.org/0000-0001-9919-0737"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Postdoctral Fellow Researcher from Lulea, Sweden; Phd. from IIT-ISM Dhanbad, India; Master of Technology in Mechatronics from IIIT Jabalpur, India; Bachelore of Eengineering in Mechanical Engineering from University Institute of Technology, BU, Bhopal, India"
            ],
            "COURSE EXPERTISE": [
                "Machine Maintenance; Condition Monitoring; Mechatronics System; Mechanics of Solids"
            ],
            "RESEARCH INTERESTS": [
                "Machine Condition Monitoring; Lubricant; Vibration analysis; Tribology; Mechatronics"
            ],
            "Awards and Achievements": [
                "Most Promising Young Researcher Award at “All India seminar on Major advances andsustainable developments in lubrication domain”, 13-14 September 2018, organized jointly byTata Steel Ltd., NLGI and The Institutions of Engineers (India), Jamshedpur."
            ],
            "Outreach Activity": [
                "Guest Lecture, Mechanical Manufacturing and monitoring using matlab, (MMM2020 VNIT Nagpur), 14 Dec 2020 to 18 Dec 2020.\nSession Chair, International Conference on “Futuristic and Sustainable Aspects in Engineering and Technology (FSAET-2020), 18 Dec 2020 to 19 Dec 2020.\nGuest Speaker, Webinar on Oil Condition Monitoring, 18 Oct 2021. https://www.youtube.com/watch?v=TOQRN_1HQ2M&t=365s."
            ],
            "Professional Membership": [
                "Certified Level II Machinery Lubricant Analyst from International Council for Machinery Lubrication,USA (MLA II – 004182)."
            ],
            "Patents and Innovations": [
                "Autonomous Seam Welding Machine, Indian Patent, 202131027969, 15 Feb 2024, Granted.\nAn Autonomous Floor Cleaning Robot, Indian Patent, 202131023229, 18 Jun 2021, Published.\nPortable automatic cleaning andsanitizing device, Indian Patent, 202231018240, 29 Mar 2022, Submited."
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/asish-kumar-panda/",
        "name": "Dr. Asish Kumar Panda",
        "role": "Assistant Professor",
        "bio": "Dr. Asish Kumar Panda is currently working as an assistant professor at the School of Mechanical Engineering, KIIT University, Odisha, India. Dr. Asish has received his Doctoral degree (Ph.D.) from School of Mechanical Engineering , Indian Institute of Technology Delhi. He has completed his Master’s degree from Indian Institute of Technology Guwahati and Bachelor’s degree from Biju Patnaik University of Technology in Mechanical Engineering. He has more than 3 years of teaching and research experiences. His research interests broadly include FE model updating, Dynamic analysis of structures, Uncertainty quantification, Experimental modal analysis, Noise and Vibration analysis, Condition monitoring and fault diagnosis..",
        "email": "asish.pandafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/profile.php?id=61561215928781"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57206129113",
            "Google Scholar": "https://scholar.google.com/citations?user=xOBU6bwAAAAJ&hl=en&oi=ao",
            "ORCID": "https://orcid.org/0000-0002-3307-7333"
        },
        "sidebar_details": {
            "Email": "asish.pandafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57206129113",
            "Google Scholar": "https://scholar.google.com/citations?user=xOBU6bwAAAAJ&hl=en&oi=ao",
            "ORCID": "https://orcid.org/0000-0002-3307-7333"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD (IIT Delhi), MTech (IIT Guwahati)"
            ],
            "COURSE EXPERTISE": [
                "Vibration, Finite Element Methods, Experimental Modal analysis, Kinematics and Dynamics of Machine"
            ],
            "RESEARCH INTERESTS": [
                "Finite Element model updating, Modal analysis, static and dynamic analysis of structures, Structural Health monitoring"
            ],
            "Administrative Responsibilities": [
                "Website development"
            ],
            "Outreach Activity": [
                "Delivered expert lectures on Dynamic Analysis of CNT based Composite Structures at Mechanical Engg. department NIT Rourkela, Odisha (2024)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/asit-behera/",
        "name": "Dr. Asit Behera",
        "role": "Assistant Professor",
        "bio": "Asit Behera is an Assistant Professor in the School of Mechanical Engineering at KIIT University. He holds a doctorate from KIIT and a master’s degree from NIT Rourkela. Beginning his academic career in 2014, he has eight years of teaching experience at KIIT. His research expertise includes EDM, laser welding, and superalloys, with publications in reputed international journals and conferences. He has authored a book titled EOT Crane Model and contributed multiple book chapters. Skilled in software tools such as X’pert HighScore, MINITAB, STATISTICA, ADAMS, SolidWorks, CATIA, and MATLAB, he has taught Engineering Mechanics, Manufacturing Technology, Mechanical Measurement and Control, Metrology and Quality Control, and Material Science. He is keen to continue research in superalloy processing and characterization.",
        "email": "asit.beherafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/jack.asit123/",
            "https://x.com/Dr_Asit_Behera"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57200874208",
            "Google Scholar": "https://scholar.google.com/citations?user=9QheWqgAAAAJ&hl=en&authuser=1",
            "ORCID": "https://orcid.org/0000-0001-6405-4049"
        },
        "sidebar_details": {
            "Email": "asit.beherafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57200874208",
            "Google Scholar": "https://scholar.google.com/citations?user=9QheWqgAAAAJ&hl=en&authuser=1",
            "ORCID": "https://orcid.org/0000-0001-6405-4049"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D. (Mechanical Engineering), M.Tech. (Production Engineering))"
            ],
            "COURSE EXPERTISE": [
                "Manufacturing process, Metrology, Solid Mechanics"
            ],
            "RESEARCH INTERESTS": [
                "Characterization of superalloys, Non-conventional machining, Optimization techniques"
            ],
            "Administrative Responsibilities": [
                "Member of IIC, KIIT\nMember of NISP, KIIT\nMember of Quality cell, SME, KIIT\nMember of Mechanical Innovation cell, KIIT\nMember of Branding team, SME, KIIT"
            ],
            "Awards and Achievements": [
                "Received incredible professionals of India-2021 in academics.\nReviewers in many peer-reviewed journals."
            ],
            "Outreach Activity": [
                "Conducted ideathon, hackathon, innovation contest and many lecture series for inhouse and outside students."
            ],
            "Professional Membership": [
                "Life membership of Indian Science Congress\nLife membership of IET"
            ],
            "Projects & Consultancies": [
                "Co-PI in Consultancy project work ‘Strengthening the fly ash brick for furnance lining’ given by M/S GE renewable energy, Bangalore completed in 2020. (3.45 lakh)\nCo-PI in Consultancy project work ‘DRI Capacity Enhancement (Testing of raw material)’ given by M/s. MGM minerals Ltd.(Steel Division II) completed in 2023. (2.57 lakh)"
            ],
            "Patents and Innovations": [
                "Filed patent on ‘Process Improvement in EDM by incorporating novel nano graphene oxide mixed dielectric using both brass and Cu electrode’ in Indian patent office in 2024.\nFiled patent on ‘Multi-Purpose Spraying Machine’ in Indian patent office in 2022."
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/avinash-chaudhary/",
        "name": "Dr. Avinash Chaudhary",
        "role": "Assistant Professor-II",
        "bio": "Research professional with experience of 8+ years in Fire and Combustion Science. Education background includes a Ph.D. on Combustion and Fire Safety from the Indian Institute of Technology (IIT), Roorkee (India), and MS in Thermal Engineering from the National Institute of Technology (NIT), Kurukshetra (India). Currently working as Assistant Professor in School of Mechanical Engineering, Kalinga Institute of Industrial Technology (KIIT), India. Previously worked as postdoctoral researcher at CORIA laboratory, INSA Rouen, France on “Near wall combustion with high temperature materials”, project MATRYSSE and “Behavior of aeronautic composites under flames”, project AEROFLAMME. I was responsible for design and development of a test bench for the reaction to fire of composites used in aeronautics. Research contributions include several peer-reviewed “Research Articles” published in leading International Journals, Conferences. .",
        "email": "avinash.chaudharyfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/share/18NQYNJbZm/?mibextid=LQQJ4d",
            "https://www.linkedin.com/in/avinash-chaudhary-96535b17a/",
            "https://twitter.com/AvinChaudhry"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55681777600",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=ROzAjrYAAAAJ",
            "ORCID": "https://orcid.org/0000-0002-5127-0276"
        },
        "sidebar_details": {
            "Email": "avinash.chaudharyfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55681777600",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=ROzAjrYAAAAJ",
            "ORCID": "https://orcid.org/0000-0002-5127-0276"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D."
            ],
            "COURSE EXPERTISE": [
                "Thermal"
            ],
            "RESEARCH INTERESTS": [
                "Fire dynamics in compartment, Combustion, Optical diagnostics, Phosphor thermometry, Thermal behavior of aeronautics composites, Solar energy"
            ],
            "Professional Membership": [
                "Membership of Indian Society of Heat and Mass Transfer (ISHMT)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/basanta-kumar-nanda/",
        "name": "Dr. Basanta Kumar Nanda",
        "role": "Assistant Professor",
        "bio": "Dr. Basanta Kumar Nanda is working as Associate Professor in School of Mechanical Engineering at KIIT Deemed to be University, Bhubaneswar, India. He obtained his B.E degree from National Institute of Technology (Previously REC), Silchar, in Mechanical Engineering. He got his M. Tech from Bengal Engineering College in Production Engineeeing. He has also received his Ph.D degree in Production Engineering from VSSUT, Burla. He has presented a number of papers in different International Conferences in India and abroad. He has also reviewed a number of research papers of International Journals. He has been teaching manufacturing related courses since last twenty-six years.",
        "email": "bnandafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/basantakumar.nanda",
            "https://x.com/Basanta07246078?s=08"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57188723524",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=GVr1xx8AAAAJ",
            "ORCID": "https://orcid.org/0000-0002-2738-0416"
        },
        "sidebar_details": {
            "Email": "bnandafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57188723524",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=GVr1xx8AAAAJ",
            "ORCID": "https://orcid.org/0000-0002-2738-0416"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD"
            ],
            "COURSE EXPERTISE": [
                "Production Engg, Metrology, Non-Traditional Maching,Thermodynamics"
            ],
            "RESEARCH INTERESTS": [
                "Production Engg. Non-Traditional Machining Process"
            ],
            "Administrative Responsibilities": [
                "Programe head, M.Tech (MPS)"
            ],
            "Professional Membership": [
                "ISTE Live membership"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/bharat-chandra-routara/",
        "name": "Dr. Bharat Chandra Routara",
        "role": "Senior Professor",
        "bio": "Dr. Bharat Chandra Routara is a Senior Professor at the School of Mechanical Engineering, KIIT Deemed to be University, where he also serves as Chairman of the Central Library Committee. He earned his Ph.D. in Production Engineering from Jadavpur University in 2008. With over 30 years of teaching experience, he has guided seven Ph.D. scholars (five ongoing) and seventeen M.Tech students. Dr. Routara has published over 100 research papers in reputed international journals and presented widely at global conferences. His research focuses on non-traditional machining, cryogenic cooling, surface characterization, and optimization of machinability parameters. He holds an international patent and is a Fellow of The Institution of Engineers (India) and a life member of ISTE, IIIE, and The Institution of Engineering and Technology (IET).",
        "email": "broutrafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/bharat.routaray",
            "https://www.linkedin.com/in/dr-bharat-chandra-routara-aaaaab173/",
            "https://www.instagram.com/bharatchandraroutara/?hl=en",
            "https://x.com/bcroutray"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/results/results.uri?sort=plf-f&src=s&st1=routara&st2=bharat&nlo=1&nlr=20&nls=count-f&sid=29fcd6f02e0c1a820d5544ef71d7248d&sot=anl&sdt=aut&sl=52&s=AU-ID%28%22Chandra+Routara%2c+Bharat+Chandra%22+23973543900%29&origin=searchhistory&txGid=d4f13b38fe8e6ebfea6e9dc716e1827e",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=g3_0bYYAAAAJ&view_op=list_works&sortby=pubdate",
            "ORCID": "https://orcid.org/0000-0001-6587-0064"
        },
        "sidebar_details": {
            "Email": "broutrafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/results/results.uri?sort=plf-f&src=s&st1=routara&st2=bharat&nlo=1&nlr=20&nls=count-f&sid=29fcd6f02e0c1a820d5544ef71d7248d&sot=anl&sdt=aut&sl=52&s=AU-ID%28%22Chandra+Routara%2c+Bharat+Chandra%22+23973543900%29&origin=searchhistory&txGid=d4f13b38fe8e6ebfea6e9dc716e1827e",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=g3_0bYYAAAAJ&view_op=list_works&sortby=pubdate",
            "ORCID": "https://orcid.org/0000-0001-6587-0064"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D( Production Engineering)"
            ],
            "COURSE EXPERTISE": [
                "Manufacturing Technology, Engineering Mechanics, Operations Research, Engineering Meteology"
            ],
            "RESEARCH INTERESTS": [
                "Non-Conventional Machinging, Composite Materials, Cryogenic Machining, Hard Machining"
            ],
            "Administrative Responsibilities": [
                "FIC Lab, Chairmain Central Library Committee"
            ],
            "Awards and Achievements": [
                "Best Staff of the Year(2018)"
            ],
            "Professional Membership": [
                "Member (Life), Indian Society for Technical Education, INDIA, From August 1996., Membership No-LM20449\nMember (Life), Indian Institute of Industrial Engineering, INDIA, From May 2009. Membership No-MIIE9142\nMember (Life), The Institution of Engineering and Technology, INDIA, From Sept. 2010, Membership No-\nFellow Member, The Institution of Engineers (India), From December 2015, Membership No-F120510-9\nMember (Life), The Indian Science Congress Association, From June 2016"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/bijaya-bijeta-nayak/",
        "name": "Dr. Bijaya Bijeta Nayak",
        "role": "Associate Professor",
        "bio": "Dr. Bijaya Bijeta Nayak is an associate professor of school of Mechanical Engineering, KIIT Deemed to be University, Bhubaneswar, Odisha, India. She has completed her doctoral degree from Department of Mechanical Engineering, National Institute of Technology Rourkela, India. She has more than twelve years of experience in teaching. Her current area of research includes advanced manufacturing processes, composite fabrication, process modelling, and quality engineering, Renewable energy resources. She has published more than seventy research papers in international journals and international conferences. Eight scholars have completed their Masters degree under her guidance and three are continuing their Ph. D under her guidance. She has Nine patents published and granted on her credit.",
        "email": "bijaya.nayakfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/profile.php?id=100083688916480",
            "https://www.linkedin.com/in/dr-bijaya-bijeta-nayak-480a94209/",
            "https://x.com/BijayaBijeta"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56352342500",
            "Google Scholar": "https://scholar.google.co.in/citations?user=27mG3swAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-7777-6953 "
        },
        "sidebar_details": {
            "Email": "bijaya.nayakfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56352342500",
            "Google Scholar": "https://scholar.google.co.in/citations?user=27mG3swAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-7777-6953 "
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D in Mechanical Engineering from National institute of Technology, Rourkela"
            ],
            "COURSE EXPERTISE": [
                "Manufacturing Processes and System"
            ],
            "RESEARCH INTERESTS": [
                "Non conventional Machining, 3D Printing, Optimzation and Modelling"
            ],
            "Administrative Responsibilities": [
                "Examianation Committee member\nCo-Fic of CIM & Robotics Lab"
            ],
            "Professional Membership": [
                "Life Member of Indian Society For Technical Education. Membership no. LM14068\nLife Member of Soft Computing Research Society\nLife Member of Artificial Intelligence and Machine Learning Association (AMIEE)\nMember of Energy Swaraj Foundationm"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/debjyoti-sahu/",
        "name": "Dr. Debjyoti Sahu",
        "role": "Assistant Professor",
        "bio": "Dr. Debjyoti Sahu currently serves as Assistant Professor at School of Mechanical Engineering, KIIT Deemed to be University, Bhubaneswar. Dr. Sahu obtained is B.E. in Automobile Engineering from Malnad College of Engineering Hassan and M.Tech in Energy Systems Engineering from BVB College of Engineering and Technology Hubli, Karnataka. He obtained his PhD in Energy Technology from Indian Institute of Technology Guwahati, India. He has taught various subjects in UG and PG level at the Department of Mechanical Engineering, Amrita Vishwa Vidyapeetham, Bengaluru during 2008-2018. Now he teaches Fuels and Emission, Automobile Engineering and IC Engine and Gas Turbines at KIIT Deemed to be University, Bhubaneswar. He has been involved in several experimental research including Hydrogen adsorption, Metal organic frameworks, Refrigeration and Bio-digestion. His work on portable bio-digestion is mentioned in an article published by ENSIA, the most popular environment magazine. He has published several papers on refrigeration, adsorption and IC engine performance. Dr. Sahu is a life member of Indian Science congress and Institute of Engineers, India.",
        "email": "debjyoti.sahufme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/d.sahu.3192/",
            "https://www.linkedin.com/in/dr-debjyoti-sahu-b7020019/",
            "https://www.instagram.com/dsahu0/",
            "https://x.com/DebjyotiSahu"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57191977223",
            "Google Scholar": "https://scholar.google.com/citations?user=njSp5_oAAAAJ",
            "ORCID": "https://orcid.org/0000-0001-9801-3739"
        },
        "sidebar_details": {
            "Email": "debjyoti.sahufme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57191977223",
            "Google Scholar": "https://scholar.google.com/citations?user=njSp5_oAAAAJ",
            "ORCID": "https://orcid.org/0000-0001-9801-3739"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD in Energy Technology."
            ],
            "COURSE EXPERTISE": [
                "Automotive Techology, Battery Technology, Automotive Mechatronics"
            ],
            "RESEARCH INTERESTS": [
                "Engines and Emissions, Biofuel, Batteries"
            ],
            "Administrative Responsibilities": [
                "Associate Dean (Academics)"
            ],
            "Professional Membership": [
                "Indian Institute Chemical Engineers, Institution for Engineers India, Indian Science Congress"
            ],
            "Patents and Innovations": [
                "USAGE OF COW URINE AS AN ADDITIVE WITH THE UNUSABLE COOKING OIL FOR THE EMISSION REDUCTION FROM DIESEL ENGINE EXHAUST\nAustralian Patent 2021101233; Stirrer for Reinforcement Mixing in Stir Casting Indian Patent 388388-01"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/deepak-singhal/",
        "name": "Dr. Deepak Singhal",
        "role": "Associate Professor-I",
        "bio": "He is currently working as an Associate Professor-I in the School of Mechanical Engineering of KIIT Deemed to be University, Bhubaneswar, Odisha, India. He has completed his B-Tech in Mechanical Engineering from Indian Institute of Information Technology (IIIT), Jabalpur and completed his Phd in the area of Industrial engineering from KIIT-DU. He has published more than forty papers in International journals with high repute like International Journal of Production Research, Research in Transportation Economics, International Journal of Lean Six Sigma, Sustainable production and Consumption, Environment, Development and Sustainability, Management Decision, OPSEARCH, etc. His major areas of interest include decision modelling, supply chain management, sustainability, data analytics, Operations and quality management.",
        "email": "deepak.singhalfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/deepak.singhal.12720",
            "https://www.linkedin.com/in/deepak-singhal-763a90111/",
            "https://twitter.com/DeepakS97119864"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57200819644",
            "Google Scholar": "https://scholar.google.com/citations?user=rWAiC6oAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-1336-7819"
        },
        "sidebar_details": {
            "Email": "deepak.singhalfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57200819644",
            "Google Scholar": "https://scholar.google.com/citations?user=rWAiC6oAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-1336-7819"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD (Industrial Engineering, KIIT-DU), B-Tech (Mechanical Engineering, IIIT-Jabalpur))"
            ],
            "COURSE EXPERTISE": [
                "Operations management, Quality managament, Operations Research, Supply chain management"
            ],
            "RESEARCH INTERESTS": [
                "Decision modelling, Sustainability, Operations and Supply chain management"
            ],
            "Administrative Responsibilities": [
                "FIC, Website, SME, 2023-Present\nProgram Officer, NSS, SME, 2019-2024\nAlumni coordinator for SME, 2020-2021\nTutor mentor coordinator for 3rd year, SME, 2019-2020"
            ],
            "Awards and Achievements": [
                "Er. PC panda award from Institute of Engineers for outstanding research paper, 2020\nEr. PC panda award from Institute of Engineers for outstanding research paper, 2024\nRecognized as a one of best teaching faculty in SME, 2018\nBagged the best paper presentation award in ICMMRE conference, SMIT, Gangtok, 2018\nSecured the 2nd rank in the B-Tech, Mechanical Engineering, IIIT-Jabalpur, 2010"
            ],
            "Outreach Activity": [
                "Delivered expert lectures on Operations and Supply chain management for MBA students of Poornima University, Jaipur (2021) Invited expert lecture on Forecasting in MDP organized by KIIT School of management for Crompton and Greaves employees (2021,2022) Reviewer of various reputed International Journals Session Chair in International Conferences"
            ],
            "Professional Membership": [
                "Indian Science Congress"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/dhyanadipta-panda/",
        "name": "Dr. Dhyanadipta Panda",
        "role": "Associate Professor",
        "bio": "Dr. Dhyanadipta Panda is working as an Assistant Professor in KIIT Deemed to be University. He has ten years of corporate experience and sixteen years of academic experience. He holds Ph. D. in Business Administration, MBA and M. Sc. from Utkal University, Vani Vihar, Bhubaneswar. He has first class throughout his career. He has undergone several professional trainings. He has published papers in refereed journals and has participated and presented research papers in national and international conferences.",
        "email": "dpandafhu@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/dhyanadipta.panda",
            "https://x.com/dhyanadipta"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57222475056",
            "Google Scholar": "https://scholar.google.com/citations?user=-bCr3m8AAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0001-6766-7211"
        },
        "sidebar_details": {
            "Email": "dpandafhu@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57222475056",
            "Google Scholar": "https://scholar.google.com/citations?user=-bCr3m8AAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0001-6766-7211"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph. D. (Management), MBA, MSc."
            ],
            "COURSE EXPERTISE": [
                "Human Resource Management, Organisational Behaviour, Essentials of Management, Leadership and Team Building, Business Ethics and Corporate Governance"
            ],
            "RESEARCH INTERESTS": [
                "Human Resource Information System, Organisation Behaviour"
            ],
            "Administrative Responsibilities": [
                "Member Outreach Committee"
            ],
            "Professional Membership": [
                "All India Commerce Association, All India Science Congress"
            ],
            "Patents and Innovations": [
                "Bandaru, R., Mahapatra, P., Mohanty, D., Mishra, N. K., Panda, D., Venkateswaran, P. S., Boro, K. (2022). Framework For Service Quality Management To Ensure Customer Satisfaction In Modern Virtual Enterprises, 202241050325 A, India\nDas, S. R., Mahapatra, P., Panda, D., Mishra, N., Tah, M. (2023). Electronic Device for Assisting Purchase in Fashion Industry, 6328074, UK"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/dr-sudhanshu-dubey/",
        "name": "Dr. Sudhanshu Dubey",
        "role": "Assistant Professor I",
        "bio": "Dr. Sudhanshu Dubey, is an Assistant Professor in the School of Mechanical Engineering at Kalinga Institute of Industrial Technology (KIIT), India. He earned his Ph.D. in Mechanical Engineering from IIT Bombay, MTech. from IIT Guwahati, and B.E. from GEC Bilaspur. His doctoral research pioneered the development of Optimal Laminated Additive Manufacturing (OptiLAM), integrating advanced laser-based techniques with multi-axis automation. Dr. Dubey’s research spans Additive Manufacturing, CNC Technology, Robotics & Automation, and Laser–Material Interaction, with contributions including patents, international publications, and conference presentations. A recipient of multiple academic and research awards, Dr. Dubey continues to drive innovation in manufacturing automation.",
        "email": "sudhanshu.dubeyfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/sudhanshu.dubey.849210",
            "https://www.linkedin.com/in/dr-sudhanshu-dubey-818153160/",
            "https://www.instagram.com/sdubey3010/"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=58549003200",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=JycW10gAAAAJ&view_op=list_works&sortby=pubdate",
            "ORCID": "https://orcid.org/my-orcid?orcid=0000-0001-7962-7479"
        },
        "sidebar_details": {
            "Email": "sudhanshu.dubeyfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=58549003200",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=JycW10gAAAAJ&view_op=list_works&sortby=pubdate",
            "ORCID": "https://orcid.org/my-orcid?orcid=0000-0001-7962-7479"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D. in Mechanical Engineering from IIT Bombay, MTech in Mechanical Engineering from IIT Guwahati, BTech in Mechanical Engineering from Government Engineering College Bilaspur Chhattisgarh"
            ],
            "COURSE EXPERTISE": [
                "Additive Manufacturing, Solid Mechanics, Kinematics & Dynamics of Machine, Machine Design"
            ],
            "RESEARCH INTERESTS": [
                "Additive Manufacturing, Automation, Robotics, Drone"
            ],
            "Administrative Responsibilities": [
                "FIC Global Immersion Programme KIIT SME"
            ],
            "Awards and Achievements": [
                "Honoured with the PG Research Award – Ph.D. during the department’s valedictory function at the esteemed institution of IIT Bombay in 2024.\nSpeaker during the CEP Course on Additive Manufacturing at IIT Bombay, 2020, 2023\nTravel grants by IIT Bombay for EUROMAT 2023, Frankfurt, Germany (3rd -7th September 2023)\nTravel grants by IIT Bombay-IOE funds for ICAM 2023, Washington DC, United States (30th October -3rd November 2023)"
            ],
            "Professional Membership": [
                "ISHARE Member"
            ],
            "Projects & Consultancies": [
                "Visiting Researcher Politecnico di Milano Italy"
            ],
            "Patents and Innovations": [
                "“Oscillating Multi-Wire Feeding for Hybrid Wire-arc Additive Manufacturing System,” (Granted Patent No:463334), 2022\n “Energy Beam Laminated Manufacturing,” (Granted Patent No:432549),2020\n“Novel gluing process of laminated paper using the laser beam” Application No: 202421019886, 2024\n“Pumice Drone” Application No: 202421041986\n“A Novel Laminated Paper Drone Frame” Application No: 202421040504\n“Optimal Laminated Additive Manufacturing” Application No: 202421033753"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/gyan-sagar-sinha/",
        "name": "Dr. Gyan Sagar Sinha",
        "role": "Assistant Professor II",
        "bio": "With BE in 2011 from University Institute of Technology, Barkatullah University ( A Government Organisation) , Bhopal, and integrated PhD in 2017 November from IIT Guwahati (all in Mechanical Engineering), Dr. Gyan Sagar Sinha joined NIT Uttarakhand as a contractual Faculty in January 2018. He became Assistant Professor (II) in June 2018 in School of Mechanical Engineering, KIIT deemed to be university.",
        "email": "gyan.sinhafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/gyan.sagar.129",
            "https://www.linkedin.com/in/dr-gyan-sagar-sinha-a3b102b8/",
            "https://x.com/gyan_sagar"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57210582734",
            "Google Scholar": "https://scholar.google.co.in/citations?user=_r6LmRMAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-4878-4479"
        },
        "sidebar_details": {
            "Email": "gyan.sinhafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57210582734",
            "Google Scholar": "https://scholar.google.co.in/citations?user=_r6LmRMAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-4878-4479"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "BE (From Barkatullah University institute of Technology, Bhopal (A Government Organization)\nPhD (Indian Institute of Technology Guwahati, Guwahati)"
            ],
            "COURSE EXPERTISE": [
                "Thermal Science and Engineering"
            ],
            "RESEARCH INTERESTS": [
                "Porous Media Combustion, Heat Transfer"
            ],
            "Awards and Achievements": [
                "MHRD Scholarship through GATE up to five years\nSelected in Government Engineering College, Kalahandi, Orissa for faculty Position through TEQIP-III (National Project Implementation Unit, A unit of MHRD)\nChaired a session at 2nd International Conference on New Frontiers in Engineering Science& Technology, Feb. 18-22, 2019, National Institute of Technology, Kurukshetra, India.\nChaired a session at 9th International conference on Materials Processing and characterization, March 8-10, 2019, GRIET Hyderabad, India."
            ],
            "Outreach Activity": [
                "Chaired a session at 2nd International Conference on New Frontiers in Engineering Science& Technology, Feb. 18-22, 2019, National Institute of Technology, Kurukshetra, India.\nChaired a session at 9th International conference on Materials Processing and characterization, March 8-10, 2019, GRIET Hyderabad, India."
            ],
            "Professional Membership": [
                "Indian Society of Heating, Refrigerating and Air Conditioning Engineers (ISHRAE)"
            ],
            "Patents and Innovations": [
                "Subhash C. Mishra, P. Muthukumar, Gyan Sagar Sinha, Monikankana Sharma, Niraj Kumar Mishra, P. Mahanta. Self-Aspirated Pressurized Kerosene Cooking Stove with a Porous Radiant Burner, patent grant no. 467774 (funded by TIFAC, Department of Science and Technology).\nP. Muthukumar, Gyan Sagar Sinha, Lav Kumar Kaushik, Monikankana Sharma, Shanmuga Priya Natesan, S. Kanagaraj. Nano fuel Operated Self-Aspirated Pressurized Kerosene Cooking Stove with a Porous Radiant Burner, patent grant no. 497095\nDr. Rajesh Kumar Behera, Dr. Birajendu Prasad Samal, Dr. Bhabani Prasanna Pattanaik, Dr. Rabindra Narayan Mahapatra, Dr. Ullash Kumar Rout, Dr. Gyan Sagar Sinha, Dr. Bijaya Kumar Khamari, Dr. Pradipta Kishore Das, Er. Amiya Kumar Nayak, Er. Kamalakant Dash, Prof. Priyadarshi Mutunjaya Padhi, “Mould Design for Scientific Applications in Production of Aluminium Metal Matrix Composites”. Application no. 397842-001 (Published)\nDr.Keshetti Sreekala, Dr. Prashant Prakashrao Pangrikar, Dr. Gyan Sagar Sinha, Dr. Uma Ravi Sankar Yalavarthy, Chandrakanta Mishra, Chetana Tripathy, Amiya Kumar Nayak, Venkatesh Kumar Pandiyan, Dr. Yuvaraj Duraisamy, Anthony Savio Herminio Da Piedade Fernandes, “Smart “Agricultural Drone For Crop Health Monitoring” Design application number. 6359622 (Granted)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/hemalata-jena/",
        "name": "Dr.Hemalata Jena",
        "role": "Assistant Professor",
        "bio": "Dr Hemalata Jena is an eminent researcher and academic working in the areas of materials science and engineering. She specializes in composites, mainly the mechanical characterization and development of fiber-reinforced composites. Dr. Jena also has propelled the effort with her research on sustainable and high-performance materials, and their role in enhancing material mechanical, machining, tribologocal and durability, amongst other relevant studies, which are gathering a significant number of citations. Dr. Jena has published widely in peer-reviewed journals and has presented her work at multiple international conferences during her career. Her research focuses on the design of sustainable materials consistent with green engineering. As a mentor to students and early-career professionals in Production Engineering, she is also a distinguished educator. Her focus on research and education makes her a respected figure in her field.",
        "email": "hemalata.jenafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/hj.rout",
            "https://in.linkedin.com/in/dr-hemalata-jena-6a255257",
            "https://x.com/hemalataj"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57218207276",
            "Google Scholar": "https://scholar.google.co.in/citations?user=diHG5HoAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-7808-1504"
        },
        "sidebar_details": {
            "Email": "hemalata.jenafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57218207276",
            "Google Scholar": "https://scholar.google.co.in/citations?user=diHG5HoAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-7808-1504"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PHD"
            ],
            "COURSE EXPERTISE": [
                "Manufacturing Process, Tribology, Advance Composite Material"
            ],
            "RESEARCH INTERESTS": [
                "Polymer Composites, Machining, Utilization of industrial waste, Green hydrogen, Pipeline corrosion, Application of composite materials, Tribology"
            ],
            "Administrative Responsibilities": [
                "Faculty in Charge-Student Affairs, School of Mechanical Engineering, KIIT University-2016-Till date\nConvener-K3 Ladies Club, School of Mechanical Engineering-2024-Till date\nMember-EAC(Entrepreneurship Awareness Camp)-2022-Till date\nCoordinator-QA Cell in Accreditation and Ranking Framework activities SME-2022-Till date\nConvener-School Level Mentor Counseling Committee-2022-2024\nCoordinator of KORUS Society-2015-2022\nFaculty Associate- Industry Engagement Cell-2019-2021"
            ],
            "Awards and Achievements": [
                "Editorial Board Member-Wearable Technology-Asia Pacific Academy of Science Pte. Ltd\nEditor-Tribology of Polymer and Polymer Composites for Industry 4.0, Springer Singapore, eBook ISBN 978-981-16-3903-6, DOI 10.1007/978-981-16-3903-6.\nInnovation Researcher and Dedicated Teaching Professional Award\n1st prize in M.Tech production engineering, National Institute of Technology Rourkela.\nBest presentation at International conference on Emerging Material and Process (ICEMP), CSIR-Institute of Minerals and Materials Technology Bhubaneswar."
            ],
            "Outreach Activity": [
                "One week online FDP on Advanced Materials (Fabrication, Chraterisationa and Application)-Natioanal- July 20-25, 2020 at KIIT- as Convener, 2. Advanced Innovation and Opportunities in Agri-Tech Entrepreneurship-5th-7th May 2022 at Foundation for Technology and Business Incubation (FTBI), National Institute of Technology Rourkela.-as Coordinator"
            ],
            "Professional Membership": [
                "Institute For Engineering Research and Publication (IFERP)- Fellow Member-Id-PMIN05261498.\nSociety of Innovative Educationalist & Scientific Research Professional (SIESRP) -Life Member-Id LM17189 9131.\nInternational Society For Research And Development-Lifetime Member(Senior Member)-Membership Id-SR4150900234.\nThe Indian Science Congress Association- Lifetime Member- Membership Id-L26850\nThe Institution of Engineering and Technology- Lifetime Member- Membership Id 100550684\n Asian Polymer Association- Lifetime Member- Membership Id L511"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/jitendra-kumar-patel/",
        "name": "Dr. Jitendra Kumar Patel",
        "role": "Assistant Professor II",
        "bio": "Dr. Jitendra Kumar Patel obtained his Bachelor of Engineering degree in Mechanical Engineering from Chhatrapati Shivaji Institute of Technology Durg, Chhattisgarh in 2010 and completed his Master of Technology from Indian Institute of Technology Guwahati in 2012. After obtaining his master’s degree, he continued his research and studies at IIT Guwahati by joining the Ph.D. program in the Department of Mechanical Engineering. He successfully defended his Ph.D. thesis, titled, “A generic and robust numerical framework for multi-phase flows using Volume-of-Fluid/Immersed boundary methods” in 2018. His broad area of research includes computational fluid dynamics, multi-phase flows, fluid-structure interactions, and miscible fluids interaction. Currently, he focuses on the analysis, development, and fabrication of micro-mixers in microfluidics applications involving two miscible fluids interactions. In 2017, he joined the Kalinga Institute of Industrial Technology, Deemed to be university Bhubaneswar as an Assistant Professor in the School of Mechanical Engineering.",
        "email": "jitendra.patelfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/jit89/",
            "https://www.linkedin.com/in/dr-jitendra-kumar-patel-666563236",
            "https://www.instagram.com/JITENDR66443891",
            "https://twitter.com/JITENDRAKUMARPATEL227"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57221030694",
            "Google Scholar": "https://scholar.google.com/citations?user=HIDLTQsAAAAJ&hl=hi&authuser=1",
            "ORCID": "https://orcid.org/0000-0002-8444-5925"
        },
        "sidebar_details": {
            "Email": "jitendra.patelfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57221030694",
            "Google Scholar": "https://scholar.google.com/citations?user=HIDLTQsAAAAJ&hl=hi&authuser=1",
            "ORCID": "https://orcid.org/0000-0002-8444-5925"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "B.E. (Mechanical Engineering), M.Tech. (Mechanical Engineering), Ph.D. (Mechanical Engineering)"
            ],
            "COURSE EXPERTISE": [
                "Fluid Mechanics, Thermodynamics, Heat Transfer, Computational Fluid Dynamics, Microfluidics, Basic Mechanical Engineering, Aviation Fuels and Combustion, Professional Practice, Law & Ethics, Scientific & Technical Writing"
            ],
            "RESEARCH INTERESTS": [
                "Multiphase Flows, Miscible Fluids Interactions, Microfluidics, Computational Fluid Dynamics, Immersed Boundary Method"
            ],
            "Administrative Responsibilities": [
                "FIC (International Student’s Relations, SME), Assistant FIC (SAP, SME), Member (Quality Assurance Cell, SME)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/kamal-kishore-joshi/",
        "name": "Dr. Kamal Kishore Joshi",
        "role": "Assistant Professor-II",
        "bio": "Dr. Kamal Kishore Joshi is working as Assistant Professor in School of Mechanical Engineering in KIIT University from 2013. He received his Ph. D degree in Mechanical Engineering from NIT Jamshedpur. His research interests are Nonlinear Finite Element Method, Advanced Composite Structures, Computational Mechanics and Shape Optimization.",
        "email": "kamal.joshifme@kiit.ac.in",
        "social_links": [
            "http://www.facebook.com/kamaljoshi57",
            "https://www.linkedin.com/in/kamal-kishore-joshi-638564236",
            "https://twitter.com/Kamal04256550"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57200820696",
            "Google Scholar": null,
            "ORCID": null
        },
        "sidebar_details": {
            "Email": "kamal.joshifme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57200820696",
            "Google Scholar": null,
            "ORCID": null
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D."
            ],
            "COURSE EXPERTISE": [
                "Engineering Mechanics,Metal cutting, FEM, Mechanics of Composite structures"
            ],
            "RESEARCH INTERESTS": [
                "Advance Composite materials, Functionally graded materials, Nonlinear FEM"
            ],
            "Administrative Responsibilities": [
                "Member of Examination committee"
            ],
            "Professional Membership": [
                "Indian Science Congress,IET"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/kunja-bihari-sahu/",
        "name": "Dr. Kunja Bihari Sahu",
        "role": "Professor",
        "bio": "Prof. (Dr.) Kunja Bihari Sahu completed his Ph. D. (Mechanical Engineering) from Jadavpur University, M. Tech. (Thermal Engineering) and B. Tech. (Mechanical Engineering) from University College of Engineering, Burla (presently VSSUT, Burla). He has an experience of more than 33 years in teaching. His major areas of interest include Combustion, Heat Transfer, and applications of Computational Fluid Dynamics in Enclosure problems. He has guided 3 Ph. D. scholars and 17 Master’s dissertation and published more than 30 research articles in peer reviewed international journals, international and national conference proceedings. He is currently a Professor at School of Mechanical Engineering in KIIT Deemed to be University. He has also taken up the position of Dean (UG Programmes) of KIIT Deemed to be University. He occupied important positions like University Academic Council member; Chairman, Board of Studies (BoS) of School of Mechanical Engineering. Prior to this, he served as the Director (Academics) of Spintronic Technology and Advanced Research, Bhubaneswar. Dr. Sahu is a Life Member of Indian Society for Technical Education (ISTE), Indian Society for Heat and Mass Transfer (ISHMT), and Indian Science Congress Association (ISCA). He is also a Fellow of Institution of Engineers (India).",
        "email": "kbsahufme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/kunjabihari.sahu.56",
            "https://www.instagram.com/kunjabihari.sahu.56/",
            "https://twitter.com/kbsahu"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=35238043000",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=HxBdRXsAAAAJ&view_op=list_works&authuser=1",
            "ORCID": "https://orcid.org/0000-0001-5987-1263"
        },
        "sidebar_details": {
            "Email": "kbsahufme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=35238043000",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=HxBdRXsAAAAJ&view_op=list_works&authuser=1",
            "ORCID": "https://orcid.org/0000-0001-5987-1263"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph. D. (Engg.), M. E. (Heat Power Engineering), B. E. (Mechanical Engineering)"
            ],
            "COURSE EXPERTISE": [
                "Heat Transfer, Refrigeration and Air Conditioning, Engineering Thermodynamics, Internal Combustion Engines, Fluid Mechanics and Hydraulic Mechanics, Finite Element Methods, Mechanics of Solids, Engineering Mechanics"
            ],
            "RESEARCH INTERESTS": [
                "Combustion, Heat Transfer, and applications of Computational Fluid Dynamics in Enclosure problems"
            ],
            "Administrative Responsibilities": [
                "Dean (UG Programmes), KIIT Deemed to be University"
            ],
            "Outreach Activity": [
                "ATAL Academy Online FDP on IoT (24.08.2020-28.08.2020) at NPTI\nATAL Academy Online FDP on IoT (14.09.2020-18.09.2020) at COE, Kallupara\nWebinar on Thermal Analysis and Calorimetry for the Characterization of Batteries (28.01.2021)\nATAL Academy Online FDP on EV (01.02.2021-05.02.2021) at Manipal Universiy, Jaipur\nTHE India University Forum (10.02.21-11.02.2021)\nOnline QIP Short Term Course on “Learning CFD/HT through Industry Relevant Problems” at IIT Bhubaneswar (07.06.2021-18.06.2021)\nPrimary Evaluator in Tycathon, 2021\nInternational e-Workshop on “Radiation Transport and Applications” at IIT Bhubaneswar (21.01.2022-22.01.2022)\nCourse Certificate on “Data Visualization in Excel” authorized by Macquarie University through Coursera\nFDP on Inculcating Universal Human Values in Technical Education organized by AICTE, 08-10 December, 2023, KIIT Deemed to be University\nFDP on UHV-II organized by AICTE, 06-10 May, 2024, KIIT Deemed to be University\nFDP on Emerging Concepts in HVAC&R conducted by ISHRAE, 08-15 July, 2024, KIIT Deemed to be University- one week\nOne Indian design patent accepted and published; one Indian patent application is in amended examination."
            ],
            "Professional Membership": [
                "Indian Society for Technical Education- Life Member\nIndian Society for Heat and Mass Transfer- Life Member\nInstitution of Engineers (India)- Fellow\nIndian Science Congress Association- Life Member"
            ],
            "Patents and Innovations": [
                "202231054539 A (Published on 11/11/2022), 388719-001 (Design Accepted and Published, Journal No is 36/2023 and Journal Date is 08/09/2023)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/madhumita-mohanty/",
        "name": "Dr. Madhumita Mohanty",
        "role": "Assistant Professor",
        "bio": "Madhumita Mohanty is currently working as an Assistant Professor at School of Mechanical Engineering in KIIT Deemed to be University, Bhubaneswar, Odisha, India. She has completed her M.Tech in Machine Design and Analysis from the Department of Mechanical Engineering, VSSUT, Burla, Odisha, India. Presently she is pursuing her PhD. at Department of Mechanical Engineering, IIT, Guwahati. She has published a number of papers in national and international journals and conferences. Her major areas of research interest include Mechanical Vibration, Condition Monitoring, Rotor Dynamics.",
        "email": "madhumita.mohanty@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/profile.php?id=61557402673033",
            "https://www.linkedin.com/in/madhumita-mohanty-4658aa21a/",
            "https://x.com/MohantyM2592"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57191582159",
            "Google Scholar": "https://scholar.google.com/citations?user=fAROZisAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-5722-8482"
        },
        "sidebar_details": {
            "Email": "madhumita.mohanty@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57191582159",
            "Google Scholar": "https://scholar.google.com/citations?user=fAROZisAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-5722-8482"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "M.Tech in Machine Design & Analysis"
            ],
            "COURSE EXPERTISE": [
                "Machine Design, Mechanical Vibration"
            ],
            "RESEARCH INTERESTS": [
                "Mechanical Vibration, Rotor Dynamics"
            ],
            "Administrative Responsibilities": [
                "Timetable Committee Member, Student Attendance and discipline committee member"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/manoj-ukamanal/",
        "name": "Dr. Manoj Ukamanal",
        "role": "Assistant Professor-II",
        "bio": "Dr. Manoj Ukamanal is working as Assistant Professor (II) in School of Mechanical Engineering in KIIT University from 2015. He received his Ph. D degree in Mechanical Engineering in the year of 2019 and M. Tech (Thermal Engg.) in the year of 2014 from KIIT-Deemed to be University, Bhubaneswar. He was previously an analyst engineer in TATA Consultancy Services, Pune, India. His research interests include Impingement heat transfer, Nano-particle and nanofluid application in heat transfer, Computational fluid dynamics, Hard Machining, Thermal Systems Design and Optimization and Run-out table in steel rolling mills. He has been teaching thermal engineering related courses in UG & PG level. He has developed many automation tools while serving in TCS and KIIT. He has published 2 international and 1 national patents and 23 research articles in journals / conferences (SCI/SCOPUS).",
        "email": "manoj.ukamanalfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/manoj.uk/",
            "https://www.linkedin.com/in/manoj-ukamanal/",
            "https://www.instagram.com/manoj.ukamanal/",
            "https://x.com/manojuk1"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55810969100",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=MROWQzcAAAAJ",
            "ORCID": "https://orcid.org/0000-0001-9830-785X"
        },
        "sidebar_details": {
            "Email": "manoj.ukamanalfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55810969100",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=MROWQzcAAAAJ",
            "ORCID": "https://orcid.org/0000-0001-9830-785X"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D. in Mechanical Engineering in the year 2019 and M. Tech (Thermal Engg.) in the year 2014 from KIIT – DU."
            ],
            "COURSE EXPERTISE": [
                "Engineering Thermodynamics, Refrigeration and Air Conditioning, Heating Ventilation and Air Conditioning, Heat Transfer, Fluid Mechanics, Mechatronics, Bio-Mechatronics, Industry 4.0"
            ],
            "RESEARCH INTERESTS": [
                "Impingement Heat Transfer and Control; CFD; Hard Machining; Thermal Systems Design and Optimization; Run-out table in steel rolling mills"
            ],
            "Administrative Responsibilities": [
                "Assistant Controller of Examination – Online and Hybrid Courses (University Level)\nFIC – NI Innovation Centre (SME)\nFIC – Defence Research Laboratory\n FIC – School Database and Website Management\nIn-charge – Infrastructure development for Online Courses\nCommittee member of Dam Safety team from KIIT – DU"
            ],
            "Awards and Achievements": [
                "Awarded certificate of appreciation from TCS, twice for the performances in projects, which were highly appreciated by the client.\nReceived 3 number of defence consultancy projects from Bharat Dynamics Limited (BDL).\nReceived 2 number of projects from Steel Industry."
            ],
            "Outreach Activity": [
                "Delivered a guest lecture for STTP in ICT Tools for Teaching and Learning (ICT148) in NITTTR- Kolkata."
            ],
            "Professional Membership": [
                "Member: Institution of Engineering and Technology (IET)\nLife Member: Indian Society for Technical Education (ISTE)\nLife Member: International Association of Engineers (IAENG)"
            ],
            "Projects & Consultancies": [
                "Received 3 number of consultancy projects from Bharat Dynamics Limited, Defence PSU, Ministry of Defence, Govt. of India.\nReceived consultancy project “Bar Counting System for Conveyor Belt” from Aarti Steels Pvt. Ltd.\nReceived Collaborative project of developing “Underwater Surveillance Vehicle” from Bharat Dynamics Limited which will be jointly developed between KIIT-DU and BDL, Vizag."
            ],
            "Patents and Innovations": [
                "“PATTERNATOR FOR MASS FLUX MEASUREMENT”, Authors: Dr. Purna Chandra Mishra, Dr. Manoj Ukamanal, Dr. Santosh K. Nayal, SME, KIIT University, Application No: PCT/IB2017/056782, Publication No: WO/2018/087626\n“RUN-OUT TABLE MECHANISM WITH WIRELESS CONTROL”, Authors: Dr. S. M. Padhy, Dr. Purna Chandra Mishra, Dr. Ruby Mishra, Dr. Manoj Ukamanal, Mr. Subham Shah, Mr. Achintya Kambli, SME, KIIT University. Application No.: PCT/IB2018/058698. Publication No.: WO/2019/102288\n”SMART DENTURE FOR SMART ORAL HEALTH”, Authors: Dr. Avni Rana, Dr. Rupsa Rani Sahu, Dr. Anjana Raut, Dr. Aswini Kumar Kar, Dr. Purna Chandra Mishra, Dr. Arun Kharavela Mohanty and Dr. Manoj Ukamanal, KIIT University, Application No: 202231062368, Publication No: 18/2024, Publication Date: 03/05/2024.\n“REDEMPTION DRIVE”, Authors: Dr. Avni Rana, Dr. Arun Kharavela Mohanty, Dr. Anjana Raut and Dr. Manoj Ukamanal, Application Number: 410084-001, Filing Date: 11.03.2024"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/mantra-prasad-satpathy/",
        "name": "Dr. Mantra Prasad Satpathy",
        "role": "Associate Professor I",
        "bio": "With a specialization in Materials Joining and Characterization, Dr. Mantra Prasad Satpathy brings over 13 years of academic and research experience in advanced manufacturing. Over the years, he has successfully supervised undergraduate and postgraduate projects, and three Ph.D. scholars have been awarded under his guidance. Dr. Satpathy has authored and co-authored over 65 peer-reviewed research articles in reputed journals and holds four published patents. He is the author of the book “Ultrasonic Welding of Metal Sheets,” published by CRC Press. He has delivered several guest lectures across various domains. Dr. Satpathy has also chaired technical sessions at several national and international conferences.",
        "email": "mantra.satpathyfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/mantra.satpathy/",
            "https://www.linkedin.com/in/dr-mantra-prasad-satpathy-6bb61969/",
            "https://www.instagram.com/mantra.satpathy/"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56297834000",
            "Google Scholar": "https://scholar.google.com/citations?user=XipZnuEAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0003-0236-787X"
        },
        "sidebar_details": {
            "Email": "mantra.satpathyfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56297834000",
            "Google Scholar": "https://scholar.google.com/citations?user=XipZnuEAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0003-0236-787X"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "B.Tech in Mechanical Engineering from BPUT Odisha, M.Tech in Manufacturing Processes and Systems from KIIT University, Ph.D in Production Engineering from NIT Rourkela."
            ],
            "COURSE EXPERTISE": [
                "Manufacturing Processes, Welding Technology, Advanced Fabrication Processes, Non-traditional Manufacturing"
            ],
            "RESEARCH INTERESTS": [
                "Solid State Welding, Composite Characterization, Advanced Manufacturing Processes"
            ],
            "Awards and Achievements": [
                "Conferred with many prestigious awards from IEI in the Production field"
            ],
            "Outreach Activity": [
                "Organised and Participated Art of Giving program in Bhubaneswar in 2025"
            ],
            "Professional Membership": [
                "IEI, AWS"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/mrutyunjay-jena/",
        "name": "Dr. Mrutyunjay Jena",
        "role": "Associate Professor-II",
        "bio": "PhD in Mechanical Engineering with 25 years experience in Aeronautical Domain (Gas Turbine Engine). Worked on performance analysis, defect investigation & engine troubleshooting, operation and testing of hydro mechanical fuel and jet nozzle control systems, engine testing and test bed calibration. Dealt with Russian origin MiG engines, P&W aero engines and industrial gas turbines. A result oriented Project Manager/Engineer with experience in Project Management, Training, Technical Support and Client Relations. Possess excellent interpersonal, communication, problem solving and decision making skills.",
        "email": "mrutyunjaya.jenafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/mrutyunjay.jena.71",
            "https://www.instagram.com/mjena_71",
            "https://twitter.com/Mrutyun28530208"
        ],
        "academic_profiles": {
            "Scopus": null,
            "Google Scholar": null,
            "ORCID": "https://orcid.org/0000-0002-6933-9040"
        },
        "sidebar_details": {
            "Email": "mrutyunjaya.jenafme@kiit.ac.in",
            "Scopus": null,
            "Google Scholar": null,
            "ORCID": "https://orcid.org/0000-0002-6933-9040"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "B.Tech (Mech. Engg.), M.E.(Mech. Engg.), PhD"
            ],
            "COURSE EXPERTISE": [
                "Aero Propulsion, Aircraft Performance, Aircraft Systems."
            ],
            "RESEARCH INTERESTS": [
                "Heat Transfer, Performance Evaluation of Aeroengine, Propulsion."
            ],
            "Administrative Responsibilities": [
                "Program Head-Aerospace Engg."
            ],
            "Professional Membership": [
                "Engg. Science Congress – L29462"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/nilotpala-bej/",
        "name": "Dr. Nilotpala Bej",
        "role": "Assistant Professor II",
        "bio": "Dr. Nilotpala Bej is an Assistant Professor in the School of Mechanical Engineering at KIIT, Bhubaneswar. She holds a B.Tech in Mechanical Engineering from UCE Burla, an M.Tech in Thermal Engineering from NIT Rourkela, and a Ph.D. from IIT Kharagpur (2015). Her research work focuses on computational fluid dynamics (CFD), including gas liquefaction at cryogenic temperatures, vortex tube gas separation, and winglet aerodynamics. Skilled in ANSYS FLUENT, OriginPro, and Tecplot, she currently guides two Ph.D. scholars, with one receiving a doctorate in 2025. She also serves as Faculty-in-Charge (International Students), CAE Lab, and Tutor-Mentor Committee. A lifetime member of ISTE and ISCA, she is treasurer of ISHRAE Bhubaneswar. She has organized ICAMPD 2019, ATAL FDP 2024, and VAANI 2025.",
        "email": "nilotpala.bejfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/profile.php?id=100094522659626&mibextid=ZbWKwL",
            "https://www.instagram.com/nilotpala.bej/?igsh=MW9jYnJodW93N2I5ag%3D%3D#",
            "https://x.com/BejNilotpala?t=yjyoLSUFhrnMk6YyYoomFA&s=09"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55995236800",
            "Google Scholar": "https://scholar.google.com/citations?user=6FHyPm0AAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-4647-2877"
        },
        "sidebar_details": {
            "Email": "nilotpala.bejfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55995236800",
            "Google Scholar": "https://scholar.google.com/citations?user=6FHyPm0AAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-4647-2877"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "B. Tech in Mechanical Engineering from VSSUT, Burla,/M.Tech in Thermal Engingineering from NIT Rourkela, / PhD in Aerospace Engineering from IIT Kharagpur"
            ],
            "COURSE EXPERTISE": [
                "Fluid Mechanics, Thermodynamics, RAC, software tools like ANSYS FLUENT, OriginiPro, Techplot"
            ],
            "RESEARCH INTERESTS": [
                "Computational Fluid Dynamics, Gas Liquefaction at Cryogenic Temperatures, Gas Separation, Winglet Aerodynamics"
            ],
            "Administrative Responsibilities": [
                "Faculty-in-Charge (International Students), Faculty-in-Charge of the Computer-Aided Engineering Laboratory, and Coordinator of the Tutor-Mentor Committee"
            ],
            "Outreach Activity": [
                "Organiser of Art of Giving Camp in Mayurbhanja district, 2025, Organised Education for All workshop at Sacred Sunshine School, Mahulia, Baripada in 2025."
            ],
            "Professional Membership": [
                "ISTE Lifetime Member, ISHRAE Treasurer Bhubaneswar Chapter"
            ],
            "Projects & Consultancies": [
                "Organized AICTE approved and funded ATAL FDP in 2024 & VAANI in 2025"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/nitin-sharma/",
        "name": "Dr. Nitin Sharma",
        "role": "Associate Professor-II",
        "bio": "Dr. Nitin Sharma is an Associate Professor (II), Associate Dean, and Program Head of B.Tech. Mechanical Engineering at the School of Mechanical Engineering, KIIT Deemed to be University, Bhubaneswar. He holds a B.Tech. from IIITDM Jabalpur, an M.E. in Mechanical and Control Engineering from the Tokyo Institute of Technology (Japan) under the MEXT Fellowship, and a Ph.D. from KIIT (2018). With over 60 SCI-indexed papers and 17 Scopus publications (H-index 23, i10-index 44), his research focuses on vibroacoustics, metamaterials, aeroelastic flutter, and composite modeling. He has guided two Ph.D. scholars and led a DST-SERB (TARE) project on acoustic metamaterials. A recipient of KIIT’s Top 5 Researcher Award (2021–22) and the Best Technical Paper Award (2018), he continues to excel in interdisciplinary mechanical research.",
        "email": "nitin.sharmafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/nitin.sharmafme",
            "https://www.linkedin.com/in/nitin-sharma-38191349/",
            "https://x.com/nitintitech"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56784497600",
            "Google Scholar": "https://scholar.google.co.in/citations?user=1-YioEgAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0001-9390-7127"
        },
        "sidebar_details": {
            "Email": "nitin.sharmafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56784497600",
            "Google Scholar": "https://scholar.google.co.in/citations?user=1-YioEgAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0001-9390-7127"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "B.Tech (IIITDM Jabalpur), ME (Tokyo Institute of Technology), PhD (KIIT)"
            ],
            "COURSE EXPERTISE": [
                "Engineering Mechanics, Mechanics of Solids, Mechanical Vibations, Finite Element Analysis, Analysis of Composite Materials, Theory of Plates and Shells"
            ],
            "RESEARCH INTERESTS": [
                "Vibro-Acoustics analysis, Acoustic metamaterials, Aeroelastic Flutter, Free-/Forced-Vibration/Transient, Bending (Stress/Deflection), Buckling (Mechanical/Thermal), Damage modeling (delamination/cutouts)"
            ],
            "Administrative Responsibilities": [
                "Associate Dean, School of Mechanical Engineering, KIIT (August 2022 – present)\nProgram Head, B.Tech. in Mechanical Engineering, KIIT (August 2022 – present)"
            ],
            "Awards and Achievements": [
                "Awarded as one of the top 5 faculty members in KIIT having outstanding research record in the year 2021-2022.\nRecipient of the Japanese Government MEXT Fellowship for pursuing Masters course from April 2012-September-2014.\nRecipient of Gold Medal for the best interdisciplinary project during B.Tech in 2006-2010 batch.\n“Best Technical Paper” award during 59th Annual Technical Session at Institute of Engineers, Odisha State Centre, Bhubaneswar on 21st January 2018.\n“Best Paper presenter”, at ICMMRE-2017, SMIT, Sikkim."
            ],
            "Outreach Activity": [
                "Coordinator, International Conference on Advances in Materials and Manufacturing Engineering (ICAMME) – 2019, March 17th -19th, School of Mechanical Engineering, KIIT, Bhubaneswar-24, Odisha, India.\nCoordinator, 1st International Conference on Advances in Mechanical Processing and Design- 2019 (ICAMPD-2019) organized from 18th -20th October, 2019 at School of Mechanical Engineering, KIIT, Bhubaneswar."
            ],
            "Professional Membership": [
                "Indian Science Congress Association (ISCA)\nInternational Association of Engineers (IAENG)\nInternational Association of Advanced Materials (IAAM)"
            ],
            "Projects & Consultancies": [
                "Projects completed:\nTitle: Experimental investigation on vibroacoustic performance of acoustic metamaterial structures using multiphysics approach\nFunding Agency: DST-SERB (TARE)\nGrant Amount: 18.3 lakhs"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/pankaj-kumar-chaudhary/",
        "name": "Dr. Pankaj Kumar Chaudhary",
        "role": "Assistant Professor-I",
        "bio": "Prof. Pankaj Kumar Chaudhary holds a Master’s degree as M. Tech in Aerospace Engineering from the Indian Institute of Technology (IIT) Bombay, with a specialization in Dynamics and Control/Flight Mechanics. He secured admission to IIT Bombay by achieving an All India Rank (AIR) of 51 in the GATE examination (Aerospace Engineering). Prof. Pankaj Kumar Chaudhary completed his Bachelor’s degree as B. Tech in Aerospace Engineering from Rajasthan Technical University, where he graduated with the highest merit of Rank 1 , earning a Gold Medal from the Honorable Governor of Rajasthan, Shri Kalraj Mishra. Prof. Pankaj Kumar Chaudhary successfully completed 3 years full time Aircraft Maintenance Engineering (A.M.E.) training course, duly approved by DGCA from School of Aeronautics, Neemrana, Rajasthan. He has done internship and training from Technical Training Centre at HAL Lucknow (Accessories Division).",
        "email": "pankaj.chaudharyfme@kiit.ac.in",
        "social_links": [
            "https://www.linkedin.com/in/pankaj-kumar-chaudhary-a66985181/",
            "https://twitter.com/PankajK90449989"
        ],
        "academic_profiles": {
            "Scopus": null,
            "Google Scholar": "https://scholar.google.com/citations?user=I_8u2akAAAAJ&hl=en",
            "ORCID": null
        },
        "sidebar_details": {
            "Email": "pankaj.chaudharyfme@kiit.ac.in",
            "Scopus": null,
            "Google Scholar": "https://scholar.google.com/citations?user=I_8u2akAAAAJ&hl=en",
            "ORCID": null
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "M. Tech in Aerospace Engineering from IIT Bombay"
            ],
            "COURSE EXPERTISE": [
                "Aerodynamics, Gas Dynamics, Aircraft Performance, Aircraft Stability and Control, Dynamics and Controls"
            ],
            "RESEARCH INTERESTS": [
                "Aerodynamics, Aircraft Performance, Gas Dynamics, Navigation and Guidance, Dynamics and Controls"
            ],
            "Administrative Responsibilities": [
                "Major Project Presentation Conduction, Hostel Duty"
            ],
            "Awards and Achievements": [
                "Gold Medalist from Hon. Governor of Rajasthan,\nHold Merit 1 in Rajasthan Technical University,\nSecured AIR 51 in GATE in Aerospace Engineering,\nAwarded with certificate of Excellence in all the 8 semesters during B. Tech."
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/prakash-ghose/",
        "name": "Dr. Prakash Ghose",
        "role": "Associate Professor I",
        "bio": "Dr. Prakash Ghose is a faculty member in the School of Mechanical Engineering, KIIT University. After completing his B.Tech, he worked as a Project Engineer at Predominant Engineers Pvt. Ltd., Gurgaon. He later obtained his Master’s degree in Heat Power Engineering from VSSUT, Burla, and subsequently joined KIIT University as a faculty member. Dr. Ghose earned his Ph.D. from Jadavpur University, Kolkata, specializing in combustion, where he worked on a gas turbine combustor project sponsored by GTRE, Bengaluru. His research interests include thermal sciences, combustion modeling, devolatilization kinetics, and CFD-based energy simulations. He also supervises several Ph.D. scholars, focusing on experimental and numerical research in combustion and energy systems.",
        "email": "pghosefme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/prakashgbanu",
            "https://www.linkedin.com/in/prakash-ghose-3747b429/?originalSubdomain=in",
            "https://x.com/prakashgbanu"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56096134000",
            "Google Scholar": "https://scholar.google.com/citations?user=NHkPZw0AAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-2657-7815"
        },
        "sidebar_details": {
            "Email": "pghosefme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56096134000",
            "Google Scholar": "https://scholar.google.com/citations?user=NHkPZw0AAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-2657-7815"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "B.Tech in Mechanical Engineering from Kalinga Institute of Technology and Science, BPUT (Now KIIT University), M.Tech in Heat Power Engineering, VSSUT Burla, P.hD. Jadavpur University"
            ],
            "COURSE EXPERTISE": [
                "Thermodyamics, Heat Transfer, Fluid Mechanics and Hdraulic Machines, Automobile Engineering"
            ],
            "RESEARCH INTERESTS": [
                "Combustion, Heat and Mass Transfer, CFD, Battery Testing"
            ],
            "Administrative Responsibilities": [
                "Hostel Superintendent, FIC Alumni"
            ],
            "Outreach Activity": [
                "Organized Education for all at NPMM Women’s college, Nayagarh, Odisha."
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/priyabrata-mohapatra/",
        "name": "Dr. Priyabrata Mohapatra",
        "role": "Assistant Professor-II",
        "bio": "Dr. Priyabrata Mohapatra received Ph.D Degree in the department of Industrial Engineering Management of Indian Institute of Technology, Kharagpur, B-Tech degree in department of Manufacturing Science and Engineering, UCE Burla and M-Tech in department of Mechanical engineering with Production Engineering as a specialization from National Institute of Technology Rourkela. He had published papers SCI journal like IJPR, IJCIM, PPC, AE journals and international conferences also. He had six years of teaching experience in school of mechanical engineering in KIIT University as Assistant Professor. During these years, he worked thoroughly in area of Manufacturing, Intelligent manufacturing, Soft Computing, Supply Chain Management, Multi-criteria Decision Making and Optimization. Optimization, AI applications in different field etc.",
        "email": "priyabrata.mohapatrafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/priyabrata.mohapatra.7?mibextid=ZbWKwL",
            "http://din.com/feed/?trk=eml-email_your_network_update_digest_01-see_all_prop_updates-0-cta",
            "https://twitter.com/priyanitrkl"
        ],
        "academic_profiles": {
            "Scopus": null,
            "Google Scholar": "https://scholar.google.com/scholar?hl=en&as_sdt=0%2C5&q=priyabrata+moh",
            "ORCID": "https://orcid.org/0000-0002-7239-4382"
        },
        "sidebar_details": {
            "Email": "priyabrata.mohapatrafme@kiit.ac.in",
            "Scopus": null,
            "Google Scholar": "https://scholar.google.com/scholar?hl=en&as_sdt=0%2C5&q=priyabrata+moh",
            "ORCID": "https://orcid.org/0000-0002-7239-4382"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Dr. Priyabrata Mohapatra received Ph.D Degree in the department of Industrial Engineering Management of Indian Institute of Technology, Kharagpur, B-Tech degree in department of Manufacturing Science and Engineering, UCE Burla and M-Tech in department of Mechanical engineering with Production Engineering as a specialization from National Institute of Technology Rourkela."
            ],
            "COURSE EXPERTISE": [
                "Operations Research, Optimization Techniques, Supply Chain Management, Project Management, Soft Computing Techniques"
            ],
            "RESEARCH INTERESTS": [
                "Intelligent manufacturing, Soft Computing, Supply Chain Management, Multi-criteria Decision Making and Optimization. Optimization, Environmental Pollution, Waste management, AI application in Environmental engineering and pollution"
            ],
            "Administrative Responsibilities": [
                "Hostel Superintendent, KIIT Boys Hostel(KP1)\nFaculty In charge, Library of School of Mechanical Engineering at KIIT University Bhubaneswar\nDC member in KIIT University"
            ],
            "Awards and Achievements": [
                "Excellence in reviewing award to recognition of an outstanding contribution to the quality of Computers and Industrial Engineering(CIE) for 2013\nBest paper presentation in AETM-2015 Conference, Bangkok, Thailand. 2015\nCOSMIC- Outstanding Researcher Award for the contribution in the field of Mechanical Engineering and Technology at AETM-2017, Bangkok 2017"
            ],
            "Outreach Activity": [
                "Editorial Board Member",
                "Scientific and Technical Committee & Editorial Review Board on Industrial and Manufacturing Engineering. REVIEWER OF INTERNATIONAL JOURNALS\nIEEE Transactions on Systems, Man and Cybernetics (Part: A)\nInternational Journal of Production Research(IJPR)\nComputers and Industrial Engineering (CIE)\nInternational Journal of System Science (IJSS)\nJournal of Intelligent Manufacturing (JIM)\nInternational Journal of Production and Economics (IJPE)"
            ],
            "Projects & Consultancies": [
                "Working with Professor in Different organization like, Odisha State Pollution Control Board, Odisha, IIM Rothak, Dublin City Bussiness School, Ireland, Birmingham City University, UK"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/pruthwiraj-sahu/",
        "name": "Dr. Pruthwiraj Sahu",
        "role": "Assistant Professor-II",
        "bio": "Dr. Pruthwiraj Sahu is currently working as an Assistant Professor (II) in the School of Mechanical Engineering, KIIT Deemed to be University, Bhubaneswar since 2014. He has completed his Ph.D. at KIIT and M.Tech. at the Indian Institute of Technology (IIT Kharagpur) in Mechanical Systems Design specialization, 2013. He has over 14.5 years of teaching experience and two years of industry experience in Annealing area (Operation) at Jindal Steel Plant, Kolkata. He has course expertise in Engineering Mechanics, Machine Dynamics, Strength of Materials, Machine Design (taught to UG students). He has guided many B.Tech. project students and one M.Tech. student as a co-supervisor. He has published a good number of research papers in reputed international SCI journals and presented papers in international conferences. His broad research areas are Development and Characterisation of Hybrid Composite Materials, Structural Analysis (both Static and Dynamic) of Fiber Reinforced Composite Laminates.",
        "email": "manoj.ukamanalfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/manoj.uk/",
            "https://www.linkedin.com/in/manoj-ukamanal/",
            "https://www.instagram.com/manoj.ukamanal/",
            "https://x.com/manojuk1"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57213034336",
            "Google Scholar": "https://scholar.google.com/citations?user=tYS_UpAAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0001-5279-7056"
        },
        "sidebar_details": {
            "Email": "manoj.ukamanalfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57213034336",
            "Google Scholar": "https://scholar.google.com/citations?user=tYS_UpAAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0001-5279-7056"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD. in Mechanical Engineering"
            ],
            "COURSE EXPERTISE": [
                "Engineering Mechanics, Machine Dynamics, Strength of Materials, Machine Design"
            ],
            "RESEARCH INTERESTS": [
                "Development and Characterisation of Hybrid Composite Laminates, Staic and Dynamic Analysis of FRP Composite"
            ],
            "Administrative Responsibilities": [
                "Member of School level NBA Committee"
            ],
            "Awards and Achievements": [
                "B.Tech. Honours"
            ],
            "Outreach Activity": [
                "Board panel member for the promotion interview of DRDO employees (Diploma Engineers) at ITR Chandipur, Balasore in 2013"
            ],
            "Professional Membership": [
                "Indian Science Congress (ISC)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/pushkar-jha/",
        "name": "Dr. Pushkar Jha",
        "role": "Assistant Professor-II",
        "bio": "Dr.Pushkar Jha is an Assisstant Professor-II in the School of Mechanical Engineering, KIIT Deemed University, Bhubaneswar. He earned both M.Tech and Ph.D degrees from IIT(BHU), Varanasi.",
        "email": "pushkar.jhafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/pushkar.jha.988?mibextid=ZbWKwL",
            "http://www.linkedin.com/in/pushkarjha17",
            "https://x.com/Pushkarjha_17?t=7yD_I5gQanBaWSe5wPCc8A&s=08"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56351050200",
            "Google Scholar": "https://scholar.google.co.in/citations?user=Vmc3lg4AAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-0745-190X"
        },
        "sidebar_details": {
            "Email": "pushkar.jhafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56351050200",
            "Google Scholar": "https://scholar.google.co.in/citations?user=Vmc3lg4AAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-0745-190X"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Both M.Tech and Ph.D degrees from IIT(BHU). Varanasi."
            ],
            "COURSE EXPERTISE": [
                "Engineering Mechanics; Mechanics of Solids; Design of Machine Elements; Tribology"
            ],
            "RESEARCH INTERESTS": [
                "Materials Development, Tribology, Composite Materials"
            ],
            "Administrative Responsibilities": [
                "Member of time table committee in School"
            ],
            "Awards and Achievements": [
                "Enjoyed fellowship given by MHRD, Government of India, during M.Tech and Ph.D.Qualified in GATE 2009"
            ],
            "Outreach Activity": [
                "Chaired a technical session in ICAMEMS-2023”, organized by School of Mechanical Engineering, VIT-AP University, Amaravati from held between 20th -22nd April 2023"
            ],
            "Professional Membership": [
                "Tribology Society of India, Life Member (LM#5226)\nInternational Association of Engineers (IAENG) (Member No: 284261)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/radha-kanta-sarangi/",
        "name": "Dr. Radha Kanta Sarangi",
        "role": "Associate Professor",
        "bio": "Dr R K Sarangi has more than 25 years of experience in teaching, research, consultancy and industry and started his career in Blue Star Ltd. He has graduated form NIT Silchar and subsequent hold M.Tech. and Ph.D. from IIT Bombay. He has published several papers in reputed journals and presented in many national and international conferences. He is also a reviewer for many reputed journals. He is an active member of ISHRAE and currently the student chair of KIIT student chapter. He was also the past student chair of Bhubaneswar ISHRAE sub-chapter. He has work extensively in the areas of refrigeration and air-conditioning, cooling of electronics, microwave components, systems and simulation, modeling of thermal systems. He has also hold the Certificate Course on Software Technology, conducted by NCST, Govt. of India.",
        "email": "radha.sarangifme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/radha.kantasarangi.16",
            "https://www.linkedin.com/in/radhakanta-sarangi-296b3021a/",
            "https://instagram.com/rksarangi_11?utm_medium=copy_link",
            "https://twitter.com/DrRKSarangi1?s=09"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=36893084700",
            "Google Scholar": null,
            "ORCID": "https://orcid.org/0000-0003-1772-3507"
        },
        "sidebar_details": {
            "Email": "radha.sarangifme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=36893084700",
            "Google Scholar": null,
            "ORCID": "https://orcid.org/0000-0003-1772-3507"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "B.Tech (NIT Silchar) M.Tech & Ph.D (IIT Bomaby)"
            ],
            "COURSE EXPERTISE": [
                "Heat Transfer, Refrigeration& Air-Conditioning Cryogenics Two Phase Flow"
            ],
            "RESEARCH INTERESTS": [
                "Heat Pipe, Electronics Cooling, Low Cost Cooling Solutions"
            ],
            "Administrative Responsibilities": [
                "Student Chair of ISHRAE Student Chapter"
            ],
            "Outreach Activity": [
                "K-12 Program under the banner of ISHRAE"
            ],
            "Professional Membership": [
                "ISHRAE"
            ],
            "Patents and Innovations": [
                "Helical Closed Loop Helical Coiled Pulsating Heat Pipe for Cooling Applications, Indian Patent #18479/2016-MUM"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/rahul/",
        "name": "Dr. Rahul",
        "role": "Assistant Professor-II",
        "bio": "Dr. Rahul is an Assistant Professor at the School of Mechanical Engineering, KIIT Deemed to be University, Bhubaneswar, Odisha. He earned his Ph.D. from the Department of Industrial Design, NIT Rourkela, and has over seven years of teaching and research experience in India and abroad, including postdoctoral research at Jilin University, China. He has published 13 SCI/WoS and 35 Scopus-indexed journal papers, with two patents published and nine under review. Dr. Rahul received the DST-SERB project as Principal Investigator and an AICTE-ATAL grant to coordinate an FDP on 3D Printing and Advanced Manufacturing. His research interests include advanced manufacturing, micro-machining, cryogenics, welding, material characterization, and process optimization. He is also a Life Member of the Indian Society for Technical Education (ISTE).",
        "email": "rahul.choudharyfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/profile.php?id=61567229407226",
            "https://www.linkedin.com/in/dr-rahul-choudhary-ph-d-480b2a58/",
            "https://www.instagram.com/",
            "https://x.com/rahulkumar589"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?origin=resultslist&authorId=57205970865&zone=",
            "Google Scholar": "https://scholar.google.com/citations?user=fx0MLgkAAAAJ&hl=en",
            "ORCID": "https://orcid.org/my-orcid?orcid=0000-0002-7132-3371"
        },
        "sidebar_details": {
            "Email": "rahul.choudharyfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?origin=resultslist&authorId=57205970865&zone=",
            "Google Scholar": "https://scholar.google.com/citations?user=fx0MLgkAAAAJ&hl=en",
            "ORCID": "https://orcid.org/my-orcid?orcid=0000-0002-7132-3371"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "B.Tech., M.Tech. Ph.D"
            ],
            "COURSE EXPERTISE": [
                "Production and Manufacturing"
            ],
            "RESEARCH INTERESTS": [
                "Micro and nano-machining processes, Conventional & nonconventional manufacturing processes, Manufacturing 4.0, Laser machining/welding and surface modification, Quality Optimization, Metal Characterization, Cryogenics, Modeling and Simulation of Production Processes."
            ],
            "Administrative Responsibilities": [
                "Faculty Incharge (B.Tech Project)\nMember of School-level Research Enhancement Committee (SREC)\nDeputy Superintendent Hostels"
            ],
            "Awards and Achievements": [
                "M.Tech. (Medalist)"
            ],
            "Outreach Activity": [
                "Organized ATAL FDP on 3D Printing and Design for Advanced Manufacturing, Sponsored by AICTE Training And Learning (ATAL) Academy as a Coordinator.\nOrganized Energy Literacy Training under the banner of Energy Swaraj Foundation as a Coordinator.\nOrganized the Symposium along with Switch ON Foundation."
            ],
            "Professional Membership": [
                "Life Member (Indian Society of Technical Education, ISTE)"
            ],
            "Projects & Consultancies": [
                "“Machinability of Titanium alloy 5553 during Electro-Discharge Machining: Emphasis on Surface Integrity and Metallurgical Characteristics” by DST-SERB under the TARE scheme, Govt. of India. as Principal Investigator\n3D Printing and Design for Advanced Manufacturing, Grant received by AICTE Training And Learning (ATAL) Academy as a Coordinator"
            ],
            "Patents and Innovations": [
                "Method of producing a solar cell, Published on 07 April 2023, Application No- 202331024032, Office of the Controller General of Patents, Designs and Trademarks Department for Promotion of Industry and Internal Trade, Ministry of Commerce & Industry, Government of India\n A method of online purchasing of customized garments, Published on 31 March 2023, Application No 202331018683, Office of the Controller General of Patents, Designs and Trademarks Department for Promotion of Industry and Internal Trade, Ministry of Commerce & Industry, Government of India"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/rajiv-lochan-mohanty/",
        "name": "Dr. Rajiv Lochan Mohanty",
        "role": "Assistant Professor-II",
        "bio": "Dr. Rajiv Lochan Mohanty has one year of industrial and six years of teaching experience. He received his Ph.D. in Mechanical Engineering from Indian Institute of Technology Bhubaneswar, Odisha, India. He received his M.Tech in Thermal Engineering from National Institute of Technology Silchar, Assam, India. His research areas include Boiling Heat Transfer, Heat Exchanger, Forced & Free Convection, Non-Newtonial Fluid, Nuclear Power Engineering, Droplet Dynamics, Refrigeration & Air Conditioning, and Microchannel. He receives a prestigious project under the Core Research Grant (CRG) from SERB, the Government of India, with a budget of INR 36.14 lakhs. He has published his research work in reputed international refereed journals and proceedings. He receives grants for seven of his patents and files five more. He is also a regular reviewer for refereed journals from well-known publishers.",
        "email": "rajiva.mohantyfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/manoj.uk/MECHRAJIVLOCHAN",
            "https://twitter.com/RAJIVLOCHANMOH2"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56779671800",
            "Google Scholar": "https://scholar.google.com/citations?user=tcsq0hsAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-5325-0244"
        },
        "sidebar_details": {
            "Email": "rajiva.mohantyfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56779671800",
            "Google Scholar": "https://scholar.google.com/citations?user=tcsq0hsAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-5325-0244"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D. (Indian Institute of Technology Bhubaneswar), M.Tech (National Institute of Technology Silchar)"
            ],
            "COURSE EXPERTISE": [
                "Fluid Mechanics and Hydraulic Machines, Heat Transfer, Thermodynamics, Power Plant Engineering, Refrigeration and Air conditioning, Internal Combustion Engine"
            ],
            "RESEARCH INTERESTS": [
                "Boiling Heat Transfer, Heat Exchanger, Forced & Free Convection, Non-Newtonial Fluid, Nuclear Power Engineering, Droplet Dynamics, Refrigeration & Air Conditioning, and Microchannel."
            ],
            "Administrative Responsibilities": [
                "Course coordinator of Basic Mechanical Engineering"
            ],
            "Awards and Achievements": [
                "Awarded as “Young Researcher” by Science Technology Engineering Management (STEM) research Society at Himachal Pradesh University, Shimla, H.P, India, 15th December 2022.\nAwarded Prof. V.M.K. Sastri Best Paper Award at 25th National and 3rd International ISHMT-ASTFE Heat and Mass Transfer Conference (IHMTC 2019) Organized at Indian Institute of Technology Roorkee Between 28th to 31st December 2019.\nSelected as “Lecturer” in Government Diploma Engineering College in Odisha through Odisha Public Service Commissions, 2016.\nSelected as “Management Trainer” at Bhushan Steel Pvt. Ltd., Angul, Odisha, India, 2013."
            ],
            "Projects & Consultancies": [
                "Rajiv Lochan Mohanty, “A mechanistic approach of two-phase heat transfers over porous coated vertical tube and its bundle”, Kalinga Institute of Industrial Technology, Science and Engineering Research Board, Core Research Grant (CRG), Duration: 3 Years, Amount: Rs. 36,13,192.00. Sanctioned Date: 29/05/2024. (As a Principal Investigator)"
            ],
            "Patents and Innovations": [
                "Mohanty, R.L., Das, M. K. (2024). Methodology to develop an elliptical rod from a circular rod using two and a half axis CNC machine (Patent No. 534950). Indian Patent. (Granted)\nMohanty, R.L., Pandey A., Chaudhuri, S. (2024). Two-wheeled scooter (Patent No. 427235-001). Indian Patent. (Granted)\nMohapatra, S.K., Mohanty, R.L., Pandey A. (2024). 3D square bar extrusion die (Patent No. 422802-001). Indian Patent. (Granted)\nPandey A., Shikha Singh, S., Mohanty, R.L., Mishra, R. (2024). Thermos-mechanical leaf straightening machine (Patent No. 410681-001). Indian Patent. (Granted)\nPandey A., Shikha Singh, S., Mohanty, R.L., Mishra, R. (2024). Mechanized utensil production unit (Patent No. 411271-001). Indian Patent. (Granted)\nPandey A., Mohanty, R.L. (2024). Object having stair climbing and descending system with a suspension mechanism (Patent No. 526854). Indian Patent. (Granted)\nPandey A., Mohanty, R.L. (2024). Room cooling through cone wall structure design (Patent No. 411500-001). Indian Patent. (Granted)\nMohanty, R.L., Pandey A., Chaudhuri, S., Mohapatra, S.K. (2024). hot-cold-mix integrated water bottle (Patent No. 434859-001). Indian Patent. (Filed)\n Mohanty, R.L., Pandey A., Chaudhuri, S., Chakraborty, P. (2024). Room cooling system through cone brick structure (Patent No. 429271-001). Indian Patent. (Filed)\nMohanty, R.L., Mohapatra, S.K., Jaypuria, S.K., Pandey A. (2024). Locking device (Patent No. 425879-001). Indian Patent. (Filed)\nMohapatra, S.K., Mohanty, R.L., Pandey A. (2024). Vibration assisted concrete 3D printing nozzle (Patent No. 428192-001). Indian Patent. (Filed)\nMohanty, R.L., Das, M. K. (2019). Light weight and low cost tube cross section for improved thermal performance of two-phase heat exchanger (Application No.: 201931039188). Indian Patent. (Published)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/ramanuj-kumar/",
        "name": "Dr. Ramanuj Kumar",
        "role": "Associate Professor I",
        "bio": "Dr. Ramanuj Kumar has over 12 years of teaching experience. He earned his Bachelor’s Degree in Mechanical Engineering from KITS Ramtek, Nagpur University, India, in 2009, and his M.Tech. in Manufacturing Engineering from NIT Warangal, India, in 2012. He completed his PhD in Mechanical Engineering at KIIT Deemed to be University, Bhubaneswar, Odisha, in 2018. Dr. Kumar is a lifetime member of the International Association of Advanced Materials, the Indian Science Congress, and the Society for Materials Chemistry (SMC). His research areas include hard turning, nanofluid-assisted machining, non-conventional machining, nanocomposites, additive manufacturing, optimization, soft computing and Modelling. He holds three granted patents and has published more than 56 papers in international journals (SCI/ESCI), as well as 70 papers in international and national conferences. His Scopus research profile includes 144 papers, 1,677 citations, and an h-index of 22. Under his supervision, two PhD theses were awarded in 2024.",
        "email": "ramanujfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/ramanuj.pandey.31",
            "https://www.linkedin.com/in/ramanuj-kumar-81b4b4148/",
            "https://www.instagram.com/ramanujpandey1/",
            "https://x.com/Ramanujkumar1"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55553737245",
            "Google Scholar": "https://scholar.google.co.in/citations?user=P5pbfmgAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-4426-2040"
        },
        "sidebar_details": {
            "Email": "ramanujfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55553737245",
            "Google Scholar": "https://scholar.google.co.in/citations?user=P5pbfmgAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-4426-2040"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD + M-Tech + BE"
            ],
            "COURSE EXPERTISE": [
                "Metal cutting and Manufacturing"
            ],
            "RESEARCH INTERESTS": [
                "Machining, Nanocomposites, additive manufacturing, MQL, Nanofluid, optimization, modelling"
            ],
            "Administrative Responsibilities": [
                "FIC Advance Machining Lab"
            ],
            "Professional Membership": [
                "Member of International Association of Advanced Materials; Member of Indian science congress association; Life time Member of Society for Materials Chemistry (SMC)"
            ],
            "Patents and Innovations": [
                "Title: “ATOMIZED NANO FLUID SPRAY IMPINGEMENT COOLING SYSTEM AND PROCESS FOR HARD TURNING”, Dated: on 5th January, 2017, Application No.: 201731000550. Inventors: RAMANUJ KUMAR, ASHOK KUMAR SAHOO, PURNA CHANDRA MISHRA. (Granted)\nTitle: “UNMANNED AERIAL VEHICLE WITH GROUND TRAVERSING CAPABILITY” (Application No.: 201931048949), Name of Applicant: KIIT University, Bhubaneswar, Inventors: SHRESTHA, RAMANUJ KUMAR, ANISH PANDEY, PRATIK SHASHWAT, ABHIJEET MOHAN, ASHOK KUMAR SAHOO, Date of Filing: 28-November-2019, Publishing Date: 13-August-2021. (Granted)\nTitle: “OBJECT HAVING STAIR CLIMBING AND DESCENDING SYSTEM, WITH A SUSPENSION MECHANISM” (Application No.: 202031020037), Name of Applicant: KIIT University, Bhubaneswar, Inventors: ANISH PANDEY, SURJEET SINGH, VIKAS SINGH PANWAR, RAJIVA LOCHAN MOHANTY, ASHOK KUMAR SAHOO, RAMANUJ KUMAR, Date of Filing: 12-May-2020, Publishing Date: 19-November-2021. (Granted)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/ranjan-kumar-behera/",
        "name": "Dr. Ranjan Kumar Behera",
        "role": "Assistant Professor-II",
        "bio": "Dr. Ranjan Kumar Behera is an Assistant Professor (II) at the School of Mechanical Engineering, KIIT Deemed to be University, Bhubaneswar, since July 2014. He earned his Ph.D. from IIT (ISM) Dhanbad and M.Tech. in Machine Design & Analysis from NIT Rourkela, where he received the Institute Silver Medal and Certificate of Merit. He completed his B.Tech. in Mechanical Engineering from CET (now OUTR), Bhubaneswar. With over 13 years of teaching and 10 years of research experience, he has taught subjects like Thermodynamics, Machine Design, and FEA. His research interests include Mechanical Vibration, Fault Detection, AI Techniques, and Composite Materials. He has published several international papers and is affiliated with IE (India), ISC, IAAM (Sweden), IRED, IAENG, and ISRD.",
        "email": "ranjan.beherafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/ranjankumar.behera.108",
            "https://www.linkedin.com/in/dr-ranjan-k-behera-68218627/",
            "https://www.instagram.com/ranjan4ur/",
            "https://x.com/ranjan4ur"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=18133804600",
            "Google Scholar": "https://scholar.google.co.in/citations?user=_L3ASmQAAAAJ&hl=en&authuser=1",
            "ORCID": "https://orcid.org/0000-0001-8475-793X"
        },
        "sidebar_details": {
            "Email": "ranjan.beherafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=18133804600",
            "Google Scholar": "https://scholar.google.co.in/citations?user=_L3ASmQAAAAJ&hl=en&authuser=1",
            "ORCID": "https://orcid.org/0000-0001-8475-793X"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "MTech, PhD"
            ],
            "COURSE EXPERTISE": [
                "Engineering Mechanics, Mechanics of Solid, Machine Dynamics, Machine Design, Thermodynamics, Fluid Mechanics, I C Engine, Introduction to Composite Materials, Finite Element Analysis, Theory of Elasticity & Plasticity, Fracture Mechanics"
            ],
            "RESEARCH INTERESTS": [
                "Mechanical Vibration, Finite Element Analysis, Fracture Mechanics, Adhesive Bonding, FRP Composites, FGM, Artificial Intelligence Technique, Robotics, IOT"
            ],
            "Administrative Responsibilities": [
                "Examination committee member: 17th Jan 2017 Till now\nFIC of CADD Centre: 1st August 2024 Till now\nCo-FIC of Design Research Lab: 2018 – 2024"
            ],
            "Awards and Achievements": [
                "Ph.D., IIT (ISM), Dhanbad, Sep’2016- Feb’2022\nM.TECH (Machine Design & Analysis), NIT, Rourkela, Odisha, India, 2012 – 2014\nTopper of my specialization (Machine Design & Analysis), NIT Rourkela, Odisha, India and awarded Institute Silver Medal, 2014\nCertificate of Merit, NIT Rourkela, Odisha, India, 2012-2013"
            ],
            "Professional Membership": [
                "The Institution of Engineers (IE India)\nIndian Science Congress (ISC)\nInternational Society for Research and Development (ISRD)\nInternational Association of Advanced Materials (IAAM), Sweden\nInstitute of Research Engineers and Doctors (IRED)\nInternational Association of Engineers (IAENG)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/rasmi-ranjan-behera/",
        "name": "Dr. Rasmi Ranjan Behera",
        "role": "Assistant Professor-II",
        "bio": "Dr. Behera is currently working as Asst. Professor (II) in the school of Mechanical Engineering, KIIT, Deemed to be University since June 2019. He received his PhD degree in Mechanical Engineering from Indian Institute of Technology Guwahati in 2019. He completed his M.Tech degree in Mechanical Engineering (Production Engineering specialization) from Jadavpur University, Kolkata in 2009 and later worked as Asst. professor in GHITM, Puri, Odisha from 2010 to 2012. He holds a B.Tech degree in Mechanical Engineering from Indira Gandhi Institute of Technology, Sarang, Odisha in 2007. His research involves bio-ceramic coating, micro-machining, surface modification including surface texturing, surface coating and cladding, laser processing for biomedical applications.",
        "email": "rasmi.beherafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/rasmiranjan.behera.35",
            "https://in.linkedin.com/in/dr-rasmi-ranjan-behera-a77ba980",
            "https://www.instagram.com/rasmiranjan.behera.35/?hl=en",
            "https://x.com/RASMI_PINKU"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56536338500",
            "Google Scholar": "https://scholar.google.co.in/citations?user=E43ulccAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-5009-168X"
        },
        "sidebar_details": {
            "Email": "rasmi.beherafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56536338500",
            "Google Scholar": "https://scholar.google.co.in/citations?user=E43ulccAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-5009-168X"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD"
            ],
            "COURSE EXPERTISE": [
                "Manufacturing Technology, Robotics, Basic Mechanical Engg, Mechanics"
            ],
            "RESEARCH INTERESTS": [
                "Micro-machining, Texturing, Sputtering, Bio-coating, Thin film deposition, Laser cladding, laser processing for Biomedical Applications, Additive Manufacturing, Metal-Matrix Composite."
            ],
            "Administrative Responsibilities": [
                "FIC for Timetable, co-FIC for Metrology & Instrumentation Lab, Member of Quality Assurance Cell"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/rishitosh-ranjan/",
        "name": "Dr. Rishitosh Ranjan",
        "role": "Assistant Professor-II",
        "bio": "Rishitosh Ranjan is an accomplished academic and researcher in mechanical engineering, with a strong focus on thermal power systems and innovation. He completed his B.Tech at an RTU-affiliated engineering college and qualified for GATE in 2013, subsequently earning his M.Tech in Thermal Power Engineering from NIT Trichy in 2013. Since joining KIIT in 2013, he has been a dedicated faculty member, teaching subjects such as Thermodynamics, Heat Transfer, Fluid Mechanics, IC Engines, CFD, and Turbo Machines, along with interdisciplinary topics like Creativity, Innovation, and Entrepreneurship. In 2022, he earned his PhD from KIIT University, with a thesis on “Numerical and Experimental Investigations of A356 Casting using Cooling Slope Method.” He also contributed to KIIT’s Industry Engagement Cell (2015–2017) and now serves as Associate Dean at KIIT Extension School, leading online program initiatives.",
        "email": "rishitoshfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/ranjan.rishitosh/",
            "https://www.linkedin.com/in/rishitosh-ranjan-98573761/"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57220815393",
            "Google Scholar": null,
            "ORCID": "https://orcid.org/0000-0002-6400-5981"
        },
        "sidebar_details": {
            "Email": "rishitoshfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57220815393",
            "Google Scholar": null,
            "ORCID": "https://orcid.org/0000-0002-6400-5981"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD"
            ],
            "COURSE EXPERTISE": [
                "Fluid Mechanics, Thermodynamics, Heat Transfer, IC Engine, Turbo Machine, CFD"
            ],
            "RESEARCH INTERESTS": [
                "Semi Solid Metal Processing, CFD, Phase Change, Flow Induced Vibration"
            ],
            "Administrative Responsibilities": [
                "Associate Dean, Online Program, KIITX"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/ruby-mishra/",
        "name": "Dr. Ruby Mishra",
        "role": "Associate Professor",
        "bio": "Dr. Ruby Mishra received B.E (Mechanical Engineering) from Utkal University in 1999, MTech (Machine Design) from Jadavpur University, in 2007, and Ph.D. (Machine Design) from Jadavpur University in 2014. She has a teaching and research experience of 20 years. Her research interests include Kinematics of Machine and Mechanism, Biomedical Engineering, Biomedical signal and image processing, robotics, medical image analysis. She is a member of The Institute of Engineers and Indian Science Congress Association. She has published 14 national and international patents. She has published many articles that are indexed in Scopus, Web of Science, and Google Scholar. Currently, she is doing research on Biomedical Instruments like Robotic arm for C.T. Guided Biopsy and Single Lumen Microcatheter for Angiography and Embolization. At present, she is working as an Associate Professor in the School of Mechanical Engineering Department of KIIT Deemed to be University.",
        "email": "rubymishrafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/ruby.mishra.963",
            "https://www.linkedin.com/in/ruby-mishra-13930616b/",
            "https://www.instagram.com/rubymishrafme/",
            "https://x.com/ruby84524038"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57199009834",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=1V9LxXYAAAAJ",
            "ORCID": "https://orcid.org/0000-0003-0431-2418"
        },
        "sidebar_details": {
            "Email": "rubymishrafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57199009834",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=1V9LxXYAAAAJ",
            "ORCID": "https://orcid.org/0000-0003-0431-2418"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD (Machine Design)"
            ],
            "COURSE EXPERTISE": [
                "Machine Design,Kinematic and dynamics of Machinery,MOS,ROBOTICS,NDET,AMM&RK"
            ],
            "RESEARCH INTERESTS": [
                "Machines and mechanism, Robotics,Biomedical Engg, FEM,Machine Learning, Image Processing"
            ],
            "Administrative Responsibilities": [
                "Associate Dean(WILP), Mtech Programme Head(Machine Design), FIC Design Research lab"
            ],
            "Outreach Activity": [
                "Involve in CBD project ,Art of giving,Tutor mrntoring, Guiding PhD ,Mtech and Btech students.Coordinator of Student grivances cell, FIC of Design Research Lab"
            ],
            "Professional Membership": [
                "Member (Life) of The Institution of Engineers (India), The Indian Science Congress Association.Indian Society for Technical Education"
            ],
            "Patents and Innovations": [
                "Run-out table mechanism with wireless control(Application No.:201731042281 A)Name of the Applicant: S.M. Padhy, P.C.Mishra, Ruby Mishra, M.Ukamanal, A.H.Kambli, S.K.Shah. Date of Filing:24.11.2017 Publishing Date:31/05/2019\nApparatus for Manipulating a Surgical Element in an Interventional Medical Procedure (Application No.: 201831000201) Name of the Applicant: SHAH, Shubham Kamlesh, MISHRA, Ruby, MOHAPATRO, Gourishankar, MISHRA, Purna Chandra, Date of filing: 02.01.2018 Publishing Date: Publishing date: 05/07/2019\nAbnormal Cell Proliferation Detection System (Application No.: 202021016174 A) Name of the Applicant: Shubham Kamlesh Shah, Dr. Ruby Mishra, Dr. Bhabani Shankar Prasad Mishra, Dr. Manoranjan Mohapatra, International Classification No., G06K0009460000, G06T0007110000, A61B0006000000Date of filing: 14/04/2020Publishing Date: Publishing date: 29/05/2020\nRitu Maity, Ruby Mishra, P.K.Pattnaik , “Fixed wing robotic Disinfection Equipment for Spraying Disinfectant in Premise”, 353330-001 , Nov 17,2021(Granted)\nRitu Maity, Ruby Mishra, P.K.Pattnaik , “Flapping wing Robotic Disinfection Equipment for Spraying Disinfectant in Premise”, 356381-001 , Jan 09,2022(Granted)\nA Referencing System for Linear Welding Automation (Application No.: 202231062876), Name of Applicant: Mr. Surjeet Singh Gour, Dr. Ruby Mishra, Dr. Tarun Dhar Diwan, and Dr. Anish Pandey, Inventors Name: Dr. Ruby Mishra, Mr. Anil Kumar Sethi, Dr. Tarun Dhar Diwan, Dr. Anish Pandey, Mr. Surjeet Singh Gour, Mr. Siddharth Choudhury, Mr. Ajay Tiwari, Mr. Akshat Tiwari, and Ms. Ananya Krishnamurthi, Date of Filing: 03-November-2022.\nMultipurpose Medicine Dispenser System (Application No.: 202231053196), Name of Applicant: Mr. Surjeet Singh Gour, Mr. Tarun Dhar Diwan, and Dr. Anish Pandey, Inventors Name: Mr. Tarun Dhar Diwan, Mr. Surjeet Singh Gour, Dr. Anish Pandey, Dr. Sushil Kumar Kashyap, Dr. Ruby Mishra, Mr. Harsh More, and Mr. Siddharth Choudhury, Date of Filing: 17-September-2022, Publishing Date: 23-September-2022.\nTwo Wheeler Anti-Theft Alarm (Application No.: 202131045555), Name of Applicant: Dr. Anish Pandey, Mr. Surjeet Singh Gour, Dr. Ruby Mishra, Mr. Tarun Dhar Diwan, and Dr. MD Ehtesham Hasan, Inventors Name: Dr. Anish Pandey, Mr. Surjeet Singh Gour, Dr. Ruby Mishra, Mr. Tarun Dhar Diwan, and Dr. MD Ehtesham Hasan, Ms. Shikha Singh, Mr. Venkatakrishnan Karthik, Mr. Kshitij Anand, Mr. Abhishek Bhardwaj, and Mr. Raj Rananjay Singh, Date of Filing: 06-October-2021, Publishing Date: 12-November-2021.\nAutonomous Seam Welding Machine (Application No.: 202131042048), Name of Applicant: Dr. Anish Pandey, Dr. Ruby Mishra, and Mr. Surjeet Singh Gour, Inventors Name: Dr. Anish Pandey, Dr. Ruby Mishra, Mr. Surjeet Singh Gour, Mr. Kartik Kumar, Mr. Kshitij Anand, Mr. Abhishek Bhardwaj, Ms. Shikha Singh, Mr. Rohan Pal, Mr. Debashis Deb, Date of Filing: 17-September-2021, Publishing Date: 22-October-2021.\nAutonomous Seam Welding Machine (Application No.: 202131027969), Name of Applicant: Dr. Anish Pandey, Dr. Ruby Mishra, Dr. Ashwani Kumar, Mr. Tarun Dhar Diwan, and Mr. Surjeet Singh Gour, Inventors Name: Dr. Anish Pandey, Mr. Tarun Dhar Diwan, Dr. Ashwani Kumar, Dr. Ruby Mishra, Mr. Surjeet Singh Gour, Ms. Shikha Singh, and Mr. Abhishek Kumar Kashyap, Date of Filing: 22-June-2021, Publishing Date: 16-July-2021.\nAn Autonomous Floor Cleaning Robot (Application No.: 202131023229), Name of Applicant: Dr. Anish Pandey, Dr. Ashwani Kumar, Dr. Ruby Mishra, and Mr. Surjeet Singh Gour, Inventors Name: Dr. Anish Pandey, Dr. Pankaj Charan Jena, Mr. Surjeet Singh Gour, Dr. Ashwani Kumar, Dr. Ruby Mishra, Dr. Dayal R. Parhi, Mr. Abhishek Kumar Kashyap, and Prince Kumar, Date of Filing: 25-May-2021, Publishing Date: 18-June-2021.\nMECHANIZED UTENSIL PRODUCTION UNIT(411271-001),Name of the Applicant:1.Dr. Anish Pandey 2. Ms. Shikha Singh 3.Dr.Rajiva Lochan Mohanty 4.Dr. Ruby Mishra,Date of filing:21/03/2024,Publication Date:29/05/2024\nTHERMO-MECHANICAL LEAFSTRAIGHTENING MACHINE(410681-001),Name of the Applicant:1.Dr. Anish Pandey 2. Ms. Shikha Singh 3.Dr.Rajiva Lochan Mohanty 4.Dr. Ruby Mishra,Date of filing:15/03/2024,Publication Date:10/05/2024\nDesign of MICROCATHETER(427904-001),Name of the Applicant:1.Mr. Suman Dey 2. Dr. Ruby Mishra 3.Dr. Manoranjan Mohapatra 4.Dr. Ritu Maity 5.Mr. Abhishek Kumar Dubey 6.Dr. Anish Pandey,Date of filing:23/08/2024,Publication Date:22/10/2024"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/rupali-das/",
        "name": "Ms. Rupali Das",
        "role": "Assistant Professor",
        "bio": "Rupali Das is currently working as an Assistant Professor (English) in the Dept. of Humanities, School of Liberal Studies, KIIT Deemed to be University, Bhubaneswar, Odisha. She has one year teaching experience at KIIT. She completed her Masters in English Literature from Banaras Hindu University (BHU), Varanasi, Uttar Pradesh . She is pursuing PhD from National Institute of Technology Rourkela (NITRKL), Odisha. She qualified UGC Junior Research Fellowship (NET-JRF), WBSET, NESLET, MHSET, APSET and TNSET. She had worked as UGC Major Research Project Fellow at Central University of Jharkhand. Her research interest includes Gender and Sexuality Studies, Cultural Studies, Archival Studies, Colonial Historiography, Film Studies and Eco Studies. She has presented several research papers in International Conferences in India and USA as well. She has one book chapter in the Springer, and she contributed a Module for M.A students at IGNOU on Gender Studies. She has reviewed two research articles in Brill Journal.",
        "email": "rupali.dasfhu@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/dasrupali2024"
        ],
        "academic_profiles": {
            "Scopus": null,
            "Google Scholar": null,
            "ORCID": "https://orcid.org/0000-0001-9699-4617"
        },
        "sidebar_details": {
            "Email": "rupali.dasfhu@kiit.ac.in",
            "Scopus": null,
            "Google Scholar": null,
            "ORCID": "https://orcid.org/0000-0001-9699-4617"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "M.A in English Literature, NET JRF , PhD (Pursuing)"
            ],
            "Course Expertise": [
                "Professional English Communication, Communication Lab, Universal Human Values (UHV), Community Based Project (CEP), and UGC NET English Paper II"
            ],
            "RESEARCH INTERESTS": [
                "Gender Studies, Colonial Historiography, Cultural Studies, Film Studies, Envioronment Studies"
            ],
            "Awards and Achievements": [
                "UGC Junior Research Fellowship GATE (English) State Eligibility Test (English)"
            ],
            "Professional Membership": [
                "American Comparative Literature Association (ACLA)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/sambit-kumar-mohapatra/",
        "name": "Dr. Sambit Kumar Mohapatra",
        "role": "Assistant Professor",
        "bio": "Dr. Sambit Kumar Mohapatra started his career in VSSUT Burla as a part time Faculty in 2012. He has completed his Doctoral programme in the year 2016 from National Institute of Technology, Rourkela, with the dissertation entitled “” Aluminium Based Material Extrusion through Mathematical Contoured Die: Numerical & Experimental Investigation””. He is currently serving as an Assistant professor in School of Mechanical Engineering, KIIT Deemed to be University, Bhubaneswar. He continued to take a keen interest in the area of Metal Forming, Powder Metallurgy, MMC as well as Die design.",
        "email": "sambit.mohapatrafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/sambit.mohapatra.330467",
            "https://twitter.com/Smbit_Mohapatra"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/search/form.uri?display=basic#basic",
            "Google Scholar": "https://scholar.google.com/citations?user=h4EBFtcAAAAJ&hl=en",
            "ORCID": null
        },
        "sidebar_details": {
            "Email": "sambit.mohapatrafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/search/form.uri?display=basic#basic",
            "Google Scholar": "https://scholar.google.com/citations?user=h4EBFtcAAAAJ&hl=en",
            "ORCID": null
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D"
            ],
            "COURSE EXPERTISE": [
                "Manufacturing Technology, Metal Forming"
            ],
            "RESEARCH INTERESTS": [
                "Severe Plastic Deformation, Metal Forming, Metal Matrix Composites"
            ],
            "Administrative Responsibilities": [
                "FIC, MT Lab, FIC, Career Preparedness, QA cell Member"
            ],
            "Professional Membership": [
                "PMAI"
            ],
            "Patents and Innovations": [
                "3-D SQUARE BAR EXTRUSION DIE ,\nTWO-WHEELED SCOOTER"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/sanjib-jaypuria/",
        "name": "Dr. Sanjib Jaypuria",
        "role": "Assistant Professor",
        "bio": "Dr. Sanjib Jaypuria earned his Ph.D. in Electron and Laser Beam Welding, along with modelling and optimization utilizing Machine Learning methodologies, from the Indian Institute of Technology (IIT), Kharagpur, India, in 2021. Prior to this, he completed his M.Tech from IIT Delhi and B.Tech in Mechanical Engineering from NIT Rourkela. Dr. Jaypuria gained industry experience at L&T and Tata Motors after completing his B.Tech. His primary research interests revolve around employing machine learning for modelling and soft computing for optimization in manufacturing processes, and 3D Printing. Additionally, he delves into mechanical and metallurgical characterization, robotics, and their various applications. Dr. Jaypuria has authored numerous research papers in International Journals and Conference Proceedings, Book Chapters. He currently serves as an Assistant Professor at the School of Mechanical Engineering at KIIT University, Bhubaneswar, India.",
        "email": "sjaypuriafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/sanjibjaypuria/",
            "https://www.linkedin.com/in/dr-sanjib-jaypuria-b5872b16/",
            "https://x.com/DrJaypuria"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57201859505&origin=resultslist",
            "Google Scholar": "https://scholar.google.co.in/citations?user=akC4T6EAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0003-1174-0672"
        },
        "sidebar_details": {
            "Email": "sjaypuriafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57201859505&origin=resultslist",
            "Google Scholar": "https://scholar.google.co.in/citations?user=akC4T6EAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0003-1174-0672"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD (IIT Kharagpur)"
            ],
            "COURSE EXPERTISE": [
                "Optimization & Modelling, Machine Learning, Additive Manufacturing, Robotics, Industry 4.0, Welding, Entrepreneurship"
            ],
            "RESEARCH INTERESTS": [
                "Optimization & Modelling, Machine Learning, Additive Manufacturing, Industry 4.0, Welding"
            ],
            "Administrative Responsibilities": [
                "Minor Project Coordinator\nFIC in Coordinating Short term Courses.\nCo-FIC in Robotics Lab"
            ],
            "Awards and Achievements": [
                "Received International Travel Grant to present a paper at ASME conference at Penn State University, United States.\nAwarded with “Brundaban Sahu Memorial Award ” from 60th Annual Technical Session of Odisha State Centre, The Institution of Engineers (India).\nConducted ATAL FDP on Role of MCDM Techniques in Data-Driven Supply Chain for Sustainability and Resilience."
            ],
            "Professional Membership": [
                "International Association of Engineers (IAENG)"
            ],
            "Patents and Innovations": [
                "Patent Granted on Design of Two-wheeled Scooter (No- 427235-001) dated 16/08/2024.\nPatent Granted on Design of Locking Device (No- 425879-001) dated 05/08/2024."
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/santosh-kumar-hotta/",
        "name": "Dr. Santosh Kumar Hotta",
        "role": "Assistant Professor-II",
        "bio": "Dr. Santosh Kumar Hotta completed his Ph.D. in 2023 from the School of Energy Science and Engineering, IIT Guwahati, after earning an M.Tech in Fluid and Thermal Engineering from the Department of Mechanical Engineering, IIT Guwahati, in 2013. His doctoral research was centered on optimizing operating parameters for biogas-fueled spark ignition engines. With over eight years of teaching and research experience, Dr. Hotta has published 11 international journal papers, presented at more than 13 international and national conferences, and authored 5 book chapters. He also serves as a reviewer for the Journal of Renewable Energy, Fuel and INAE. His research expertise spans Fuel-Based Engine Design and Modification, Combustion in CI and SI Engines, GDI and HCCI Engines, Engine Deposits, Renewable fuels (CNG, Biogas, Hydrogen, Ethanol, Methanol, and Ammonia),Waste Heat Recovery, Drying Technology, Computational Fluid Dynamics, and Thermo-Economic Analysis of Engineering Systems.",
        "email": "santoshk.hottafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/santoshkumar.hotta.14/",
            "https://www.linkedin.com/in/santosh-kumar-hotta-59b59b31/",
            "https://x.com/HottaExergy"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57204815477",
            "Google Scholar": "https://scholar.google.com/citations?user=_OPCcZAAAAAJ&hl=en&authuser=",
            "ORCID": "https://orcid.org/0000-0002-7094-9102"
        },
        "sidebar_details": {
            "Email": "santoshk.hottafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57204815477",
            "Google Scholar": "https://scholar.google.com/citations?user=_OPCcZAAAAAJ&hl=en&authuser=",
            "ORCID": "https://orcid.org/0000-0002-7094-9102"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D."
            ],
            "COURSE EXPERTISE": [
                "Engineering Thermodynamics, Combustion Engineering, Fluid Mechanics and Hydrolics Machine, Computational Fluid Dynamics,"
            ],
            "RESEARCH INTERESTS": [
                "Fuel Based Engine Design and Modification, Development and performance optimization of biofueled engines, Combustion in CI and SI engine, GDI and HCCI Engines, Engine deposits, CNG, Biogas, Hydrogen, Ethanol, Methanol, Ammonia and other renewable or alternative fuels, Renewable energy, Waste heat recovery and Drying technology, Computational Fluid Dynamics and Thermo-Economic Analysis of Engineering Systems"
            ],
            "Administrative Responsibilities": [
                "Associate Dean (UG Program of the University)"
            ],
            "Awards and Achievements": [
                "MHRD, Govt. of India scholarship for Ph.D. and M.Tech"
            ],
            "Professional Membership": [
                "Life member of the Indian Socity of Technical Education (ISTE)."
            ],
            "Projects & Consultancies": [
                "Project Title: “prototype development of a diesel-methanol dual fuel CI engine genset as an alternative power source for underwater repairing and maintenance activities” Funded By: Technology Innovation and Development Foundation, IIT Guwahati”",
                "Collaborations: Project Consultant: Sistema. bio"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/santosh-kumar-nayak/",
        "name": "Dr. Santosh Kumar Nayak",
        "role": "Associate Professor",
        "bio": "Dr. Santosh Kumar Nayak is an Associate Professor at the School of Mechanical Engineering, KIIT Deemed to be University, Bhubaneswar. He earned his Ph.D. in Mechanical Engineering from KIIT University in 2016. With over 18 years of teaching experience, he has guided 15 postgraduate theses and is currently supervising four Ph.D. scholars. Dr. Nayak has published 17 papers in reputed international journals and holds six national and international patents. His research focuses on impingement heat transfer, nanofluids, computational fluid dynamics, refrigeration, and internal combustion engines. He has presented papers at various national and international conferences and is a Life Member of ISHMT, ISTE, IE (India), and the Indian Science Congress Association.",
        "email": "sknayakfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/santosh.k.nayak.77",
            "https://www.linkedin.com/in/dr-santosh-kumar-nayak-87b12a14b/",
            "https://x.com/Santosh15473"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57217159082",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=AkgWb1oAAAAJ",
            "ORCID": "https://orcid.org/0000-0003-0791-0704 "
        },
        "sidebar_details": {
            "Email": "sknayakfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57217159082",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=AkgWb1oAAAAJ",
            "ORCID": "https://orcid.org/0000-0003-0791-0704 "
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph. D. (Mechanical Engineering)"
            ],
            "COURSE EXPERTISE": [
                "Engineering Mechanics, Fluid Mechanics, Heat Transfer, Refrigeration and Air Conditioning, CFD"
            ],
            "RESEARCH INTERESTS": [
                "Impingement heat transfer, Nano particle and nanofluid application in heat transfer, Computational fluid dynamics, Refrigeration and air conditioning, Internal combustion engine, Biofuel."
            ],
            "Administrative Responsibilities": [
                "ACOE, of the School.\nUniversity level faculty Coordinator, Korus Society.\nHeat transfer Lab, Faculty In-charge"
            ],
            "Awards and Achievements": [
                "Best paper award in 2014 & 2015 (National Science day)"
            ],
            "Outreach Activity": [
                "Session Chair in International conference on Thermofluids-2022, organized by School of Mechanical Engineering, KIIT DU, 23rd -24th January 2022, Springer.\nSession Chair in 2nd International conference on Advances in Materials and Manufacturing Technology (ICAMMT-2022), organized by MNIT, Bhopal, 22nd -26th November 2022, Springer.\nSession Chair in 4th International conference on Recent Advances in Mechanical Engineering Research and Development (ICREMERD 2021) organized by ITER, SOA University Bhubaneswar, 20-22nd July 2023, Springer.\nSession Chair in 2nd International conference on Recent Advances in Mechanical Engineering Research and Development (ICREMERD 2021) organized by ITER, SOA University Bhubaneswar, 24th -25th September 2021, Springer.\nReviewer in 2nd International conference on Recent Advances in Mechanical Engineering Research and Development (ICREMERD 2021) organized by ITER, SOA University Bhubaneswar, 24th -25th September 2021, Springer.\nSession Chair in International conference on Thermofluids-2020, organized by School of Mechanical Engineering, KIIT DU, 23rd -24th January 2020, Springer.\nReviewer of Current Journal of Applied Science and Technology."
            ],
            "Professional Membership": [
                "Life Member Indian Society of Heat and Mass Transfer (ISHMT), Indian Society of Technical Education (ISTE), Institution of Engineers (India) (IE), Indian Science Congress Association.\nLife member of Art of Giving"
            ],
            "Patents and Innovations": [
                "Title: “Patternator for Mass Flux Measurement”,Inventors: Dr. Purna Chandra Mishra, Dr. Santosh Kumar Nayak and Prof. Manoj Ukamanal,No. WO 2018/ 087626, PCT/IB 2017/056782 (International Patents, patent no. 513010, Granted).\nTitle: “Method And Apparatus For Nanofluids Spray Impingement Cooling of Steel Strip”, Inventors: Dr. Santosh Kumar Nayak, Dr. Purna Chandra Mishra, Application No: 201731041711, Date: 2017/11/21. (Indian Patent, Published,).\nTitle: “High performance Calophyllum Inophyllum bio-dielectric (Polanga bio-dielectric) medium for Sinking EDM process”, Inventors: Dr. Bharat Chandra Routra, Dr. Santosh Kumar Nayak, Dr. Biranchi Prasad Mishra, Application No: 201831028650, Date: 2018/07/30. (International Patents, Published).\nTitle: “A device and Method for scanning object in 3D”, Inventors: Swayam Bikash Mishra, Basant Kumar Nanda, Santosh Kumar Nayak, Bharat Chandra Routra, Dipabrata Banerjee.Published (2022).\nTitle: “3D Object Scanner: Design”, Inventors: Swayam Bikash Mishra, Basant Kumar Nanda, Santosh Kumar Nayak, Bharat Chandra Routra, Dipabrata Banerjee. Granted. Design No. 356949-001 dated. 19/01/2022\nTitle: “Powder Manufacturing Unit”, Inventors: Dr. Bijaya Bijeta Nayak, Dr. Sasmita Sahu, Dr. Santosh Kumar Nayak, Ms. Debashree Debadatta Behera, Dr. Shiv Sankar Das, Dr. Rita KumariSahu. Granted. Design No. 377791-001 dated. 21/01/2023"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/sasmita-sahu/",
        "name": "Dr. Sasmita Sahu",
        "role": "Assistant Professor",
        "bio": "Prof. Sahu is an alumnus of the NIT, Rourkela where she earned a masters and doctorate degree in Machine Design. She is a member of Institute of Engineers. She has more than 15 years of experience in teaching and academic. She has published several papers in peer reviewed journals like Journal of Vibration Engineering and TechnologiesOpen source preview, Journal of Theoretical and Applied Mechanics Poland, Applied Mechanics and Materials etc.and has also presented papers in national and international conferences of repute. Her interests are in the area of Machine Design, Structural damage detection and Artificial Intelligence and Soft Computing methods.",
        "email": "sasmita.sahufme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/gudusasmita.sahu/",
            "https://www.linkedin.com/in/sasmita-sahu-313874236/",
            "https://x.com/SASMITASAH65216?s=09"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57211064457",
            "Google Scholar": "https://scholar.google.co.in/citations?view_op=list_works&hl=en&user=95n0i28AAAAJ",
            "ORCID": "https://orcid.org/0000-0003-2596-8977"
        },
        "sidebar_details": {
            "Email": "sasmita.sahufme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57211064457",
            "Google Scholar": "https://scholar.google.co.in/citations?view_op=list_works&hl=en&user=95n0i28AAAAJ",
            "ORCID": "https://orcid.org/0000-0003-2596-8977"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "B.Tech in Mechanical Engineering,/M.Tech in Machine Design,/Ph.D in Machine Design"
            ],
            "COURSE EXPERTISE": [
                "Design of machine elements, Fatigue and fracture based design, strength of material, theory of machines based design, strength of meterial"
            ],
            "RESEARCH INTERESTS": [
                "Machine Design, Structural damage detection, AI techniques AI and Soft computing"
            ],
            "Outreach Activity": [
                "Art of Giving Camp in [Khordha district, 2024], Organised Education for All workshop at [Phul Nakhara] in 2025"
            ],
            "Professional Membership": [
                "Institute of Engineers"
            ],
            "Patents and Innovations": [
                "Patent publication no.-158934/DIE MANUFACTURING UNIT/",
                "Dr. Bijaya Bijeta Nayak\nDr. Sasmita Sahu\n3.Dr. Hemalata Jena\nDr. Rita Kumari Sahu"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/satya-prakash-kar/",
        "name": "Dr. Satya Prakash Kar",
        "role": "Associate Professor",
        "bio": "Dr. Satya Prakash Kar is Associate Professor in School of Mechanical Engineering at KIIT Deemed to be University, Bhubaneswar, India. He received his Ph. D degree in Mechanical Engineering from IIT Bhubaneswar. He completed his M. Tech.(Thermal Engineering) from NIT Rourkela and Bachelor of Engineering from U. C. E. Bural (Now V. S.S. U.T). His research interests are Phase Change Heat Transfer, Bio-Heat Transfer, Computational Fluid Dynamics.",
        "email": "skarfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/satya.kar.568",
            "https://www.instagram.com/satyaprakashkar5/",
            "https://twitter.com/satyapkar"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57189871105",
            "Google Scholar": "https://scholar.google.com/scholar?as_ylo=2024&q=satya+prakash+kar&hl=en&as_sdt=0,5",
            "ORCID": "https://orcid.org/0000-0003-2042-5375"
        },
        "sidebar_details": {
            "Email": "skarfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57189871105",
            "Google Scholar": "https://scholar.google.com/scholar?as_ylo=2024&q=satya+prakash+kar&hl=en&as_sdt=0,5",
            "ORCID": "https://orcid.org/0000-0003-2042-5375"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD"
            ],
            "COURSE EXPERTISE": [
                "Heat Transfer, Refrigeration & Air Conditioning"
            ],
            "RESEARCH INTERESTS": [
                "Phase Change Heat Transfer applied to laser based application, building cooling, bioheat transfer"
            ],
            "Administrative Responsibilities": [
                "Program Head M Tech (Thermal Engineering)"
            ],
            "Outreach Activity": [
                "ISHRAE activities"
            ],
            "Professional Membership": [
                "Member of ISHMT, ISHRAE"
            ],
            "Projects & Consultancies": [
                "Co-Investigator in DST-SERB project titled ” Two Phase Heat Transfer Over Metal Foams” (Ongoing)\nMentor of ISHRAE PG project work titled “Experimental and Numerical investigation of cooling of building room using phase change material”"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/shanta-chakrabarty/",
        "name": "Dr. Shanta Chakrabarty",
        "role": "Assistant Professor",
        "bio": "Dr. Shanta Chakrabarty has been an Assistant Professor at KIIT University since July 2018. She earned her B.Tech in Mechanical Engineering from CET Bhubaneswar in 2009 and completed her Ph.D. in Metallurgical Engineering and Material Science at IIT Bombay in 2015. Her research spans crystallographic orientation effects, deformation mechanics, and material behaviour modelling. As a Senior Scientist at SANDVIK ASIA, Pune (2015–2018), she worked on microstructure-property driven projects, weldability enhancement, and magnetocaloric material development. She is skilled in materials characterization (FESEM, EBSD, TKD, TMS, NANOINDENTER, DSC, TEM etc) and computational tools (COMSOL, MATLAB, PAM-STAMP and DD Simulation).Her expertise includes thermo-mechanical behaviour of material, microstructural engineering, and advanced metal-forming. With numerous publications, she has guided 2 Ph.D. and 2 M.Tech students by 2024. Dr. Chakrabarty specializes in materials innovation and mechanical behavior of Material at micro and nano scales.",
        "email": "shanta.chakrabartyfme@kiit.ac.in",
        "social_links": [
            "https://www.linkedin.com/in/shanta-chakrabarty-3080a587/",
            "https://twitter.com/su_sachy"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56386871900",
            "Google Scholar": "https://scholar.google.co.in/citations?user=20m7pzYAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0001-7583-2934"
        },
        "sidebar_details": {
            "Email": "shanta.chakrabartyfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=56386871900",
            "Google Scholar": "https://scholar.google.co.in/citations?user=20m7pzYAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0001-7583-2934"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD"
            ],
            "COURSE EXPERTISE": [
                "Material Science and Metallurgy"
            ],
            "RESEARCH INTERESTS": [
                "Thermo-mechanical processing of materials, Microstructural characterization and Engineering, Crystallographic Texture, Mechanical Testing, Metal-forming, Nanocomposite, Nanofluids, Multiscale Material Modeling, Strain-Gradient Plasticity and Size Effect"
            ],
            "Administrative Responsibilities": [
                "FIC: FESEM (CRF), TMS lab (CRF), MT Lab (SME), Co-FIC: MT LAB(2024), Member, SLRC(2021-24),Member, Board of Studies for Aerospace Engineering of School ofMechanical Engineering (21-24), Co-FIC Research & Development Cell, SME(2019-24)"
            ],
            "Awards and Achievements": [
                "Recognition from KIIT:\n2019: Outstanding teaching contribution\n2020-21: For contribution in the field of academics, research, publications, projects"
            ],
            "Outreach Activity": [
                "Co-ordinator for signing (i)MOU between KIIT .AICTE Sponsored STTP on AMM-2020 DU with RSB global (ii) MOU between KIIT DU with Indian institute of Metal (IIM) (iii) NDA between Alleima Pvt.ltd Pune with KIIT DU. Reseource person for AICTE Sponsored STTP on AMM-2020"
            ],
            "Professional Membership": [
                "Indian Institute of Metals(IIM), Institute of Engineers (IE)"
            ],
            "Projects & Consultancies": [
                "ADRB/01/2032068(Aeronautics R&D Board(ARDB), Ministry ofDefence, Govt. of India)\nSR/FST/ET-I/2021/896 (FIST,DST, GOvt. of India)\nJSL Steel, Jajpur, Alleima Pvt.ltd, Pune, Auto SteelPartnership, USA,"
            ],
            "Patents and Innovations": [
                "202231010295: Earthquake resistant and energy efficient composite brick and method of preparation thereof\n202231030402: Composite solar panel cover and method of formation thereof\n202231038094 : apparatus to measure heat transfer of nanoaerosol and a method thereof\n202231040081: Bullet proof, energy efficient, cost effective composite glass and preparation thereof\n202431079591:Aluminum matrix hybrid nanocomposites incorporating agro-bio-waste and nano-rare earth elements thereof"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/smaranika-nayak/",
        "name": "Dr. Smaranika Nayak",
        "role": "Assistant Professor-II",
        "bio": "Dr. Smaranika Nayak is from Steel city Rourkela. She obtained her B-Tech and M-Tech degree from Odisha’s premiere institute “UCE Burla” presently VSSUT Burla. She had completed her PhD from KIIT University. In 2007, she joined Mahindra Satyam as Design Engineer. She then joined GIFT college in 2009 and SCITM college in 2010 as Assistant Professor. Currently, she is working with School of Mechanical Engineering as Assistant Professor-II. She has been awarded with one Gold and Silver medal for Best Engineering Post Graduate and Best Mechanical Engineering Post Graduate. She has expertise in modelling, assembling and detailed drawing of different industrial and commercial components (GE Home Appliances). Her research centres on the design and development of FRP composites and nanocomposites for automotive applications. She has published many papers in scopus and sci indexed journals. She has reviewed many Elsevier, Springer and MDPI journals.",
        "email": "smaranika.nayakfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/profile.php?id=100062874240766",
            "https://www.linkedin.com/in/dr-smaranika-nayak-40773b148/",
            "https://www.instagram.com/s_nayak_07/",
            "https://x.com/SmaranikaNayak2"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57216944276",
            "Google Scholar": "https://scholar.google.com/citations?user=1Go-z4UAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-8594-6166"
        },
        "sidebar_details": {
            "Email": "smaranika.nayakfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57216944276",
            "Google Scholar": "https://scholar.google.com/citations?user=1Go-z4UAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0002-8594-6166"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD, M-Tech(Machine Design and Analysis), B-Tech"
            ],
            "COURSE EXPERTISE": [
                "Machine Design, Strength of Materials, Engineering Mechanics, Fluid Mechanics, Maintenance Engineering, Professional Practice and Legal ethics, Creativity Innovation and Entrepreneurship"
            ],
            "RESEARCH INTERESTS": [
                "Composite Materials, Polymer nanocomposites, Vibration, Finite Element Analysis, Low velocity impact,"
            ],
            "Administrative Responsibilities": [
                "Composite Development and Characterization Lab- Faculty in charge(FIC), Final Year Tutor Mentor Co-ordinator,"
            ],
            "Awards and Achievements": [
                "University GOLD Medal for Best Engineering Post Graduate.\nUniversity SILVER Medal for Best Mechanical Engineering Post Graduate."
            ],
            "Outreach Activity": [
                "Delivered an invited talk on “Effect of addition of nano-fillers on LVI properties of polymer composites” in International Hybrid Conference on Nano Structured Materials and Polymers (ICNP 2023) on12,13 and14 May 2023 Kottayam, Kerala, India."
            ],
            "Professional Membership": [
                "ISTE (LM 140671)\nInstitution of Engineers"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/smitirupa-pradhan/",
        "name": "Dr. Smitirupa Pradhan",
        "role": "Assistant Professor",
        "bio": "Dr. Smitirupa Pradhan working as Asst. Prof in KIIT University since 2/1/2019. She is working as FIC in MKD laboratory. Also, she is working as FIC and Co-FIC in women grievance cell and library, respectively. She is appointed as Deputy Superitedent for the hostel. Her interest areas are vibration, vehicle dynamics, Composite materials and machine maintenance and condition monitoring, etc.",
        "email": "smitirupa.pradhanfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/smitirupa.pradhan",
            "https://www.instagram.com/dr.smitirupa/"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57217825534",
            "Google Scholar": null,
            "ORCID": "https://orcid.org/0000-0002-9783-1200"
        },
        "sidebar_details": {
            "Email": "smitirupa.pradhanfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57217825534",
            "Google Scholar": null,
            "ORCID": "https://orcid.org/0000-0002-9783-1200"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD and M. Tech. from IIT Kharagpur"
            ],
            "COURSE EXPERTISE": [
                "Machine maintenance and condition monitoring,Vibration, Composite material, Vehicle Dynamics and Control"
            ],
            "RESEARCH INTERESTS": [
                "Vehicle dynamics, Charecterisation of composite materials, fault diagnosis"
            ],
            "Administrative Responsibilities": [
                "FIC in KDM laboratory, FIC in Women grievance cell and Co-FIC in Library and act as deputy Superitendent"
            ],
            "Outreach Activity": [
                "Active member in Art of Giving"
            ],
            "Professional Membership": [
                "Lifetime member in Indian Society for Technical Education (ISTE), Member in ISHRAE society"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/spandan-guha/",
        "name": "Dr. Spandan Guha",
        "role": "Associate Professor I",
        "bio": "Spandan Guha, currently serving as an Associate Professor in the School of Mechanical Engineering at KIIT University in Bhubaneswar, India, since 2018, holds a Master’s (MTech) in Production Engineering from West Bengal University of Technology, India. He completed his Ph.D. at Jadavpur University, Kolkata, India. Actively participating as a member of various governing bodies, including the Institute of Engineers, India, and the Society of Materials Chemistry, his research interests primarily focus on exploring the potential impact of Graphene and its derivatives across different domains, particularly in medical science. Furthermore, he is involved in research on Chemical Vapor Deposition (CVD) and Physical Vapor Deposition (PVD)-based Thin Film Coating, with a specific emphasis on the analysis of mechanical, morphological, and structural properties.",
        "email": "spandan.guhafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/spandan.guha.5?mibextid=LQQJ4d",
            "https://www.instagram.com/spandanguha/profilecard/?igsh=c3N0Y28zZTFvMmxi"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55796629463",
            "Google Scholar": "https://scholar.google.com/citations?user=Q4mdbNgAAAAJ&hl=en&oi=ao",
            "ORCID": null
        },
        "sidebar_details": {
            "Email": "spandan.guhafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55796629463",
            "Google Scholar": "https://scholar.google.com/citations?user=Q4mdbNgAAAAJ&hl=en&oi=ao",
            "ORCID": null
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD"
            ],
            "COURSE EXPERTISE": [
                "Manufacturing Science and Materials Science"
            ],
            "RESEARCH INTERESTS": [
                "Thin Film Coating & Traditional-Non Traditional Machining"
            ],
            "Administrative Responsibilities": [
                "Coordinator of Colloquium Lecture Series, Indenter of AFM lab in CRF & Thin Film Coating Lab in Department"
            ],
            "Outreach Activity": [
                "Reviewer of SCI Journals, Core Committee Member of Many International Conferences"
            ],
            "Professional Membership": [
                "Life Member of Institution of Engineers (India), Society for Materials Chemistry"
            ],
            "Projects & Consultancies": [
                "Project Title: An experimental investigation over anti-bacterial activity of hybridized Graphene and its derivatives, Funding Agency: SERB, Amount: 18.30 Lakhs"
            ],
            "Patents and Innovations": [
                "Granted Patent: STIRRER FOR REINFORCEMENT MIXING IN STIR CASTING\nPublished Patent: YTTRIUM OXIDE AND CARBON NANOTUBES BASED ALUMINIUM COMPOSITE WITH ENHANCEDMECHANICAL AND TRIBOLOGICAL PROPERTIES, AND METHOD OF PRODUCTION THEREOF\nTotal two patents. Published: 01, Granted: 01"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/suchismita-satapathy/",
        "name": "Dr. Suchismita Satapathy",
        "role": "Associate Professor",
        "bio": "Dr. Suchismita Satapathy is an Associate Professor in the School of Mechanical Sciences, KIIT Deemed to be University, Bhubaneswar, with over 20 years of teaching and research experience. She has published more than 130 Scopus-indexed papers in reputed national and international journals and conferences. Her research interests include ergonomics, occupational safety, operations management, operations research, acoustics, sustainability, and supply chain management. She has filed six patents—three published in India, one international, and one granted. Dr. Satapathy has guided four Ph.D. scholars (three ongoing), 20 M.Tech., and 51 B.Tech. students. She has authored and edited several books with publishers such as CRC Press, Springer, DEGRUYTER, and IGI Global. She also served as Convenor of the ICAMIE Conference in 2020.",
        "email": "ssatapathyfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/suchismita.satapathy.50/",
            "https://www.linkedin.com/in/suchismita-satapaty-888365159/",
            "https://www.instagram.com/ssatapathyfme/"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55085975400",
            "Google Scholar": "https://scholar.google.com/citations?user=Kqsri2UAAAAJ&hl=en&oi=ao",
            "ORCID": "https://orcid.org/0000-0002-4805-1793"
        },
        "sidebar_details": {
            "Email": "ssatapathyfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55085975400",
            "Google Scholar": "https://scholar.google.com/citations?user=Kqsri2UAAAAJ&hl=en&oi=ao",
            "ORCID": "https://orcid.org/0000-0002-4805-1793"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "BE Mech, Mtech ,PhD"
            ],
            "COURSE EXPERTISE": [
                "Industrial Engg and Management"
            ],
            "RESEARCH INTERESTS": [
                "Ergonomics, Occupational safety, Acoustic, Industry 4.0, Sustainability,, Supply chain Management"
            ],
            "Outreach Activity": [
                "Art of giving etc."
            ],
            "Professional Membership": [
                "ISTE, Science congress, IEANG"
            ],
            "Patents and Innovations": [
                "1 patent granted, 2 published, 2 filled\nPatent No. 403837, In Application No. 202031000820. Granted\nApplication No. 202031000888.(published)\nApplication No.202331015508(published)\nAPPLICATION No. 202131000955(published)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/sudesna-roy/",
        "name": "Dr. Sudesna Roy",
        "role": "Associate Professor (II)",
        "bio": "Dr. Sudesna Roy, an accomplished academic with over 15 years of post-Ph.D. experience, is currently associated with the School of Mechanical Engineering, KIIT Deemed to be University. She holds a Ph.D. from Northeastern University, Boston, and completed post-doctoral research at Boston University. Her academic background includes a B.Tech in Ceramic Engineering from NIT Rourkela and an M.Tech in Metallurgy from IIT Kharagpur. She received the DST Women Scientist Award (2015) and a DST-SERB research grant (2017), and presently leads the DST-FIST Level 1 project at KIIT. Dr. Roy has published widely in reputed journals and conferences. Her research interests include coatings, thin film deposition, cold and thermal spraying, optical materials, and alloy solidification modeling, with extensive expertise in magnetron sputtering and rare earth oxides.",
        "email": "sudesna.royfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/sudesna.roy.5",
            "https://www.linkedin.com/in/sudesna-roy-5577a714/",
            "https://www.instagram.com/sudesnaroy/",
            "https://x.com/sudu4u"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=7404587405",
            "Google Scholar": "https://scholar.google.co.in/citations?user=hz13MQsAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0003-3129-0891"
        },
        "sidebar_details": {
            "Email": "sudesna.royfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=7404587405",
            "Google Scholar": "https://scholar.google.co.in/citations?user=hz13MQsAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0003-3129-0891"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD (2009) Northeastern University, Boston, Massachusetts, USA MTech (2005) IIT Kharagpur, WB, IN BTech (2002) NIT Rourkela, OD, IN"
            ],
            "COURSE EXPERTISE": [
                "Undergraduate: Material Science and Engineering, Manufacturing Technology, Engineering Materials, Advanced Processing of Materials/ Graduate: Advanced Processing of Materials, Fracture and Fatigue Based Deformation, Corrosion"
            ],
            "RESEARCH INTERESTS": [
                "Her research interest is currently in the area of coatings, i.e thin film deposition, cold spraying and thermal spraying. She has worked extensively in the area of magnetron sputtering, transparent oxide ceramics, optical materials, rare earth oxides, thermal spraying and alloy solidification modeling."
            ],
            "Administrative Responsibilities": [
                "Associate Dean (Research) 2024-27/ Quality Coordinator (SME) 2017-2020"
            ],
            "Outreach Activity": [
                "Community Based Service, KIIT Knowledge Tree, Art of Giving"
            ],
            "Professional Membership": [
                "Professional Member of IET (UK), TMS (USA), IIM (IN), ISC(IN)"
            ],
            "Projects & Consultancies": [
                "PI: “Combinatorial synthesis of mixed oxides of lutetium oxide doped with europium thin films for optoelectronics”, DST SERB sponsored extra mural funding 2018-2022- completed.\nPI: “High temperature materials processing laboratory” funded by DST under the FIST scheme Science and Technology Human and Institutional Capacity Building – on going."
            ],
            "Patents and Innovations": [
                "Pramod Mandal, Sudesna Roy, Udai P. Singh, Aluminium and europium doped -gallium oxide thin films deposition for light emitting diodes (LEDs) by co-sputtering PVD technique, Indian Patent, Application No 202331025175, Status: published.\nAjay Kumar Behera, Sudesna Roy, Soobhankar Pati, Abinash Mohanty, Ankit Chaudhary, Portable sciatica pain relieving machine, Indian Patent, Application No 202331015366 Status: published.\nAjay Kumar Behera, Abhishek Mahanta, Amarjeet Yadav, Sudesna Roy, Smart anti theft fuel flow sensor for automobiles, Indian Patent, Application No 202331000589 Status: published.\nAjay Kumar Behera, Sudesna Roy, Soobhankar Pati, Smart Bookshelf that can slides any books one needs, Indian Patent, Application No 202331004366 Status: published."
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/sumanta-chaudhuri/",
        "name": "Dr. Sumanta Chaudhuri",
        "role": "Associate Professor-I",
        "bio": "Dr.Sumanta Chaudhuri is currently working as Associate professor-I in School of Mechanical Engineering, KIIT DU. After graduation, he worked as a Scientific Officer in Bhabha Atomic Research Center (BARC) and was involved in design, commissioning and operation of Nuclear Power Plants. His recent research interest is in the area of fluid flow and heat transfer in non-Newtonian fluids, Electro Magneto hydrodynamic (EMHD) pumps, Magnetohydrodynamic (MHD) pumps, Application of analytical and semi-analytical techniques like perturbation method, Homotopy perturbation method(HPM), Adomian decomposition method(ADM), Least square Method (LSM) in fluid flow and heat transfer problems. He has published around 25 papers in Journals and 10 conference papers.",
        "email": "sumanta.chaudhurifme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/?stype=lo&flo=1&deoia=1&jlou=AfcsHSRD_tNEKlqYjapYLmhscDtVB6B71TrpujnxcfiXCB17SAKccoTjw109tlt5tQiojKs4J_Od9jtBjEfjbbccuKSCkUzQuG9HwKgHVYvm7Q&smuh=21592&lh=Ac_T5JkAUzdpd2k_d30",
            "https://x.com/SumantaChaudhu6"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57201433829",
            "Google Scholar": "https://scholar.google.com/citations?user=Lt_ewAoAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0001-8404-1739"
        },
        "sidebar_details": {
            "Email": "sumanta.chaudhurifme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57201433829",
            "Google Scholar": "https://scholar.google.com/citations?user=Lt_ewAoAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0001-8404-1739"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D. in Mechanical Engineering from IIT Kharagpur, M.Tech in Thermal Science and Engineering from IIT Kharagpur, B.Tech in Mechanical Engg. from NIT Rourkela"
            ],
            "COURSE EXPERTISE": [
                "Thermal Engineering: Thermodynamics, Fluid Mechanics, Heat Transfer, I.C. Engines, Refrigeration and Air conditioning"
            ],
            "RESEARCH INTERESTS": [
                "Fluid flow and heat transfer in non-Newtonian fluids, EMHD and MHD flows and heat transfer, Application of analytical and semi-analytical techniques like HPM, ADM, LSM for solving heat transfer and fluid mechanics problems"
            ],
            "Administrative Responsibilities": [
                "Coordinator of Tutor Mentors Counseling Committee, Faculty in charge of Fluid Mechanics Lab"
            ],
            "Projects & Consultancies": [
                "Research papers published in collaboration with Faculty from IIT Dhanbad, NIT Rourkela"
            ],
            "Patents and Innovations": [
                "Two-wheeled Scooter, Design Number-427235-001"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/sushanta-tripathy/",
        "name": "Dr. Sushanta Tripathy",
        "role": "Professor and DEAN (PG)",
        "bio": "Dr. Sushanta Tripathy is a Professor at the School of Mechanical Engineering and Dean, Post Graduate Programs at KIIT University, Bhubaneswar. He earned his Ph.D. from the Department of Industrial Engineering and Management, IIT Kharagpur. With over 100 Scopus-indexed publications and 10 book chapters in reputed journals like IEEE, IJPR, and Journal of Cleaner Production, he is a recognized researcher and reviewer for leading international journals. A recipient of multiple Best Researcher Awards from the Institution of Engineers (2017, 2019, 2022, 2024) and others, he also serves as Chief Editor of IJRMET and on the editorial boards of six journals. His research interests include Supply Chain Management, Quality Management, R&D, and Productivity. He is a certified Lean Consultant and Fellow of the Institution of Engineers (India).",
        "email": "stripathyfme@kiit.ac.in",
        "social_links": [
            "http://linkedin.com/in/dr-sushanta-tripathy-23865821",
            "https://twitter.com/drsushanttt "
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=48561830400",
            "Google Scholar": "https://scholar.google.co.in/citations?user=Vwt7A84AAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0003-2470-4080"
        },
        "sidebar_details": {
            "Email": "stripathyfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=48561830400",
            "Google Scholar": "https://scholar.google.co.in/citations?user=Vwt7A84AAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0003-2470-4080"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD , Industrial Engineering ( IIT, Kharagpur)"
            ],
            "COURSE EXPERTISE": [
                "Supply Chain Management , Quality management, Lean Manufacturing"
            ],
            "RESEARCH INTERESTS": [
                "Supply Chain Management, Lean Manufacturing, Service Operation Management"
            ],
            "Administrative Responsibilities": [
                "DEAN (Post Graduate Program, KIIT University)"
            ],
            "Awards and Achievements": [
                "Life time Research Excellent Award AETM- Bangkok, International Conference 2017 . – GREEN THINKERZ-Adroit Researcher Award IRSD-Chandigarh International Conference 2016, – Outstanding Researcher Award – International Conference AETM-2015, Bangkok 2015, – Outstanding Contribution Award International Conference – IRTD-2014, Chandigarh, – Editor in Chief (International) – International Journal of Research in Mechanical Engineering and Technology (IJRMET) 2016, – P.C.Panda Award – Best Research paper in Industrial Engineering Institute of Engineers India 2017, – Brundaban Sahu Memorial Award – Best Research paper in Industrial Engineering Institute of Engineers India 2019, P.C.Panda Award – Best Research paper in Industrial Engineering Institute of Engineers India 2024"
            ],
            "Outreach Activity": [
                "Coordinator – INVEST-2024, ATAL FDP-2023, National NSS Event-2016"
            ],
            "Professional Membership": [
                "Fellow of Institution of Engineers (India)\nLife Member (Indian Society of Technical Education, ISTE)\nLife Member (The Institution of Engineering & Technology, IET)"
            ],
            "Projects & Consultancies": [
                "“Output-Oriented Benchmarking of Product Platform Development,” Under NORAD-II as Principal Investigator (Mekelle University, Ethiopia), 2005-2006\n“Role of Industrial Engineers in Ethiopia” Under Recurrent Budget as Coordinator, 2005-2006\n“Work System Design at RSB Industries” Team member 2014"
            ],
            "Patents and Innovations": [
                "“A NOVEL SPRING DESIGN METHOD FOR VEHICULAR SUSPENSION SYSTEM” Published on 12th November 2021 (Application No- 202131046126)\n“ A SMART AUTOMATIC TAP AND INDICATOR” Published on 18th February 2022 (Application No-202231003134)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/swarup-kumar-nayak/",
        "name": "Dr. Swarup Kumar Nayak",
        "role": "Associate Professor",
        "bio": "Dr. Swarup Kumar Nayak, Ph.D., is an Associate Professor at the School of Mechanical Engineering, KIIT Deemed to be University, with over 12 years of teaching and research experience. He specializes in alternative fuels, renewable energy, biomass conversion, gasification, and combustion studies. A Ph.D. holder from KIIT, he has published 46 journal articles, 10 conference papers, 3 review articles, and 1 book chapter, with over 1,284 citations and an H-index of 23 (as of 2024). His research includes biomass gasification, NOx mitigation, carbon capture, and combustion diagnostics. He has supervised six Ph.D. and two M.Tech. projects. Dr. Nayak is a Life Member of ISTE and Associate Member of IEI, actively contributing to sustainable energy innovation and improving engine performance through renewable and bio-based fuels.",
        "email": "swarup.nayakfme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/profile.php?id=100011064696682",
            "https://www.linkedin.com/in/swarup-kumar-nayak-97a041136/",
            "https://www.instagram.com/swarupnayak007/",
            "https://x.com/SWARUPKUMARNAY2"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55811621000",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=glcEd3UAAAAJ&view_op=list_works",
            "ORCID": "https://orcid.org/0000-0001-7499-9732"
        },
        "sidebar_details": {
            "Email": "swarup.nayakfme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=55811621000",
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=glcEd3UAAAAJ&view_op=list_works",
            "ORCID": "https://orcid.org/0000-0001-7499-9732"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "Ph.D. (Mechanical Engineering)"
            ],
            "COURSE EXPERTISE": [
                "ICE>\nRenewable EnergyTechnology (RET);\nScientificandTechnicalWriting (STW);\nThermodynamics;\nAutomotive Engine and Emission (AEE)"
            ],
            "RESEARCH INTERESTS": [
                "Alternative Fuel; Green Hydrogen; Combustion; Biomass and Bioenergy; Gasification Technology; Waste to Energy Conversion; and Waste Management"
            ],
            "Administrative Responsibilities": [
                "Research Faculty, SME, KIIT (DU)\nMember- University Level Research Enhancement Committee (ULREC)"
            ],
            "Awards and Achievements": [
                "2023 – Top 2% Most Influential Scientist List for Year 2023 by Stanford University;\n 2023- Best Reviewer Award by Journal “Renewable Energy”, Elsevier;\n2023- Outstanding Reviewer Award by Journal “Environment & Energy”, IOP Publishing;\n2019- Best Young Faculty Award by DK International Research Foundation (DKIRF), Chennai."
            ],
            "Professional Membership": [
                "ISTE : Lifetime member\nIndian Science Congress Association (ISCA) :Lifetime Member (L29440)\nArt of Giving: Lifetime Member\nInstitute of Engineers, India (IEI)- Associate Member (AMI-48721-6)\nIAENG (International Association of Engineers) – Lifetime Member (136443)"
            ],
            "Patents and Innovations": [
                "Swarup Kumar Nayak, Purna Chandra Mishra. Method of Preparation of Biodiesel and Apparatus Therefor. Patent / Copyright No. – PCT/IB2017/056707; Year- 2017; Granted by – (PCT-WIPO)\nSwarup Kumar Nayak, Purna Chandra Mishra. Premix and Postmix Processes for producing biofuel using non-edible oils. Patent / Copyright No. – E-3/2960/2018/KOL; Year- 2016; Granted by – (IPO, India)"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/swayam-bikash-mishra/",
        "name": "Dr. Swayam Bikash Mishra",
        "role": "Assistant Professor-II",
        "bio": "Dr. Swayam Bikash Mishra has joined as an Assistant Professor II in the School of Mechanical Engineering of Kalinga Institute of Industrial Technology (KIIT), deemed to be University on December 2016. He has received his Doctor of Philosophy (Ph.D.) award from National Institute of Technology Rourkela. He has two years of industrial experience and thirteen years of teaching experience including post-doctoral experiences. His research interest includes Heat Transfer, Artificial Intelligence, Rapid Prototyping, Rapid Manufacturing and Additive Manufacturing. He has guided five PG students and three Ph.D. students to get their degree. He has published several research papers on some reputed journals. Along with that eight Indian Patent and one International Patent are granted on his name. He has several professional memberships such as Additive Manufacturing Society of India (AMSI), American Society of Mechanical Engineers (ASME), The Institute of Engineers (IE), Indian Institute of Industrial Engineering (IIIE) and Indian Value Engineering Society (INVEST).",
        "email": "swayambikash.mishrafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/swayambikash.mishra.5",
            "https://www.linkedin.com/in/dr-swayam-bikash-mishra-43b37731/",
            "https://www.instagram.com/swayam_bikash_mishra/",
            "https://x.com/swayambikash86"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57983944200",
            "Google Scholar": "https://scholar.google.com/citations?user=FYgZGxoAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0001-5922-0727"
        },
        "sidebar_details": {
            "Email": "swayambikash.mishrafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57983944200",
            "Google Scholar": "https://scholar.google.com/citations?user=FYgZGxoAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0001-5922-0727"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "He has received his Doctor of Philosophy (Ph.D.) award from NITR."
            ],
            "COURSE EXPERTISE": [
                "Artificial Intelligence, Addive Manufacturing, Manufacturing System, Basic Manufacturing, Heat Transfer, Fluid MechanicsC"
            ],
            "RESEARCH INTERESTS": [
                "Additive Manufacturing, Surface Engineering, Metal Printing"
            ],
            "Administrative Responsibilities": [
                "FIC of Additive Manufacturing Lab, Coursera coordinator, IEC member of T&P of KIIT DU"
            ],
            "Awards and Achievements": [
                "Acted as expert for DTET, Odisha for creating center of excellency (COE) at various Govt. Ploy-technique."
            ],
            "Professional Membership": [
                "Regular Membership “American Society of Mechanical Engineers (ASME)”, USA. Membership Number: 101105510.\nAssociate Membership “The Institute of Engineers (IE)” India. Membership Number: AM162477-9.\nLife Membership “Additive Manufacturing Society of India (AMSI)”. Membership Number: AM-218/15.\nSenior Membership “ Indian Institute of Industrial Engineering (IIIE)”. Membership Number: SMIIE 11037(85).\nAcademic Membership of “Indian Value Engineering Society (INVEST)”."
            ],
            "Patents and Innovations": [
                "Eight Indian Grant Patents and One International Grant Patent"
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/tarak-kumar-sahoo/",
        "name": "Prof. Tarak kumar Sahoo",
        "role": "Assistant Professor-II",
        "bio": "Prof. Tarak Kumar Sahoo is an Assistant Professor-II in the School of Mechanical Engineering at KIIT University. He holds an M.Tech. from IIT Delhi and is currently pursuing his Ph.D. in the same institution where he teaches. His primary research interest lies in pulverized coal combustion, reflecting his commitment to advancing energy and thermal engineering fields. Prof. Sahoo is deeply engaged in both academic instruction and research, contributing to a robust learning environment. His expertise and dedication make him a key asset in preparing students for the challenges of modern mechanical engineering.s.",
        "email": "tarak.sahoofme@kiit.ac.in",
        "social_links": [
            "https://x.com/Taraksahoo82"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57920591700",
            "Google Scholar": "https://scholar.google.com/citations?user=tWAyreUAAAAJ&hl=en&oi=ao",
            "ORCID": "https://orcid.org/0000-0003-0394-2442"
        },
        "sidebar_details": {
            "Email": "tarak.sahoofme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57920591700",
            "Google Scholar": "https://scholar.google.com/citations?user=tWAyreUAAAAJ&hl=en&oi=ao",
            "ORCID": "https://orcid.org/0000-0003-0394-2442"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "M.Tech. (IITD) in applied Mechanics (fluid Science), Ph.D. (Pursuing, Combustion)"
            ],
            "COURSE EXPERTISE": [
                "Fluid Mechanics, Thermodynamics, Heat transfer, IC Engines"
            ],
            "RESEARCH INTERESTS": [
                "Pulversed Coal Combustion"
            ],
            "Administrative Responsibilities": [
                "Hydraulic Machines Laboratory in charge,\nAlumni Relations Coordinator,\nMember of admission outreach team, SME."
            ]
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/vijay-kumar-mishra/",
        "name": "Dr. Vijay Kumar Mishra",
        "role": "Associate Professor I",
        "bio": "Dr. V K Mishra studies Porous radiant burners, Non-Newtonian fluids and Micromixers. He explores optimizations methods, Data analysis tools like principle component analysis (PCA) and different types of neural networks for prediction of properties of various thermal problems , and for decision making.",
        "email": "vijay.mishrafme@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/vijay.mishra.395",
            "https://www.linkedin.com/in/vijay-mishra-9b647134/",
            "https://x.com/mishravdm"
        ],
        "academic_profiles": {
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57198889434",
            "Google Scholar": "https://scholar.google.com/citations?user=N3JbcycAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0003-0990-4340"
        },
        "sidebar_details": {
            "Email": "vijay.mishrafme@kiit.ac.in",
            "Scopus": "https://www.scopus.com/authid/detail.uri?authorId=57198889434",
            "Google Scholar": "https://scholar.google.com/citations?user=N3JbcycAAAAJ&hl=en",
            "ORCID": "https://orcid.org/0000-0003-0990-4340"
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD (IIT Guwahati)"
            ],
            "COURSE EXPERTISE": [
                "Fluid Thermal"
            ],
            "RESEARCH INTERESTS": [
                "Thermal radiative heat transfer, Optimization methods, Artificial neural network"
            ],
            "Administrative Responsibilities": [
                "School level FIC for visiting faculties"
            ],
            "Awards and Achievements": [
                "Got MHRD, Government of India scholarship for PhD"
            ]
        }
    }
]