[
    {
        "name": "Aparajita Sahoo",
        "profile_url": "https://yoga.kiit.ac.in/profiles/aparajita-sahoo/",
        "role": "Teaching Associate",
        "bio": "Mrs. Aparajita Sahoo earned her Master in Yogic Sciences. Presently, Mrs. Aparajita is working as a teaching associate in School of Spiritualism and Yogic Sciences, KIIT (Deemed to be University). Mrs. Aparajita has completed 2 years of diploma in Yoga and Naturopathy in Gorakhpur, UP. Mrs Aparjita has 3 years of teaching experience in teaching Physiology and Anatomy of yogic practices, Disease based Yoga Therapy, Yoga Psychology, Consciousness and Spiritualism etc. Apart from research, Mrs. Aparajita has been a passionate teacher teaching different branches of Yoga Therapy, Yoga Psychology etc. Currently Mrs. Aparajita is in charge of library, e-library and conduct of conferences ,seminars, workshops. Mrs. Aparajita has also articles patented on “Screwless femoral hip implant”. 2 students pursuing Masters in Yoga and Naturopathy under the supervision of Ms. Aparajita.",
        "sidebar_details": {
            "Email": "aparajita.sahoofyo@kiit.ac.in"
        },
        "socials": [],
        "tab_details": {
            "Educational Qualification": "Diploma in Yoga and Naturopathy\nM.A. in Yoga and Naturopathy\nPhd in Yoga (Continue)",
            "Memberships": "sivananda yoga sadhan kendra (XXI 1860)"
        },
        "publications": [],
        "books": []
    },
    {
        "name": "Chandan Kumar Mohapatra",
        "profile_url": "https://yoga.kiit.ac.in/profiles/chandan-kumar-mohapatra/",
        "role": "Teaching Associate",
        "bio": "Mr. Chandan Kumar Mohapatra earned his Master in Yoga and Naturopathy along with Master in Bussiness Administration . Mr. Chandan Kumar Mohapatra is working as Teaching Associate in  SCHOOL OF SPRITUALISM AND YOGIC SCIENCES, KIIT(Deemed to be University). He has conferred the young research Award by Foundation of Innovative Research in association with Novel Research Foundation and SN Education Society at Maldives . Mr. Mohapatra has 2 years of teaching experience in teaching Yoga Therapy, Yoga Psychology, Consciousness and Spiritualism Hatha Texts, Patanjali Yoga Sutra etc. He has many publications in high impact journals, He has Published / Filed Patents, Copyrights. Apart from research, Mr. Mohapatra has been a passionate teacher teaching Yoga Therapy, Yoga Psychology, Consciousness, Spiritualism etc. He has guided many Masters Students, B. Tech Students, Law Students, Biotechnology students, Fashion Technology Students, Media Communication Students in their Field .",
        "sidebar_details": {
            "Email": "chandan.mohapatrafyo@kiit.ac.in",
            "Google Scholar": "https://scholar.google.com/citations?user=q0zTltsAAAAJ&hl=en&oi=ao"
        },
        "socials": [],
        "tab_details": {
            "Educational Qualification": "Master in Yoga and Naturopathy\nMaster in Bussiness Administration\nPhd in Yoga (Continue)",
            "Research Interests": "-fact finding on Isvara with respect to Vedic ScripturesAum Chanting \nEstablishment of Aum Chanting Against various UpanishadsConsciousness \n- Establishment of Human Consciousness in terms of Patanjali Yoga Sutra",
            "Administrative Responsibility": "FIC Website,",
            "Awards & Honours": "Received Young Researcher Award for the year 2021 from Foundation of Innovative Research in Association With Novel Research Foundation and SN Education Society at Maldives.",
            "Memberships": "Life Member of Old Age Home Regd. No.- 3972/165"
        },
        "publications": [],
        "books": [
            "1. Significance of AUM in Consciousness, Chandan Kumar Mohapatra, Sasmita Samanta and Biswa Bandita Kar, Journal of Xidian University, VOLUME 15, ISSUE 8, 2021, ISSN No:1001-2400",
            "2. Charan Sparsh: A tradition of Spirituality, Kriti Raj, Isa Mishra, Pradyumna Kishore Behera, Chandan Kumar Mohapatra, Biswa Bandita Kar, Journal of Positive School Psychology,  Vol. 6 No. 5 (2022)",
            "3. Self Realization in Yogic Perceptive: A Comperative analysis From Vedic age to Contemporary,Chandan Kumar Mohapatra,Rituparna Kar, Sashikanta Khuntia,Sanjay Kumar Panda and Biswa Bandita Kar, journal of positive School Psychology, Vol.7, No. 6 (2022). Patents Indian Patents",
            "1. A Novel Cost Effective Device For The Treatment Of Gynecological Tumor,Dr. Biswa Bandita Kar, Mr. Bibhu Datta Sahoo, Mr. Chandan Kumar Mohapatra, Application Number:TEMP/E-1/63990/2021-CHE COPYRIGHT",
            "A Novel Therapuetic Treatment of Endocrine Tumour using Emblica Officinalis and Kanchnaar Guggul Herbs, Dr S. Prema, Dr. R.Thirumalaikumaran, Biswabandita Kar, Bansidhar Mulia, Dr.selvam Arjunan, Dr. Shivkumar VijayaraghavaluDr.Jiju V,Mr.Bibhudatta Sahoo, Mr.ChandanKumar Mohapatra, Mr.Pradyumna Kishore Behera, Application Number : 28098/2021-CO/L."
        ]
    },
    {
        "name": "Kriti Raj",
        "profile_url": "https://yoga.kiit.ac.in/profiles/kriti-raj/",
        "role": "Teaching Assistant",
        "bio": "Ms. Kriti Raj earned her Master in Yoga and Naturopathy along with Master in Sociology & B.Ed in Sociology and Hindi. Ms. Kriti Raj is working as Teaching Assistant in SCHOOL OF SPRITUALISM AND YOGIC SCIENCES, KIIT (Deemed to be University). Ms. Kriti Raj has 9 years of teaching experience in (2 years teaching Hindi, 4 years teaching Hindi and Social Science, 3 years teaching Social Science & Hindi and 2.5 years teaching Yoga Therapy, Yoga Psychology, Consciousness and Spiritualism Hatha Texts, Patanjali Yoga Sutra etc. She has many publications in high impact journals, She has Published / Filed Patents, Copyrights. Apart from research, Ms. Kriti Raj has been a passionate teacher teaching Yoga Therapy, Yoga Psychology, Consciousness, Spiritualism, Indian Yogic Culture and Yogic diet & Nutrition etc. She has guided many Masters Students, B. Tech Students, Law Students, Biotechnology students, Fashion Technology Students, Media Communication Students in their Field. . Ms. Kriti Raj  has been member of Youth Talent Search India, Yogis Sena – ID 68 and Akhil Bhartiya Maha sangh - ABYOGASMS/2021/GM 8441.",
        "sidebar_details": {
            "Email": "kriti.raj@kiit.ac.in",
            "Google Scholar": "https://scholar.google.com/citations?user=HIZL2p0AAAAJ&hl=en"
        },
        "socials": [],
        "tab_details": {
            "Educational Qualification": "●   Master in Yoga and Naturopathy\n●   Master in Sociology \n●   B.Ed in Sociology and Hindi\n●   Ph.D in Yoga  (Continue )\n●   Diploma In Acupressure from OSSS Cuttack, Odisha  \n●   Diploma in Hindi Typing from NFTI, Deoghar\n●   Diploma in Computer Application from Excelnet Infotech, Deoghar",
            "Awards & Honours": "●   A Reflection of Honor & Gratitude Judging Award in STATE LEVEL YOGASAN COMPETITION ( YBBS) 2021- Bhubhaneshwar ,Oddisha.\n●   Honor & Appreciation Judging Award in DISTRICT LEVEL YOGASAN COMPETITION ( YBBS) 2021 – Bhubhaneshwar,Oddisha.\n●   Appreciation of Volunteer Award in 2nd NATIONALS YOGASANA SPORTS CHAMPIONSHIP 2021 – Bhubhaneshwar,Oddisha\n●   Best performer Award in National Service Scheme camp\n●   Bronze Medal 3rd Jharkhand State Taekwondo Championship – 2003\n●   Gold medal 3rd District Taekwondo Championship – 2015\n●   Bronze Medal 25th National Boys & Girls Taekwondo Championship - 2005\n●   Black Belt in Taekwondo – 2019\n●   Best paper presentation (Science of Pranayama ) Certificate in Yoga Mahotsav -2017",
            "Memberships": "●   Youth Talent Search India.\n●   Yogis Sena – ID 68\n●   Akhil Bhartiya Maha sangh - ABYOGASMS/2021/GM 8441",
            "Outreach Activity": "●   Yoga Wellness Program for Believe in Yourself at Aasha Kiran Orphanage, Bhubaneswar, Odisha\n●   Yoga Wellness Program for Mental Health at Baba Bholenath Old Age Home, Deoghar, Jharkhand.\n●   Yoga Wellness Program for Kindness & Happiness at State Bank Of India, Deoghar, Jharkhand."
        },
        "publications": [],
        "books": [
            "1.\tCharanSparsh: A tradition of Spirituality, Kriti Raj, Isa Mishra, Pradyumna Kishore Behera, Chandan Kumar Mohapatra, BiswaBandita Kar, Journal ofPositive School Psychology,  Vol. 6 No. 5 (2022)",
            "1.\tA Novel Herbal Formulation Using Moringa Olifera And Vernonia Amagyadlina Herb To Treat Acute Myleoid Leukemia, Dr. Biswabandita Kar, Ms. Rituparna Kar, Dr. Sanjay Kumar Panda, Mr.Debidatta Das, Mr. Tapan Kumar Panda, Ms. Kriti Raj.",
            "Registration Number :- L-112465/2022"
        ]
    },
    {
        "name": "Rituparna Kar",
        "profile_url": "https://yoga.kiit.ac.in/profiles/rituparna-kar/",
        "role": "FACULTY",
        "bio": "RITUPARNA KAR accolade  her Master in Yoga and Naturopathy   in addition with Master in Education She is pursuing   Ph.D in Yogic Therapy .Recently, Ms Kar is working as faculty  in School of Spiritualism and Yogic Sciences, KIIT (Deemed to be University). She has bestowed with the “Excellence in Teaching Award\" in \"10th International Research and Academic Excellence Awards 2021 (10th IRAEA-2021)” by the Foundation of Innovative Research.. She has the credit to work as Yoga Teacher for Lemed wellness   ,various yogic Institutes in Lucknow UP.  Ms Kar has 12 years of teaching experience in teaching yoga asana pranayama  yogic practises, Yoga Psychology, Samkhya philosophy, Bhagwadgita  etc. She has publications in yoga  journals,. she has  Filed 2 Patents,2 Copyrights, 04 .She has been awarded with the Best student National award by Hirangarbha Vedic Institutes. She has her   certifications from   yoga Alliances USA, Morarji   Disai National Institute of Yoga\nDelhi. University of Lucknow UP, Hirangarva Vedic Institutes ,Kolkata. passionate teacher teaching different Yoga asana with alignment, Yoga Psychology .She is an  aerobic teacher.and kickboxing practioner as well.",
        "sidebar_details": {
            "Email": "rituparna.karfyo@kiit.ac.in"
        },
        "socials": [],
        "tab_details": {
            "Educational Qualification": "MA Education \nMA Yoga and Naturopathy \nContinuing  Phd. in Yoga",
            "Awards & Honours": "“Excellence in Teaching Award\" in \"10th International Research and Academic Excellence Awards 2021 (10th IRAEA-2021)” by the Foundation of Innovative Research.",
            "Memberships": "Yoga Alliance US\nAll Odisa Judge  Yoga Associations"
        },
        "publications": [],
        "books": [
            "1.\tBehavioural And Psychological Impact of Yogasans On Alzheimer Diseases- Case Studies, Rituparna Kar and Biswa Bandita Kar, Journal of Xidian University, VOLUME 15, ISSUE 10, 2021, ISSN No:1001-2400 Utility Patent Patent Title\t\t\t\t:\tLung cancer treatment using Astragalus,  Cisplatin and Vinorelbine",
            "Patent Number \t\t\t:\t202241000705 Status\t\t\t\t\t: \tPublished Inventors\t\t\t \t        : \tDebidatta Das, Dr.Sanjaya Kumar Panda, Dr.Biswa Bandita Kar, Rituparna  Kar, Tapan Kumar Panda",
            "A Novel Drug Formulation of Astragalus, Cisplatin And Vinorelbine to Treat Lung Cancer, Debidatta Das, Biswabandita Kar, Tapan Kumar Panda, Rituparna Kar, Sanjaya Kumar Panda, Application Number - 97/2022-CO/L"
        ]
    },
    {
        "name": "Sashikanta Khuntia",
        "profile_url": "https://yoga.kiit.ac.in/profiles/sashikanta-khuntia/",
        "role": "Faculty",
        "bio": "MR. SASHIKANTA KHUNTIA earned his Master in Yoga and Naturopathy. He is pursuing Ph.D in Yogic Therapy. Presently, Mr Khuntia is working as faculty in School of Spiritualism and Yogic Sciences, KIIT (Deemed to be University). He Completed YIC Course in SVYASA, Bangalore and also SAI NIS Yoga Coach. Mr Khuntia has 17 years  teaching yogasana, pranayama, Shatkarma yogic practises. He is certified National Yoga\nJudge in NYSF and Indian Yoga Federation. He has 6 years of teaching experience in teaching Yoga Therapy, Yoga Psychology, Shatkarma, Consciousness and Spiritualism, Hatha Texts, and Patanjali Yoga Sutra etc. He has publications in Positive School Psychology and I have also Patent . He has guided many Masters Students, B. Tech Students, Law Students, Biotechnology students, Fashion Technology Students, Media Communication Students in their Field .",
        "sidebar_details": {
            "Email": "sashikanta.khuntiafyo@kiit.ac.in"
        },
        "socials": [],
        "tab_details": {
            "Educational Qualification": "Master in Yoga\nContinuing PhD. in Yoga\nOther Yoga Certificate Course\nYIC, SVYASA, Bangalore\nNIS Yoga\n200hr Yoga Alliance Course",
            "Memberships": "Bharat Yoga Kendra\nIndian Yoga Federation\nSVYASA,Banglore\nNational Yogasana Sports Federation\nYoga Alliance"
        },
        "publications": [],
        "books": [
            "1.Self Realization in Yogic Perceptive: A comparative analysis from Vedic age to Contemporary, Chandan Kumar Mohapatra, Rituparna Kar. Sashikanta Khuntia Sanjay Kumar Panda and Biswa Bandita Kar Journal of Positive School Psychology, Vol.7 No. 6 (2022)",
            "1. Patent Title : Screwless Femoral Hip Implant Patent Number : 354841-001 Status : Published Inventors : Mr. Sashikanta Khuntia, Dr. Biswa Bandita Kar, Mr. Bibhudatta Sahoo Ms. Aparajita Sahoo, Dr. P. Karthigeyan"
        ]
    }
]