[
    {
        "profile_url": "https://faculty.kiit.ac.in/anurag-sahu/",
        "name": "Anurag Sahu",
        "role": "Assistant Professor",
        "bio": "Dr. Anurag Sahu has more than 10 years of industry and academic experience in the field of Communication and Journalism. Dr. Sahu has obtained his Ph.D. from Berhampur University. He has done dual Masters in Journalism and Mass Communication, and Business Administration from Utkal University and Pondicherry University respectively. He has presented papers in a number of national and international conferences as well as published research papers and articles in reputed journals and other publications. His teaching and research interests lie in Development Communication, Communication Research and Advertising. When not teaching he enjoys traveling, photography and watching movies.",
        "email": "anurag.sahufmc@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/dranurag.sahu.73/",
            "https://www.instagram.com/anuragsahu718"
        ],
        "academic_profiles": {
            "Scopus": null,
            "Google Scholar": null,
            "ORCID": null
        },
        "sidebar_details": {
            "Email": "anurag.sahufmc@kiit.ac.in",
            "Scopus": null,
            "Google Scholar": null,
            "ORCID": null
        },
        "tab_details": {
            "COURSE EXPERTISE": [],
            "RESEARCH INTERESTS": [
                "web design application development"
            ],
            "Administrative Responsibilities": [
                "Webmaster"
            ],
            "Awards and Achievements": [],
            "Outreach Activity": [],
            "Professional Membership": [
                "Board of Studies Member (JMC Department)BJB Autonomous College."
            ],
            "Projects & Consultancies": [],
            "Patents and Innovations": []
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/bidu-bhusan-dash/",
        "name": "Bidu Bhusan Dash",
        "role": "Assistant Professor",
        "bio": "Dr. Bidu Bhusan Dash, PhD is trained as an academician from Tata Institute of Social Sciences (PhD), Devi Ahilya Vishwavidyalaya (MPhil) and Utkal University (Masters). He has worked as Assistant Professor in the Department of Media and Communication Studies, Savitribai Phule Pune University, Pune during 2016-17, Academic Associate in Communication Area of Indian Institute of Management Kashipur during 2013-16 and Communication Expert in ActionAid India, Bhubaneswar during 2007-08. He has extensively done fieldworks in backward regions of Odisha, Madhya Pradesh, Uttar Pradesh, Uttarakhand and Maharashtra during various research assignments. He has published his research papers in Asia Pacific Media Educator, Journal of Development Communication and other international repute publications. He has also presented his research papers in the International Institute of Social Studies (The Hague, The Netherlands), University of Kelaniya (Colombo, Sri Lanka), Indian Institute of Advanced Study (Shimla, India) and University of Warwick (Warwick, United Kingdom). He was CRY National Child Rights Research Fellow (2013-14) and Charles Wallace Fellow at SOAS, University of London (2015-16). Dr Dash’s research interest includes Development Communication, Communications Management and Media in everyday life.",
        "email": "bidu.dashfmc@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/bidubhusandash/",
            "https://www.linkedin.com/in/bidudash/",
            "https://www.instagram.com/bidubhusandash/",
            "https://twitter.com/BiduDash"
        ],
        "academic_profiles": {
            "Scopus": null,
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=dr9G-lgAAAAJ",
            "ORCID": null
        },
        "sidebar_details": {
            "Email": "bidu.dashfmc@kiit.ac.in",
            "Scopus": null,
            "Google Scholar": "https://scholar.google.com/citations?hl=en&user=dr9G-lgAAAAJ",
            "ORCID": null
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "MA, MPhil, PhD"
            ],
            "COURSE EXPERTISE": [],
            "RESEARCH INTERESTS": [
                "Community Media, Social Media and New Movements, Journalism Education in South Asia"
            ],
            "Administrative Responsibilities": [
                "Student Affairs & Extra-curricular Activities, Research, Events"
            ],
            "Awards and Achievements": [
                "Charles Wallace India Trust Fellow at SOAS, University of London in 2016"
            ],
            "Outreach Activity": [],
            "Professional Membership": [
                "Board of Studies Member at Ravenshaw University and Fakir Mohan University, Member of All India Media and Communication Association (AICMA)"
            ],
            "Projects & Consultancies": [],
            "Patents and Innovations": []
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/chinmoyee-deka/",
        "name": "Chinmoyee Deka",
        "role": "Faculty Associate",
        "bio": "A gold medallist in MA in Mass Communication and Journalism from Tezpur University, Chinmoyee Deka&#39;s area of specialization is Environmental Communication and Print Journalism. She qualified the UGC-NET in Mass Communication and Journalism in 2021and has participated in seminars and workshops like Youth Wellness Festival and North East Youth Conclave, on topics like Media Narratives on Mental Health, Media&#39;s Role in Peace and Conflict Resolution, and Creative Strategic Thinking for Social Change. She has interned with the Press Council of India and has worked in B2B content writing agencies, social media marketing positions, and news portal. She has also delivered graphic designing projects as a part of her work profile. She has a keen interest in print and digital journalism surrounding various scientific issues like environment and health. She is intrigued by the changing trends of writing and its effects on the understanding and perception of issues in society. Her hobbies include photography, poetry, travelling, and writing.",
        "email": null,
        "social_links": [
            "https://m.facebook.com/100001743158577/",
            "https://www.linkedin.com/in/chinmoyee-deka-a975a785"
        ],
        "academic_profiles": {
            "Scopus": null,
            "Google Scholar": null,
            "ORCID": null
        },
        "sidebar_details": {
            "Email": null,
            "Scopus": null,
            "Google Scholar": null,
            "ORCID": null
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "MA in MCJ"
            ],
            "COURSE EXPERTISE": [],
            "RESEARCH INTERESTS": [
                "Environmental Journalism, Print Journalism"
            ],
            "Administrative Responsibilities": [
                "Student Affairs & Extra-curricular Activities, Social Media, Hostel, Study Tours"
            ],
            "Awards and Achievements": [],
            "Outreach Activity": [],
            "Professional Membership": [],
            "Projects & Consultancies": [],
            "Patents and Innovations": []
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/rajeev-kumar-panda/",
        "name": "Rajeev Kumar Panda",
        "role": "Dean",
        "bio": "Dr. Rajeev Kumar Panda has over 20 years of expertise in Teaching & Industry in the area of TV Production/Direction, Electronic Cinematography, Broadcast Journalism & Film Studies. He is a Trainer with the GNI (Google News Initiative) India Training Network, as well as a Trainer with BBC Young Reporter India, which was launched by BBC News in association with Internews and Dataleads. His voyage to the field of mass communication travelled via physics and film school. His background in the practice of films has allowed him to blend his artistic and educational interests by connecting storytelling, critique, and the artistic process to academic skill development. He began teaching in 2001 after graduating from the prestigious Biju Pattnaik Film and TV Institute of Odisha. He has done his PhD from Assam University, Silchar. His PhD Thesis was on Indian Cinema. His publications include several topics on journalism, new media, radio and film studies. In most of his studies, the purpose is to discover how technology influences society and also the film portrayals and perspectives affecting society. He has presented a number of papers at national and international conferences. He has also chaired and co-chaired different sessions at conferences. He had conducted over 50 workshops in universities and colleges throughout India, including the prestigious Delhi University, Kolkata University, GGSIP University, and Rajasthan University, to name a few. Soaring high is his nature. He is the former head of Film and TV at Apeejay Institute of Mass Communication, New Delhi.",
        "email": null,
        "social_links": [],
        "academic_profiles": {
            "Scopus": null,
            "Google Scholar": null,
            "ORCID": null
        },
        "sidebar_details": {
            "Email": null,
            "Scopus": null,
            "Google Scholar": null,
            "ORCID": null
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PhD in Mass Communication (Assam University, Silchar)\nDiploma in Cinematography\nMJMC"
            ],
            "COURSE EXPERTISE": [],
            "RESEARCH INTERESTS": [
                "Film Studies"
            ],
            "Administrative Responsibilities": [
                "Admission, Placement"
            ],
            "Awards and Achievements": [],
            "Outreach Activity": [],
            "Professional Membership": [],
            "Projects & Consultancies": [],
            "Patents and Innovations": []
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/ruby-nanda/",
        "name": "Ruby Nanda",
        "role": "Assistant Professor",
        "bio": "A CBSE-UGC NET in Mass Communication and Journalism, Ms Ruby Nanda is currently pursuing PhD in Mass Communication and Journalism from Utkal University. A college topper in Plus Two and Masters, University second topper in BA English (Hons), Ms Nanda did double masters in English literature and Journalism from Sambalpur University and Guru Jambeswar University of Science and Technology respectively. She has also done PG Diploma in English Journalism from Indian Institute of Mass Communication (IIMC), New Delhi. She has attended National and International Conferences and published papers. She has nearly a decade of experience as a journalist across media platforms in top media organizations like Asian Age, Pitch, The Press Trust of India (PTI), The Times of India, Eastern Media Pvt Limited. A polygot and translator,",
        "email": "ruby.nandafmc@kiit.ac.in",
        "social_links": [],
        "academic_profiles": {
            "Scopus": null,
            "Google Scholar": null,
            "ORCID": null
        },
        "sidebar_details": {
            "Email": "ruby.nandafmc@kiit.ac.in",
            "Scopus": null,
            "Google Scholar": null,
            "ORCID": null
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [
                "PG Diploma in English Journalism"
            ],
            "COURSE EXPERTISE": [],
            "RESEARCH INTERESTS": [
                "Development Journalism, Feature writing, Gender and Gerontology, Online Journalism, Health Communication, Communication Theory and Research."
            ],
            "Administrative Responsibilities": [],
            "Awards and Achievements": [
                "The Hindu award in IIMC"
            ],
            "Outreach Activity": [
                "She has written multiple articles in newspapers and magazines. She has hands-on experience in news agency, print, magazine and online platforms. She has written course book for Odisha Open University. She has written two Coffee Table Books for The Times of India and Sambad respectively."
            ],
            "Professional Membership": [],
            "Patents and Innovations": []
        }
    },
    {
        "profile_url": "https://faculty.kiit.ac.in/sananda-mukherjee/",
        "name": "Sananda Mukherjee",
        "role": "Assistant Professor",
        "bio": "Dr Sananda Mukherjee, PhD is an alumnus of the Manipal Institute of Communication(PhD), Sharda University(Masters), Asutosh College, Calcutta University(Bachelors). She comes with industry experience in the field of advertising with eminent advertising agencies in the country. She has worked with brands like Videocon, Amway, Goodyear Tyres, DLF, Amity University and Delhi Police (Vigilance). Dr Mukherjee has presented her research at various National and International conferences across the country and has published several research papers in National and International reputed journals. She also holds a Diploma in Animation and Multimedia from St. Xavier’s College, Kolkata. Her teaching and research interests lie in Advertising, Health Communication, Hospital Communication and Interpersonal Communication. She is also an avid traveller and a music enthusiast.",
        "email": "sananda.mukherjeefmc@kiit.ac.in",
        "social_links": [
            "https://www.facebook.com/sananda.mukherjee.18/",
            "https://www.linkedin.com/in/mukherjee-sananda-130823100/"
        ],
        "academic_profiles": {
            "Scopus": null,
            "Google Scholar": "https://scholar.google.com/citations?view_op=list_works&hl=en&authuser=1&user=gOF8FlYAAAAJ",
            "ORCID": null
        },
        "sidebar_details": {
            "Email": "sananda.mukherjeefmc@kiit.ac.in",
            "Scopus": null,
            "Google Scholar": "https://scholar.google.com/citations?view_op=list_works&hl=en&authuser=1&user=gOF8FlYAAAAJ",
            "ORCID": null
        },
        "tab_details": {
            "EDUCATIONAL QUALIFICATION": [],
            "COURSE EXPERTISE": [],
            "RESEARCH INTERESTS": [
                "Health Communication, Hospital Communication, Advertising"
            ],
            "Administrative Responsibilities": [
                "Discipline, Staff Welfare, Training, Internship & Placement"
            ],
            "Awards and Achievements": [],
            "Outreach Activity": [],
            "Patents and Innovations": []
        }
    }
]